.тип п 3*a-, п 3a-, п 3*a/c-
//--------------------------------------------------------------------------
// Пример: младшенький, неблизкий
// Отсутствует сравнительная степень, краткие формы и наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // удаленьк-ий
    ого, Р              // удаленьк-ого
    ому, Д              // удаленьк-ому
    ий, Вн              // удаленьк-ий
    ого, Во             // удаленьк-ого
    им, Т               // удаленьк-им
    ом, П               // о удаленьк-ом
  .род ж
    ая, И               // удаленьк-ая
    ой, Р               // удаленьк-ой
    ой, Д               // удаленьк-ой
    ую, В               // удаленьк-ую
    ой, Т               // удаленьк-ой
    ою, Т               // удаленьк-ою
    ой, П               // о удаленьк-ой
  .род с
    ое, И               // удаленьк-ое
    ого, Р              // удаленьк-ого
    ому, Д              // удаленьк-ому
    ое, В               // удаленьк-ое
    им, Т               // удаленьк-им
    ом, П               // о удаленьк-ом
  .род
  .число М
    ие, И               // удаленьк-ие
    их, Р               // удаленьк-их
    им, Д               // удаленьк-им
    ие, Вн              // удаленьк-ие
    их, Во              // удаленьк-их
    ими, Т              // удаленьк-ими
    их, П               // удаленьк-их
}

.тип п 3*a!&
//--------------------------------------------------------------------------
// Пример: удаленький
// Отсутствует сравнительная степень и краткие формы
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // удаленьк-ий
    ого, Р              // удаленьк-ого
    ому, Д              // удаленьк-ому
    ий, Вн              // удаленьк-ий
    ого, Во             // удаленьк-ого
    им, Т               // удаленьк-им
    ом, П               // о удаленьк-ом
  .род ж
    ая, И               // удаленьк-ая
    ой, Р               // удаленьк-ой
    ой, Д               // удаленьк-ой
    ую, В               // удаленьк-ую
    ой, Т               // удаленьк-ой
    ою, Т               // удаленьк-ою
    ой, П               // о удаленьк-ой
  .род с
    ое, И               // удаленьк-ое
    ого, Р              // удаленьк-ого
    ому, Д              // удаленьк-ому
    ое, В               // удаленьк-ое
    им, Т               // удаленьк-им
    ом, П               // о удаленьк-ом
  .род
  .число М
    ие, И               // удаленьк-ие
    их, Р               // удаленьк-их
    им, Д               // удаленьк-им
    ие, Вн              // удаленьк-ие
    их, Во              // удаленьк-их
    ими, Т              // удаленьк-ими
    их, П               // удаленьк-их
  .число
    о, нр               // удаленьк-о
}

.тип п 3*a&, п 3*a/b&, п 3a'&, п 3*a'&, п 3a/c&, п 3*a/c&
//--------------------------------------------------------------------------
// Пример: тугоплавкий
// Отсутствует сравнительная степень
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // тугоплавк-ий
    ого, Р              // тугоплавк-ого
    ому, Д              // тугоплавк-ому
    ий, Вн              // тугоплавк-ий
    ого, Во             // тугоплавк-ого
    им, Т               // тугоплавк-им
    ом, П               // о тугоплавк-ом
    '', кф              // тугоплавок
  .род ж
    ая, И               // тугоплавк-ая
    ой, Р               // тугоплавк-ой
    ой, Д               // тугоплавк-ой
    ую, В               // тугоплавк-ую
    ой, Т               // тугоплавк-ой
    ою, Т               // тугоплавк-ою
    ой, П               // о тугоплавк-ой
    а, кф               // тугоплавк-а
  .род с
    ое, И               // тугоплавк-ое
    ого, Р              // тугоплавк-ого
    ому, Д              // тугоплавк-ому
    ое, В               // тугоплавк-ое
    им, Т               // тугоплавк-им
    ом, П               // о тугоплавк-ом
    о, кф               // тугоплавк-о
  .род
  .число М
    ие, И               // тугоплавк-ие
    их, Р               // тугоплавк-их
    им, Д               // тугоплавк-им
    ие, Вн              // тугоплавк-ие
    их, Во              // тугоплавк-их
    ими, Т              // тугоплавк-ими
    их, П               // тугоплавк-их
    и, кф               // тугоплавк-и
  .число
    о, нр               // тугоплавк-о
}

.тип п 3*a, п 3*a', п 3*a/b, п 3*a/c
//--------------------------------------------------------------------------
// Пример: зоркий, легкий, прыткий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // зорк-ий
    ого, Р              // зорк-ого
    ому, Д              // зорк-ому
    ий, Вн              // зорк-ий
    ого, Во             // зорк-ого
    им, Т               // зорк-им
    ом, П               // о зорк-ом
    '', кф              // зорок
  .род ж
    ая, И               // зорк-ая
    ой, Р               // зорк-ой
    ой, Д               // зорк-ой
    ую, В               // зорк-ую
    ой, Т               // зорк-ой
    ою, Т               // зорк-ою
    ой, П               // о зорк-ой
    а, кф               // зорк-а
  .род с
    ое, И               // зорк-ое
    ого, Р              // зорк-ого
    ому, Д              // зорк-ому
    ое, В               // зорк-ое
    им, Т               // зорк-им
    ом, П               // о зорк-ом
    о, кф               // зорк-о
  .род
  .число М
    ие, И               // зорк-ие
    их, Р               // зорк-их
    им, Д               // зорк-им
    ие, Вн              // зорк-ие
    их, Во              // зорк-их
    ими, Т              // зорк-ими
    их, П               // зорк-их
    и, кф               // зорк-и
  .число
    е, ср               // зорч-е
    о, нр               // зорк-о
}

.тип п 3*a'E1_ср_зтр, п 3*a/cE1_ср_зтр
//--------------------------------------------------------------------------
// Пример: валкий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    кий, И               // вал-кий
    кого, Р              // вал-кого
    кому, Д              // вал-кому
    кий, Вн              // вал-кий
    кого, Во             // вал-кого
    ким, Т               // вал-ким
    ком, П               // о вал-ком
    ок, кф               // вал-ок
  .род ж
    кая, И               // вал-кая
    кой, Р               // вал-кой
    кой, Д               // вал-кой
    кую, В               // вал-кую
    кой, Т               // вал-кой
    кою, Т               // вал-кою
    кой, П               // о вал-кой
    ка, кф               // вал-ка
  .род с
    кое, И               // вал-кое
    кого, Р              // вал-кого
    кому, Д              // вал-кому
    кое, В               // вал-кое
    ким, Т               // вал-ким
    ком, П               // о вал-ком
    ко, кф               // вал-ко
  .род
  .число М
    кие, И               // вал-кие
    ких, Р               // вал-ких
    ким, Д               // вал-ким
    кие, Вн              // вал-кие
    ких, Во              // вал-ких
    кими, Т              // вал-кими
    ких, П               // вал-ких
    ки, кф               // вал-ки
  .число
    че, ср|затрудн       // вал-че
    ьче, ср|затрудн      // вал-ьче
    ко, нр               // вал-ко
}

.тип п 3*a/cE2
//--------------------------------------------------------------------------
// Пример: мерзкий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    кий, И
    кого, Р
    кому, Д
    кий, Вн
    кого, Во
    ким, Т
    ком, П
    ок, кф
  .род ж
    кая, И
    кой, Р
    кой, Д
    кую, В
    кой, Т
    кою, Т
    кой, П
    ка, кф
  .род с
    кое, И
    кого, Р
    кому, Д
    кое, В
    ким, Т
    ком, П
    ко, кф
  .род
  .число М
    кие, И
    ких, Р
    ким, Д
    кие, Вн
    ких, Во
    кими, Т
    ких, П
    ки, кф
  .число
    че, ср|затрудн
    ее, ср|затрудн
    ей, ср|затрудн
    ко, нр
}

.тип п 3*a&E1
//--------------------------------------------------------------------------
// Пример: свеженек
// Отсутствуют полные формы
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ек, кф              // свежен-ек
  .род ж
    ька, кф             // свежен-ька
  .род с
    ько, кф             // свежен-ько
  .род
  .число М
    ьки, кф             // свежен-ьки
}

.тип п 3*a'&_кфж_зтр, п 3*a&_кфж_зтр, п 3a'&_кфж_зтр
//--------------------------------------------------------------------------
// Пример: полумягкий
// Отсутствует сравнительная степень, кф. ж. затрудн.
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // полумягк-ий
    ого, Р              // полумягк-ого
    ому, Д              // полумягк-ому
    ий, Вн              // полумягк-ий
    ого, Во             // полумягк-ого
    им, Т               // полумягк-им
    ом, П               // о полумягк-ом
    '', кф              // тугоплавок
  .род ж
    ая, И               // полумягк-ая
    ой, Р               // полумягк-ой
    ой, Д               // полумягк-ой
    ую, В               // полумягк-ую
    ой, Т               // полумягк-ой
    ою, Т               // полумягк-ою
    ой, П               // о полумягк-ой
    а, кф|затрудн       // полумягк-а
  .род с
    ое, И               // полумягк-ое
    ого, Р              // полумягк-ого
    ому, Д              // полумягк-ому
    ое, В               // полумягк-ое
    им, Т               // полумягк-им
    ом, П               // о полумягк-ом
    о, кф               // полумягк-о
  .род
  .число М
    ие, И               // полумягк-ие
    их, Р               // полумягк-их
    им, Д               // полумягк-им
    ие, Вн              // полумягк-ие
    их, Во              // полумягк-их
    ими, Т              // полумягк-ими
    их, П               // полумягк-их
    и, кф               // полумягк-и
  .число
    о, нр               // полумягк-о
}

.тип п 3*a_ср_зтр, п 3*a'_ср_зтр, п 3*a/c_ср_зтр, п 3a!_ср_зтр
//--------------------------------------------------------------------------
// Пример: верткий
// Затруднена сравнительная степень
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // верт-кий
    ого, Р              // верт-кого
    ому, Д              // верт-кому
    ий, Вн              // верт-кий
    ого, Во             // верт-кого
    им, Т               // верт-ким
    ом, П               // о верт-ком
    '', кф              // верт-ок
  .род ж
    ая, И               // верт-кая
    ой, Р               // верт-кой
    ой, Д               // верт-кой
    ую, В               // верт-кую
    ой, Т               // верт-кой
    ою, Т               // верт-кою
    ой, П               // о верт-кой
    а, кф               // верт-ка
  .род с
    ое, И               // верт-кое
    ого, Р              // верт-кого
    ому, Д              // верт-кому
    ое, В               // верт-кое
    им, Т               // верт-ким
    ом, П               // о верт-ком
    о, кф               // верт-ко
  .род
  .число М
    ие, И               // верт-кие
    их, Р               // верт-ких
    им, Д               // верт-ким
    ие, Вн              // верт-кие
    их, Во              // верт-ких
    ими, Т              // верт-кими
    их, П               // верт-ких
    и, кф               // верт-ки
  .число
    е, ср|затрудн       // верт-че
    о, нр               // верт-ко
}

.тип п 3a&
//--------------------------------------------------------------------------
// Пример: пегий
// Отсутствует сравнительная степень и наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // пег-ий
    ого, Р              // пег-ого
    ому, Д              // пег-ому
    ий, Вн              // пег-ий
    ого, Во             // пег-ого
    им, Т               // пег-им
    ом, П               // о пег-ом
    '', кф              // пег
  .род ж
    ая, И               // пег-ая
    ой, Р               // пег-ой
    ой, Д               // пег-ой
    ую, В               // пег-ую
    ой, Т               // пег-ой
    ою, Т               // пег-ою
    ой, П               // о пег-ой
    а, кф               // пег-а
  .род с
    ое, И               // пег-ое
    ого, Р              // пег-ого
    ому, Д              // пег-ому
    ое, В               // пег-ое
    им, Т               // пег-им
    ом, П               // о пег-ом
    о, кф               // пег-о
  .род
  .число М
    ие, И               // пег-ие
    их, Р               // пег-их
    им, Д               // пег-им
    ие, Вн              // пег-ие
    их, Во              // пег-их
    ими, Т              // пег-ими
    их, П               // пег-их
    и, кф               // пег-и
}

.тип п 3a1!&
//--------------------------------------------------------------------------
// Пример: арабский
// Отсутствует сравнительная степень и краткие формы
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // арабск-ий
    ого, Р              // арабск-ого
    ому, Д              // арабск-ому
    ий, Вн              // арабск-ий
    ого, Во             // арабск-ого
    им, Т               // арабск-им
    ом, П               // о арабск-ом
  .род ж
    ая, И               // арабск-ая
    ой, Р               // арабск-ой
    ой, Д               // арабск-ой
    ую, В               // арабск-ую
    ой, Т               // арабск-ой
    ою, Т               // арабск-ою
    ой, П               // о арабск-ой
  .род с
    ое, И               // арабск-ое
    ого, Р              // арабск-ого
    ому, Д              // арабск-ому
    ое, В               // арабск-ое
    им, Т               // арабск-им
    ом, П               // о арабск-ом
  .род
  .число М
    ие, И               // арабск-ие
    их, Р               // арабск-их
    им, Д               // арабск-им
    ие, Вн              // арабск-ие
    их, Во              // арабск-их
    ими, Т              // арабск-ими
    их, П               // арабск-их
  .число
    и, нр               // арабск-и, по-арабск-и
    о, соед             // арабск-о - ????ский - соединительная гласная
}

.тип п 3a1-
//--------------------------------------------------------------------------
// Пример: англо-русский
// Отсутствует сравнительная степень, краткие формы и наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // арабск-ий
    ого, Р              // арабск-ого
    ому, Д              // арабск-ому
    ий, Вн              // арабск-ий
    ого, Во             // арабск-ого
    им, Т               // арабск-им
    ом, П               // о арабск-ом
  .род ж
    ая, И               // арабск-ая
    ой, Р               // арабск-ой
    ой, Д               // арабск-ой
    ую, В               // арабск-ую
    ой, Т               // арабск-ой
    ою, Т               // арабск-ою
    ой, П               // о арабск-ой
  .род с
    ое, И               // арабск-ое
    ого, Р              // арабск-ого
    ому, Д              // арабск-ому
    ое, В               // арабск-ое
    им, Т               // арабск-им
    ом, П               // о арабск-ом
  .род
  .число М
    ие, И               // арабск-ие
    их, Р               // арабск-их
    им, Д               // арабск-им
    ие, Вн              // арабск-ие
    их, Во              // арабск-их
    ими, Т              // арабск-ими
    их, П               // арабск-их
}

.тип п 3a1!&:f-
//--------------------------------------------------------------------------
// Пример: сельтерский (сельтерская водка)
// Присутстпуют только полные формы женского рода
//--------------------------------------------------------------------------
{
  .число Е
  .род ж
    ая, И               // сельтерск-ая
    ой, Р               // сельтерск-ой
    ой, Д               // сельтерск-ой
    ую, В               // сельтерск-ую
    ой, Т               // сельтерск-ой
    ою, Т               // сельтерск-ою
    ой, П               // о сельтерск-ой
}

.тип п 3*a/cE1, п 3*a/c', п 3*a/c'E1, п 3*a/c'E2, п 3*a/c'E3
//--------------------------------------------------------------------------
// Пример: звонкий, мягкий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // звон-кий
    ого, Р              // звон-кого
    ому, Д              // звон-кому
    ий, Вн              // звон-кий
    ого, Во             // звон-кого
    им, Т               // звон-ким
    ом, П               // о звон-ком
    '', кф              // звон-ок
  .род ж
    ая, И               // звон-кая
    ой, Р               // звон-кой
    ой, Д               // звон-кой
    ую, В               // звон-кую
    ой, Т               // звон-кой
    ою, Т               // звон-кою
    ой, П               // о звон-кой
    а, кф               // звон-ка
  .род с
    ое, И               // звон-кое
    ого, Р              // звон-кого
    ому, Д              // звон-кому
    ое, В               // звон-кое
    им, Т               // звон-ким
    ом, П               // о звон-ком
    о, кф               // звон-ко
  .род
  .число М
    ие, И               // звон-кие
    их, Р               // звон-ких
    им, Д               // звон-ким
    ие, Вн              // звон-кие
    их, Во              // звон-ких
    ими, Т              // звон-кими
    их, П               // звон-ких
    и, кф               // звон-ки
  .число
    е, ср               // звон-че
    о, нр               // звон-ко
}

.тип п 3*a/c'E4
//--------------------------------------------------------------------------
// Пример: ловкий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    кий, И               // звон-кий
    кого, Р              // звон-кого
    кому, Д              // звон-кому
    кий, Вн              // звон-кий
    кого, Во             // звон-кого
    ким, Т               // звон-ким
    ком, П               // о звон-ком
    ок, кф               // звон-ок
  .род ж
    кая, И               // звон-кая
    кой, Р               // звон-кой
    кой, Д               // звон-кой
    кую, В               // звон-кую
    кой, Т               // звон-кой
    кою, Т               // звон-кою
    кой, П               // о звон-кой
    ка, кф               // звон-ка
  .род с
    кое, И               // звон-кое
    кого, Р              // звон-кого
    кому, Д              // звон-кому
    кое, В               // звон-кое
    ким, Т               // звон-ким
    ком, П               // о звон-ком
    ко, кф               // звон-ко
  .род
  .число М
    кие, И               // звон-кие
    ких, Р               // звон-ких
    ким, Д               // звон-ким
    кие, Вн              // звон-кие
    ких, Во              // звон-ких
    кими, Т              // звон-кими
    ких, П               // звон-ких
    ки, кф               // звон-ки
  .число
    чее, ср              // звон-че
    чей, ср
    че, ср
    ко, нр               // звон-ко
}

.тип п 3*a/c'E5
//--------------------------------------------------------------------------
// Пример: бойкий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // звон-кий
    ого, Р              // звон-кого
    ому, Д              // звон-кому
    ий, Вн              // звон-кий
    ого, Во             // звон-кого
    им, Т               // звон-ким
    ом, П               // о звон-ком
    '', кф              // звон-ок
  .род ж
    ая, И               // звон-кая
    ой, Р               // звон-кой
    ой, Д               // звон-кой
    ую, В               // звон-кую
    ой, Т               // звон-кой
    ою, Т               // звон-кою
    ой, П               // о звон-кой
    а, кф               // звон-ка
  .род с
    ое, И               // звон-кое
    ого, Р              // звон-кого
    ому, Д              // звон-кому
    ое, В               // звон-кое
    им, Т               // звон-ким
    ом, П               // о звон-ком
    о, кф               // звон-ко
  .род
  .число М
    ие, И               // звон-кие
    их, Р               // звон-ких
    им, Д               // звон-ким
    ие, Вн              // звон-кие
    их, Во              // звон-ких
    ими, Т              // звон-кими
    их, П               // звон-ких
    и, кф               // звон-ки
  .число
    ее, ср
    е, ср               // звон-че
    о, нр               // звон-ко
}

.тип п 3*a/c'E6
//--------------------------------------------------------------------------
// Пример: горький
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // горьк-ий
    ого, Р              // горьк-ого
    ому, Д              // горьк-ому
    ий, Вн              // горьк-ий
    ого, Во             // горьк-ого
    им, Т               // горьк-им
    ом, П               // о горьк-ом
    '', кф              // горек
  .род ж
    ая, И               // горьк-ая
    ой, Р               // горьк-ой
    ой, Д               // горьк-ой
    ую, В               // горьк-ую
    ой, Т               // горьк-ой
    ою, Т               // горьк-ою
    ой, П               // о горьк-ой
    а, кф               // горьк-а
  .род с
    ое, И               // горьк-ое
    ого, Р              // горьк-ого
    ому, Д              // горьк-ому
    ое, В               // горьк-ое
    им, Т               // горьк-им
    ом, П               // о горьк-ом
    о, кф               // горьк-о
  .род
  .число М
    ие, И               // горьк-ие
    их, Р               // горьк-их
    им, Д               // горьк-им
    ие, Вн              // горьк-ие
    их, Во              // горьк-их
    ими, Т              // горьк-ими
    их, П               // о горьк-их
    и, кф               // горьк-и
  .число
    че, ср              // гор-че
    ше, ср              // гор-ше
    о, нр               // горьк-о
}

.тип п 3a/c'', п 3a/c'
//--------------------------------------------------------------------------
// Пример: высокий, тихий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // высок-ий
    ого, Р              // высок-ого
    ому, Д              // высок-ому
    ий, Вн              // высок-ий
    ого, Во             // высок-ого
    им, Т               // высок-им
    ом, П               // о высок-ом
    '', кф              // высок
  .род ж
    ая, И               // высок-ая
    ой, Р               // высок-ой
    ой, Д               // высок-ой
    ую, В               // высок-ую
    ой, Т               // высок-ой
    ою, Т               // высок-ою
    ой, П               // о высок-ой
    а, кф               // высок-а
  .род с
    ое, И               // высок-ое
    ого, Р              // высок-ого
    ому, Д              // высок-ому
    ое, В               // высок-ое
    им, Т               // высок-им
    ом, П               // о высок-ом
    о, кф               // высок-о
  .род
  .число М
    ие, И               // высок-ие
    их, Р               // высок-их
    им, Д               // высок-им
    ие, Вн              // высок-ие
    их, Во              // высок-их
    ими, Т              // высок-ими
    их, П               // высок-их
    и, кф               // высок-и
  .число
    е, ср               // выш-е
    о, нр               // высок-о
}

.тип п 3a/c_ср_зтр
//--------------------------------------------------------------------------
// Пример: ветхий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // высок-ий
    ого, Р              // высок-ого
    ому, Д              // высок-ому
    ий, Вн              // высок-ий
    ого, Во             // высок-ого
    им, Т               // высок-им
    ом, П               // о высок-ом
    '', кф              // высок
  .род ж
    ая, И               // высок-ая
    ой, Р               // высок-ой
    ой, Д               // высок-ой
    ую, В               // высок-ую
    ой, Т               // высок-ой
    ою, Т               // высок-ою
    ой, П               // о высок-ой
    а, кф               // высок-а
  .род с
    ое, И               // высок-ое
    ого, Р              // высок-ого
    ому, Д              // высок-ому
    ое, В               // высок-ое
    им, Т               // высок-им
    ом, П               // о высок-ом
    о, кф               // высок-о
  .род
  .число М
    ие, И               // высок-ие
    их, Р               // высок-их
    им, Д               // высок-им
    ие, Вн              // высок-ие
    их, Во              // высок-их
    ими, Т              // высок-ими
    их, П               // высок-их
    и, кф               // высок-и
  .число
    е, ср|затрудн       // выш-е
    о, нр               // высок-о
}

.тип п 3a/cE1_ср_зтр
//--------------------------------------------------------------------------
// Пример: дикий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И
    ого, Р
    ому, Д
    ий, Вн
    ого, Во
    им, Т
    ом, П
    '', кф
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
    а, кф
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    им, Т
    ом, П
    о, кф
  .род
  .число М
    ие, И
    их, Р
    им, Д
    ие, Вн
    их, Во
    ими, Т
    их, П
    и, кф
  .число
    е, ср|затрудн
    ее, ср|затрудн
    ей, ср|затрудн
    о, нр
}

.тип п 3a/c''&
//--------------------------------------------------------------------------
// Пример: невысокий
// Отсутствует сравнительная степень
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // невысок-ий
    ого, Р              // невысок-ого
    ому, Д              // невысок-ому
    ий, Вн              // невысок-ий
    ого, Во             // невысок-ого
    им, Т               // невысок-им
    ом, П               // о невысок-ом
    '', кф              // невысок
  .род ж
    ая, И               // невысок-ая
    ой, Р               // невысок-ой
    ой, Д               // невысок-ой
    ую, В               // невысок-ую
    ой, Т               // невысок-ой
    ою, Т               // невысок-ою
    ой, П               // о невысок-ой
    а, кф               // невысок-а
  .род с
    ое, И               // невысок-ое
    ого, Р              // невысок-ого
    ому, Д              // невысок-ому
    ое, В               // невысок-ое
    им, Т               // невысок-им
    ом, П               // о невысок-ом
    о, кф               // невысок-о
  .род
  .число М
    ие, И               // невысок-ие
    их, Р               // невысок-их
    им, Д               // невысок-им
    ие, Вн              // невысок-ие
    их, Во              // невысок-их
    ими, Т              // невысок-ими
    их, П               // невысок-их
    и, кф               // невысок-и
  .число
    о, нр               // невысок-о
}

.тип п 3b?&, п 3b/c!&, п 3b/c'!&
//--------------------------------------------------------------------------
// Пример: ведовской
// Отсутствует сравнительная степень, краткие формы и наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ой, И               // ведовск-ой
    ого, Р              // ведовск-ого
    ому, Д              // ведовск-ому
    ой, Вн              // ведовск-ой
    ого, Во             // ведовск-ого
    им, Т               // ведовск-им
    ом, П               // о ведовск-ом
  .род ж
    ая, И               // ведовск-ая
    ой, Р               // ведовск-ой
    ой, Д               // ведовск-ой
    ую, В               // ведовск-ую
    ой, Т               // ведовск-ой
    ою, Т               // ведовск-ою
    ой, П               // о ведовск-ой
  .род с
    ое, И               // ведовск-ое
    ого, Р              // ведовск-ого
    ому, Д              // ведовск-ому
    ое, В               // ведовск-ое
    им, Т               // ведовск-им
    ом, П               // о ведовск-ом
  .род
  .число М
    ие, И               // ведовск-ие
    их, Р               // ведовск-их
    им, Д               // ведовск-им
    ие, Вн              // ведовск-ие
    их, Во              // ведовск-их
    ими, Т              // ведовск-ими
    их, П               // ведовск-их
}

.тип п 3b/c&, п 3b/c'&
//--------------------------------------------------------------------------
// Пример: благой
// Отсутствует сравнительная степень
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ой, И               // благ-ой
    ого, Р              // благ-ого
    ому, Д              // благ-ому
    ой, Вн              // благ-ой
    ого, Во             // благ-ого
    им, Т               // благ-им
    ом, П               // о благ-ом
    '', кф              // благ
  .род ж
    ая, И               // благ-ая
    ой, Р               // благ-ой
    ой, Д               // благ-ой
    ую, В               // благ-ую
    ой, Т               // благ-ой
    ою, Т               // благ-ою
    ой, П               // о благ-ой
    а, кф               // благ-а
  .род с
    ое, И               // благ-ое
    ого, Р              // благ-ого
    ому, Д              // благ-ому
    ое, В               // благ-ое
    им, Т               // благ-им
    ом, П               // о благ-ом
    о, кф               // благ-о
  .род
  .число М
    ие, И               // благ-ие
    их, Р               // благ-их
    им, Д               // благ-им
    ие, Вн              // благ-ие
    их, Во              // благ-их
    ими, Т              // благ-ими
    их, П               // благ-их
    и, кф               // благ-и
  .число
    о, нр               // благ-о
}

.тип п 3b/c', п 3b/c
//--------------------------------------------------------------------------
// Пример: сухой
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ой, И               // сух-ой
    ого, Р              // сух-ого
    ому, Д              // сух-ому
    ой, Вн              // сух-ой
    ого, Во             // сух-ого
    им, Т               // сух-им
    ом, П               // о сух-ом
    '', кф              // сух
  .род ж
    ая, И               // сух-ая
    ой, Р               // сух-ой
    ой, Д               // сух-ой
    ую, В               // сух-ую
    ой, Т               // сух-ой
    ою, Т               // сух-ою
    ой, П               // о сух-ой
    а, кф               // сух-а
  .род с
    ое, И               // сух-ое
    ого, Р              // сух-ого
    ому, Д              // сух-ому
    ое, В               // сух-ое
    им, Т               // сух-им
    ом, П               // о сух-ом
    о, кф               // сух-о
  .род
  .число М
    ие, И               // сух-ие
    их, Р               // сух-их
    им, Д               // сух-им
    ие, Вн              // сух-ие
    их, Во              // сух-их
    ими, Т              // сух-ими
    их, П               // сух-их
    и, кф               // сух-и
  .число
    е, ср               // суш-е
    о, нр               // сух-о
}

.тип п 3b/c'_ср_зтр
//--------------------------------------------------------------------------
// Пример: лихой
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ой, И               // лих-ой
    ого, Р              // лих-ого
    ому, Д              // лих-ому
    ой, Вн              // лих-ой
    ого, Во             // лих-ого
    им, Т               // лих-им
    ом, П               // о лих-ом
    '', кф              // лих
  .род ж
    ая, И               // лих-ая
    ой, Р               // лих-ой
    ой, Д               // лих-ой
    ую, В               // лих-ую
    ой, Т               // лих-ой
    ою, Т               // лих-ою
    ой, П               // о лих-ой
    а, кф               // лих-а
  .род с
    ое, И               // лих-ое
    ого, Р              // лих-ого
    ому, Д              // лих-ому
    ое, В               // лих-ое
    им, Т               // лих-им
    ом, П               // о лих-ом
    о, кф               // лих-о
  .род
  .число М
    ие, И               // лих-ие
    их, Р               // лих-их
    им, Д               // лих-им
    ие, Вн              // лих-ие
    их, Во              // лих-их
    ими, Т              // лих-ими
    их, П               // лих-их
    и, кф               // лих-и
  .число
    е, ср|затрудн       // лиш-е
    о, нр               // лих-о
}

.тип п 3a_isol
//--------------------------------------------------------------------------
// Пример: маленький
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    енький, И
    енького, Р
    енькому, Д
    енький, Вн
    енького, Во
    еньким, Т
    еньком, П
    '', кф
  .род ж
    енькая, И
    енькой, Р
    енькой, Д
    енькую, В
    енькой, Т
    енькою, Т
    енькой, П
    а, кф
  .род с
    енькое, И
    енького, Р
    енькому, Д
    енькое, В
    еньким, Т
    еньком, П
    о, кф
  .род
  .число М
    енькие, И
    еньких, Р
    еньким, Д
    енькие, Вн
    еньких, Во
    енькими, Т
    еньких, П
    ы, кф
  .число
    е, ср
    о, нр
}

