//************************ Тип словоизменения 5 ****************************

.тип п 5a
//--------------------------------------------------------------------------
// Пример: розоволицый
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // розоволиц-ый
    его, Р              // розоволиц-его
    ему, Д              // розоволиц-ему
    ый, Вн              // розоволиц-ый
    его, Во             // розоволиц-его
    ым, Т               // розоволиц-ым
    ем, П               // о розоволиц-ем
    '', кф              // розоволиц
  .род ж
    ая, И               // розоволиц-ая
    ей, Р               // розоволиц-ей
    ей, Д               // розоволиц-ей
    ую, В               // розоволиц-ую
    ей, Т               // розоволиц-ей
    ею, Т               // розоволиц-ею
    ей, П               // о розоволиц-ей
    а, кф               // розоволиц-а
  .род с
    ее, И               // розоволиц-ее
    его, Р              // розоволиц-его
    ему, Д              // розоволиц-ему
    ее, В               // розоволиц-ее
    ым, Т               // розоволиц-ым
    ем, П               // о розоволиц-ем
    е, кф               // розоволиц-е
  .род
  .число М
    ые, И               // розоволиц-ые
    ых, Р               // розоволиц-ых
    ым, Д               // розоволиц-ым
    ые, Вн              // розоволиц-ые
    ых, Во              // розоволиц-ых
    ыми, Т              // розоволиц-ыми
    ых, П               // о розоволиц-ых
    ы, кф               // розоволиц-ы
  .число
    е, нр               // розоволиц-е
}

