//************************ Тип словоизменения 6 ****************************

.тип п 6a
//--------------------------------------------------------------------------
// Пример: кривошеий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // кривоше-ий
    его, Р              // кривоше-его
    ему, Д              // кривоше-ему
    ий, Вн              // кривоше-ий
    его, Во             // кривоше-его
    им, Т               // кривоше-им
    ем, П               // о кривоше-ем
  .род ж
    яя, И               // кривоше-яя
    ей, Р               // кривоше-ей
    ей, Д               // кривоше-ей
    юю, В               // кривоше-юю
    ей, Т               // кривоше-ей
    ею, Т               // кривоше-ею
    ей, П               // о кривоше-ей
  .род с
    ее, И               // кривоше-ее
    его, Р              // кривоше-его
    ему, Д              // кривоше-ему
    ее, В               // кривоше-ее
    им, Т               // кривоше-им
    ем, П               // о кривоше-ем
  .род
  .число М
    ие, И               // кривоше-ие
    их, Р               // кривоше-их
    им, Д               // кривоше-им
    ие, Вн              // кривоше-ие
    их, Во              // кривоше-их
    ими, Т              // кривоше-ими
    их, П               // о кривоше-их
}

