
.тип п 1a, п 1*a, п 1a/b, п 1*a/b, п 1*a/c, п 1*a/c', п 1*a/c'', п 1a', п 1a/c, п 1a/c', п 1a/c'', п 1*a_кфм_отл, п 1*a/b_кфм_отл
//--------------------------------------------------------------------------
// Пример: кровавый, масштабный, умный, сдобный, кислый, длинный, здоровый,
//   сизый, слабый, старый
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И
    ого, Р
    ому, Д
    ый, Вн
    ого, Во
    ым, Т
    ом, П
    '', кф
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
    а, кф
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    ым, Т
    ом, П
    о, кф
  .род
  .число М
    ые, И
    ых, Р
    ым, Д
    ые, Вн
    ых, Во
    ыми, Т
    ых, П
    ы, кф
.число
    ее, ср
    ей, ср
    о, нр
}

.тип п 1a!
//--------------------------------------------------------------------------
// Пример: непробиваемый
// Отсутствуют краткие формы
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И
    ого, Р
    ому, Д
    ый, Вн
    ого, Во
    ым, Т
    ом, П
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    ым, Т
    ом, П
  .род
  .число М
    ые, И
    ых, Р
    ым, Д
    ые, Вн
    ых, Во
    ыми, Т
    ых, П
.число
    ее, ср
    ей, ср
    о, нр
}

.тип п 1a~, п 1*a~
//--------------------------------------------------------------------------
// Пример:
// Отсутствует наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И
    ого, Р
    ому, Д
    ый, Вн
    ого, Во
    ым, Т
    ом, П
    '', кф
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
    а, кф
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    ым, Т
    ом, П
    о, кф
  .род
  .число М
    ые, И
    ых, Р
    ым, Д
    ые, Вн
    ых, Во
    ыми, Т
    ых, П
    ы, кф
.число
    ее, ср
    ей, ср
    о, соед
}

.тип п 1*a#
//--------------------------------------------------------------------------
// Пример: западный
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И
    ого, Р
    ому, Д
    ый, Вн
    ого, Во
    ым, Т
    ом, П
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    ым, Т
    ом, П
  .род
  .число М
    ые, И
    ых, Р
    ым, Д
    ые, Вн
    ых, Во
    ыми, Т
    ых, П
.число
    ее, ср
    ей, ср
    о, соед
}

.тип п 1*a/c-, п 1*a/c'-, п 1a/c-
//--------------------------------------------------------------------------
// Пример: предлинный
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И
    ого, Р
    ому, Д
    ый, Вн
    ого, Во
    ым, Т
    ом, П
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    ым, Т
    ом, П
  .род
  .число М
    ые, И
    ых, Р
    ым, Д
    ые, Вн
    ых, Во
    ыми, Т
    ых, П
  .число
    о, соед
}

.тип п 1a/c!&
//--------------------------------------------------------------------------
// Пример: неправый
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И
    ого, Р
    ому, Д
    ый, Вн
    ого, Во
    ым, Т
    ом, П
    '', кф
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
    а, кф
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    ым, Т
    ом, П
    о, кф
  .род
  .число М
    ые, И
    ых, Р
    ым, Д
    ые, Вн
    ых, Во
    ыми, Т
    ых, П
    ы, кф
  .число
    о, соед
}

.тип п 1*a/c!
//--------------------------------------------------------------------------
// Пример: главный
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И
    ого, Р
    ому, Д
    ый, Вн
    ого, Во
    ым, Т
    ом, П
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    ым, Т
    ом, П
  .род
  .число М
    ые, И
    ых, Р
    ым, Д
    ые, Вн
    ых, Во
    ыми, Т
    ых, П
  .число
    ее, ср
    о, соед
}

.тип п 1a/b&_кф_зтр
//--------------------------------------------------------------------------
// Пример: полутяжелый
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И
    ого, Р
    ому, Д
    ый, Вн
    ого, Во
    ым, Т
    ом, П
    '', кф|затрудн
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
    а, кф|затрудн
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    ым, Т
    ом, П
    о, кф|затрудн
  .род
  .число М
    ые, И
    ых, Р
    ым, Д
    ые, Вн
    ых, Во
    ыми, Т
    ых, П
    ы, кф|затрудн
  .число
    о, соед
}

.тип п 1a_кфм_нет_кфж_зтр
//--------------------------------------------------------------------------
// Пример: взрослый
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И
    ого, Р
    ому, Д
    ый, Вн
    ого, Во
    ым, Т
    ом, П
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
    а, кф|затрудн
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    ым, Т
    ом, П
    о, кф
  .род
  .число М
    ые, И
    ых, Р
    ым, Д
    ые, Вн
    ых, Во
    ыми, Т
    ых, П
    ы, кф
.число
    ее, ср
    ей, ср
    о, нр
}

.тип п 1a/bE1, п 1aE1
//--------------------------------------------------------------------------
// Пример: малый, богатый
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И
    ого, Р
    ому, Д
    ый, Вн
    ого, Во
    ым, Т
    ом, П
    '', кф
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
    а, кф
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    ым, Т
    ом, П
    о, кф
  .род
  .число М
    ые, И
    ых, Р
    ым, Д
    ые, Вн
    ых, Во
    ыми, Т
    ых, П
    ы, кф
.число
    е, ср
    о, нр
}

.тип п 1*a_кфм-
//--------------------------------------------------------------------------
// Пример: мирный, бурный
// Нет кф. м.
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И
    ого, Р
    ому, Д
    ый, Вн
    ого, Во
    ым, Т
    ом, П
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
    а, кф
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    ым, Т
    ом, П
    о, кф
  .род
  .число М
    ые, И
    ых, Р
    ым, Д
    ые, Вн
    ых, Во
    ыми, Т
    ых, П
    ы, кф
.число
    ее, ср
    о, нр
}

.тип п 1a#10
//--------------------------------------------------------------------------
// Пример: усталый, жеваный
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И
    ого, Р
    ому, Д
    ый, Вн
    ого, Во
    ым, Т
    ом, П
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    ым, Т
    ом, П
  .род
  .число М
    ые, И
    ых, Р
    ым, Д
    ые, Вн
    ых, Во
    ыми, Т
    ых, П
.число
    о, нр
}

.тип п 1a#10~
//--------------------------------------------------------------------------
// Пример: невозмужалый
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И
    ого, Р
    ому, Д
    ый, Вн
    ого, Во
    ым, Т
    ом, П
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    ым, Т
    ом, П
  .род
  .число М
    ые, И
    ых, Р
    ым, Д
    ые, Вн
    ых, Во
    ыми, Т
    ых, П
  .число
    о, соед
}

.тип п 1a#7
//--------------------------------------------------------------------------
// Пример: жеваный
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И
    ого, Р
    ому, Д
    ый, Вн
    ого, Во
    ым, Т
    ом, П
  .род ж
    ая, И
    ой, Р
    ой, Д
    ую, В
    ой, Т
    ою, Т
    ой, П
  .род с
    ое, И
    ого, Р
    ому, Д
    ое, В
    ым, Т
    ом, П
  .род
  .число М
    ые, И
    ых, Р
    ым, Д
    ые, Вн
    ых, Во
    ыми, Т
    ых, П
  .число
    о, соед
}

.тип п 1*a-, п 1a-
//--------------------------------------------------------------------------
// Пример: тележный, трегубый
// Отсутствует сравнительная степень, краткие формы и наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // тележн-ый
    ого, Р              // тележн-ого
    ому, Д              // тележн-ому
    ый, Вн              // тележн-ый
    ого, Во             // тележн-ого
    ым, Т               // тележн-ым
    ом, П               // тележн-ом
  .род ж
    ая, И               // тележн-ая
    ой, Р               // тележн-ой
    ой, Д               // тележн-ой
    ую, В               // тележн-ую
    ой, Т               // тележн-ой
    ою, Т               // тележн-ою
    ой, П               // тележн-ой
  .род с
    ое, И               // тележн-ое
    ого, Р              // тележн-ого
    ому, Д              // тележн-ому
    ое, В               // тележн-ое
    ым, Т               // тележн-ым
    ом, П               // тележн-ом
  .род
  .число М
    ые, И               // тележн-ые
    ых, Р               // тележн-ых
    ым, Д               // тележн-ым
    ые, Вн              // тележн-ые
    ых, Во              // тележн-ых
    ыми, Т              // тележн-ыми
    ых, П               // тележн-ых
  .число
    о, соед
}

.тип п 1a:f-, п 1*a"1":f-, п 1*a:f-
//--------------------------------------------------------------------------
// Пример: жавелевый (жавелевая вода)
// Присутствуют только формы женского рода
//--------------------------------------------------------------------------
{
  .число Е
  .род ж
    ая, И               // жавелев-ая
    ой, Р               // жавелев-ой
    ой, Д               // жавелев-ой
    ую, Вн              // жавелев-ую
    ой, Т               // жавелев-ой
    ою, Т               // жавелев-ою
    ой, П               // жавелев-ой
  .род
  .число
    о, соед
}

.тип п 1a:fp-
//--------------------------------------------------------------------------
// Пример: ставленый (ставленая грамота)
//--------------------------------------------------------------------------
{
  .число Е
  .род ж
    ая, И               // ставлен-ая
    ой, Р               // ставлен-ой
    ой, Д               // ставлен-ой
    ую, В               // ставлен-ую
    ой, Т               // ставлен-ой
    ою, Т               // ставлен-ою
    ой, П               // ставлен-ой
  .род
  .число М
    ые, И               // ставлен-ые
    ых, Р               // ставлен-ых
    ым, Д               // ставлен-ым
    ые, Вн              // ставлен-ые
    ых, Во              // ставлен-ых
    ыми, Т              // ставлен-ыми
    ых, П               // ставлен-ых
  .число
    о, соед
}

.тип п 1*a:m-, п 1a:m-
//--------------------------------------------------------------------------
// Пример: дательный, падевый
// Отсутствует сравнительная степень, краткие формы и наречие. Тольно м. р.
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // дательн-ый
    ого, Р              // дательн-ого
    ому, Д              // дательн-ому
    ый, Вн              // дательн-ый
    ым, Т               // дательн-ым
    ом, П               // дательн-ом
  .род
  .число
    о, соед
}

.тип п 1*a:mp-, п 1a:mp-, п 1*a"1":&mp-
//--------------------------------------------------------------------------
// Пример: високосный, постоялый
// Отсутствует ср. ст., кф и наречие. Тольно м. р. и мн.
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // високосн-ый
    ого, Р              // високосн-ого
    ому, Д              // високосн-ому
    ый, Вн              // високосн-ый
    ым, Т               // високосн-ым
    ом, П               // високосн-ом
  .род
  .число М
    ые, И               // високосн-ые
    ых, Р               // високосн-ых
    ым, Д               // високосн-ым
    ые, Вн              // високосн-ые
    ыми, Т              // високосн-ыми
    ых, П               // високосн-ых
  .число
    о, соед
}

.тип п 1*a:n-
//--------------------------------------------------------------------------
// Пример: разливанный (море разливанное)
// Присутствуют только полные формы с. р.
//--------------------------------------------------------------------------
{
  .число Е
  .род с
    ое, И               // разливан-ое
    ого, Р              // разливан-ого
    ому, Д              // разливан-ому
    ое, В               // разливан-ое
    ым, Т               // разливан-ым
    ом, П               // разливан-ом
  .род
  .число
    о, соед
}

.тип п 1a:n1
//--------------------------------------------------------------------------
// Пример: вестимый (вестимое дело)
//--------------------------------------------------------------------------
{
  .число Е
  .род с
    ое, И               // разливан-ое
    о, кф
}

.тип п 1*a"1"
//--------------------------------------------------------------------------
// Пример: самоуверенный
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // самоуверен-ный
    ного, Р             // самоуверен-ного
    ному, Д             // самоуверен-ному
    ный, Вн             // самоуверен-ный
    ного, Во            // самоуверен-ного
    ным, Т              // самоуверен-ным
    ном, П              // самоуверен-ном
    '', кф              // самоуверен
  .род ж
    ная, И              // самоуверен-ная
    ной, Р              // самоуверен-ной
    ной, Д              // самоуверен-ной
    ную, В              // самоуверен-ную
    ной, Т              // самоуверен-ной
    ною, Т              // самоуверен-ною
    ной, П              // самоуверен-ной
    на, кф              // самоуверен-на
  .род с
    ное, И              // самоуверен-ное
    ного, Р             // самоуверен-ного
    ному, Д             // самоуверен-ному
    ное, В              // самоуверен-ное
    ным, Т              // самоуверен-ным
    ном, П              // самоуверен-ном
    но, кф              // самоуверен-но
  .род
  .число М
    ные, И              // самоуверен-ные
    ных, Р              // самоуверен-ных
    ным, Д              // самоуверен-ным
    ные, Вн             // самоуверен-ные
    ных, Во             // самоуверен-ных
    ными, Т             // самоуверен-ными
    ных, П              // самоуверен-ных
    ны, кф              // самоуверен-ны
.число
    нее, ср             // самоуверен-нее
    ней, ср             // самоуверен-ней
    но, нр              // самоуверен-но
}

.тип п 1*a"1"_кфм_зтр
//--------------------------------------------------------------------------
// Пример: особенный
// кф. м. затруднена
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // особен-ный
    ного, Р             // особен-ного
    ному, Д             // особен-ному
    ный, Вн             // особен-ный
    ного, Во            // особен-ного
    ным, Т              // особен-ным
    ном, П              // особен-ном
    '', кф|затрудн      // особен
  .род ж
    ная, И              // особен-ная
    ной, Р              // особен-ной
    ной, Д              // особен-ной
    ную, В              // особен-ную
    ной, Т              // особен-ной
    ною, Т              // особен-ною
    ной, П              // особен-ной
    на, кф              // особен-на
  .род с
    ное, И              // особен-ное
    ного, Р             // особен-ного
    ному, Д             // особен-ному
    ное, В              // особен-ное
    ным, Т              // особен-ным
    ном, П              // особен-ном
    но, кф              // особен-но
  .род
  .число М
    ные, И              // особен-ные
    ных, Р              // особен-ных
    ным, Д              // особен-ным
    ные, Вн             // особен-ные
    ных, Во             // особен-ных
    ными, Т             // особен-ными
    ных, П              // особен-ных
    ны, кф              // особен-ны
.число
    нее, ср             // особен-нее
    ней, ср             // особен-ней
    но, нр              // особен-но
}

.тип п 1*a["1"]
//--------------------------------------------------------------------------
// Пример: медленный
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // медлен-ный
    ного, Р             // медлен-ного
    ному, Д             // медлен-ному
    ный, Вн             // медлен-ный
    ного, Во            // медлен-ного
    ным, Т              // медлен-ным
    ном, П              // медлен-ном
    '', кф              // медлен
    ен, кф              // медлен-ен
  .род ж
    ная, И              // медлен-ная
    ной, Р              // медлен-ной
    ной, Д              // медлен-ной
    ную, В              // медлен-ную
    ной, Т              // медлен-ной
    ною, Т              // медлен-ною
    ной, П              // медлен-ной
    на, кф              // медлен-на
  .род с
    ное, И              // медлен-ное
    ного, Р             // медлен-ного
    ному, Д             // медлен-ному
    ное, В              // медлен-ное
    ным, Т              // медлен-ным
    ном, П              // медлен-ном
    но, кф              // медлен-но
  .род
  .число М
    ные, И              // медлен-ные
    ных, Р              // медлен-ных
    ным, Д              // медлен-ным
    ные, Вн             // медлен-ные
    ных, Во             // медлен-ных
    ными, Т             // медлен-ными
    ных, П              // медлен-ных
    ны, кф              // медлен-ны
.число
    нее, ср             // медлен-нее
    ней, ср             // медлен-ней
    но, нр              // медлен-но
}

.тип п 1*a["1"]!&
//--------------------------------------------------------------------------
// Пример: межведомственный
// Отсутствует сравнительная степень и краткие формы
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // медлен-ный
    ного, Р             // медлен-ного
    ному, Д             // медлен-ному
    ный, Вн             // медлен-ный
    ного, Во            // медлен-ного
    ным, Т              // медлен-ным
    ном, П              // медлен-ном
  .род ж
    ная, И              // медлен-ная
    ной, Р              // медлен-ной
    ной, Д              // медлен-ной
    ную, В              // медлен-ную
    ной, Т              // медлен-ной
    ною, Т              // медлен-ною
    ной, П              // медлен-ной
  .род с
    ное, И              // медлен-ное
    ного, Р             // медлен-ного
    ному, Д             // медлен-ному
    ное, В              // медлен-ное
    ным, Т              // медлен-ным
    ном, П              // медлен-ном
  .род
  .число М
    ные, И              // медлен-ные
    ных, Р              // медлен-ных
    ным, Д              // медлен-ным
    ные, Вн             // медлен-ные
    ных, Во             // медлен-ных
    ными, Т             // медлен-ными
    ных, П              // медлен-ных
.число
    но, нр              // медлен-но
}

.тип п 1*a["1"]&
//--------------------------------------------------------------------------
// Пример: лекарственный
// Отсутствует сравнительная степень
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // медлен-ный
    ного, Р             // медлен-ного
    ному, Д             // медлен-ному
    ный, Вн             // медлен-ный
    ного, Во            // медлен-ного
    ным, Т              // медлен-ным
    ном, П              // медлен-ном
    '', кф              // медлен
    ен, кф              // медлен-ен
  .род ж
    ная, И              // медлен-ная
    ной, Р              // медлен-ной
    ной, Д              // медлен-ной
    ную, В              // медлен-ную
    ной, Т              // медлен-ной
    ною, Т              // медлен-ною
    ной, П              // медлен-ной
    на, кф              // медлен-на
  .род с
    ное, И              // медлен-ное
    ного, Р             // медлен-ного
    ному, Д             // медлен-ному
    ное, В              // медлен-ное
    ным, Т              // медлен-ным
    ном, П              // медлен-ном
    но, кф              // медлен-но
  .род
  .число М
    ные, И              // медлен-ные
    ных, Р              // медлен-ных
    ным, Д              // медлен-ным
    ные, Вн             // медлен-ные
    ных, Во             // медлен-ных
    ными, Т             // медлен-ными
    ных, П              // медлен-ных
    ны, кф              // медлен-ны
.число
    но, нр              // медлен-но
}

.тип п 1*a["1"]-
//--------------------------------------------------------------------------
// Пример: лиственный
// Отсутствует сравнительная степень, краткие формы и наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // медлен-ный
    ного, Р             // медлен-ного
    ному, Д             // медлен-ному
    ный, Вн             // медлен-ный
    ного, Во            // медлен-ного
    ным, Т              // медлен-ным
    ном, П              // медлен-ном
  .род ж
    ная, И              // медлен-ная
    ной, Р              // медлен-ной
    ной, Д              // медлен-ной
    ную, В              // медлен-ную
    ной, Т              // медлен-ной
    ною, Т              // медлен-ною
    ной, П              // медлен-ной
  .род с
    ное, И              // медлен-ное
    ного, Р             // медлен-ного
    ному, Д             // медлен-ному
    ное, В              // медлен-ное
    ным, Т              // медлен-ным
    ном, П              // медлен-ном
  .род
  .число М
    ные, И              // медлен-ные
    ных, Р              // медлен-ных
    ным, Д              // медлен-ным
    ные, Вн             // медлен-ные
    ных, Во             // медлен-ных
    ными, Т             // медлен-ными
    ных, П              // медлен-ных
.число
    но, соед
}

.тип п 1*a"1"!
//--------------------------------------------------------------------------
// Пример: самоуверенный
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // самоуверен-ный
    ного, Р             // самоуверен-ного
    ному, Д             // самоуверен-ному
    ный, Вн             // самоуверен-ный
    ного, Во            // самоуверен-ного
    ным, Т              // самоуверен-ным
    ном, П              // самоуверен-ном
  .род ж
    ная, И              // самоуверен-ная
    ной, Р              // самоуверен-ной
    ной, Д              // самоуверен-ной
    ную, В              // самоуверен-ную
    ной, Т              // самоуверен-ной
    ною, Т              // самоуверен-ною
    ной, П              // самоуверен-ной
  .род с
    ное, И              // самоуверен-ное
    ного, Р             // самоуверен-ного
    ному, Д             // самоуверен-ному
    ное, В              // самоуверен-ное
    ным, Т              // самоуверен-ным
    ном, П              // самоуверен-ном
  .род
  .число М
    ные, И              // самоуверен-ные
    ных, Р              // самоуверен-ных
    ным, Д              // самоуверен-ным
    ные, Вн             // самоуверен-ные
    ных, Во             // самоуверен-ных
    ными, Т             // самоуверен-ными
    ных, П              // самоуверен-ных
.число
    нее, ср             // самоуверен-нее
    ней, ср             // самоуверен-ней
    но, нр              // самоуверен-но
}

.тип п 1*a"1"!&
//--------------------------------------------------------------------------
// Пример: надеванный
// Отсутствуют краткие формы и сравнительная степень
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // надеван-ный
    ного, Р             // надеван-ного
    ному, Д             // надеван-ному
    ный, Вн             // надеван-ный
    ного, Во            // надеван-ного
    ным, Т              // надеван-ным
    ном, П              // надеван-ном
  .род ж
    ная, И              // надеван-ная
    ной, Р              // надеван-ной
    ной, Д              // надеван-ной
    ную, В              // надеван-ную
    ной, Т              // надеван-ной
    ною, Т              // надеван-ною
    ной, П              // надеван-ной
  .род с
    ное, И              // надеван-ное
    ного, Р             // надеван-ного
    ному, Д             // надеван-ному
    ное, В              // надеван-ное
    ным, Т              // надеван-ным
    ном, П              // надеван-ном
  .род
  .число М
    ные, И              // надеван-ные
    ных, Р              // надеван-ных
    ным, Д              // надеван-ным
    ные, Вн             // надеван-ные
    ных, Во             // надеван-ных
    ными, Т             // надеван-ными
    ных, П              // надеван-ных
  .число
    но, нр              // медлен-но
}

.тип п 1*a"1"&
//--------------------------------------------------------------------------
// Пример: надеванный
// Отсутствуют сравнительная степень
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // надеван-ный
    ного, Р             // надеван-ного
    ному, Д             // надеван-ному
    ный, Вн             // надеван-ный
    ного, Во            // надеван-ного
    ным, Т              // надеван-ным
    ном, П              // надеван-ном
    '', кф              // надеван
  .род ж
    ная, И              // надеван-ная
    ной, Р              // надеван-ной
    ной, Д              // надеван-ной
    ную, В              // надеван-ную
    ной, Т              // надеван-ной
    ною, Т              // надеван-ною
    ной, П              // надеван-ной
    на, кф              // надеван-на
  .род с
    ное, И              // надеван-ное
    ного, Р             // надеван-ного
    ному, Д             // надеван-ному
    ное, В              // надеван-ное
    ным, Т              // надеван-ным
    ном, П              // надеван-ном
    но, кф              // надеван-но
  .род
  .число М
    ные, И              // надеван-ные
    ных, Р              // надеван-ных
    ным, Д              // надеван-ным
    ные, Вн             // надеван-ные
    ных, Во             // надеван-ных
    ными, Т             // надеван-ными
    ных, П              // надеван-ных
    ны, кф              // надеван-ны
  .число
    но, нр              // медлен-но
}

.тип п 1*a"1"&~
//--------------------------------------------------------------------------
// Пример: надеванный
// Отсутствуют сравнительная степень и наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // надеван-ный
    ного, Р             // надеван-ного
    ному, Д             // надеван-ному
    ный, Вн             // надеван-ный
    ного, Во            // надеван-ного
    ным, Т              // надеван-ным
    ном, П              // надеван-ном
    '', кф              // надеван
  .род ж
    ная, И              // надеван-ная
    ной, Р              // надеван-ной
    ной, Д              // надеван-ной
    ную, В              // надеван-ную
    ной, Т              // надеван-ной
    ною, Т              // надеван-ною
    ной, П              // надеван-ной
    на, кф              // надеван-на
  .род с
    ное, И              // надеван-ное
    ного, Р             // надеван-ного
    ному, Д             // надеван-ному
    ное, В              // надеван-ное
    ным, Т              // надеван-ным
    ном, П              // надеван-ном
    но, кф              // надеван-но
  .род
  .число М
    ные, И              // надеван-ные
    ных, Р              // надеван-ных
    ным, Д              // надеван-ным
    ные, Вн             // надеван-ные
    ных, Во             // надеван-ных
    ными, Т             // надеван-ными
    ных, П              // надеван-ных
    ны, кф              // надеван-ны
  .число
    но, соед
}

.тип п 1*a"1"-
//--------------------------------------------------------------------------
// Пример: язвенный
// Отсутствуют краткие формы, сравнительная степень и наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // язвен-ный
    ного, Р             // язвен-ного
    ному, Д             // язвен-ному
    ный, Вн             // язвен-ный
    ного, Во            // язвен-ного
    ным, Т              // язвен-ным
    ном, П              // язвен-ном
  .род ж
    ная, И              // язвен-ная
    ной, Р              // язвен-ной
    ной, Д              // язвен-ной
    ную, В              // язвен-ную
    ной, Т              // язвен-ной
    ною, Т              // язвен-ною
    ной, П              // язвен-ной
  .род с
    ное, И              // язвен-ное
    ного, Р             // язвен-ного
    ному, Д             // язвен-ному
    ное, В              // язвен-ное
    ным, Т              // язвен-ным
    ном, П              // язвен-ном
  .род
  .число М
    ные, И              // язвен-ные
    ных, Р              // язвен-ных
    ным, Д              // язвен-ным
    ные, Вн             // язвен-ные
    ных, Во             // язвен-ных
    ными, Т             // язвен-ными
    ных, П              // язвен-ных
  .число
    но, соед
}

.тип п 1*a"2"
//--------------------------------------------------------------------------
// Пример: ухоженный
// Сейчас кф., ср. ст. и наречие разрешены для всех, но надо смотреть...
// ?????????????????????????????????????????????????????????????????????????
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // ухожен-ный
    ного, Р             // ухожен-ного
    ному, Д             // ухожен-ному
    ный, Вн             // ухожен-ный
    ного, Во            // ухожен-ного
    ным, Т              // ухожен-ным
    ном, П              // ухожен-ном
    '', кф              // ухожен
  .род ж
    ная, И              // ухожен-ная
    ной, Р              // ухожен-ной
    ной, Д              // ухожен-ной
    ную, В              // ухожен-ную
    ной, Т              // ухожен-ной
    ною, Т              // ухожен-ною
    ной, П              // ухожен-ной
    а, кф               // ухожен-а
  .род с
    ное, И              // ухожен-ное
    ного, Р             // ухожен-ного
    ному, Д             // ухожен-ному
    ное, В              // ухожен-ное
    ным, Т              // ухожен-ным
    ном, П              // ухожен-ном
    о, кф               // ухожен-о
  .род
  .число М
    ные, И              // ухожен-ные
    ных, Р              // ухожен-ных
    ным, Д              // ухожен-ным
    ные, Вн             // ухожен-ные
    ных, Во             // ухожен-ных
    ными, Т             // ухожен-ными
    ных, П              // ухожен-ных
    ы, кф               // ухожен-ы
.число
    нее, ср             // ухожен-нее
    ней, ср             // ухожен-ней
    но, нр
}

.тип п 1*a"2"&
//--------------------------------------------------------------------------
// Пример: ухоженный
// Отсутствует сравнительная степень
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // ухожен-ный
    ного, Р             // ухожен-ного
    ному, Д             // ухожен-ному
    ный, Вн             // ухожен-ный
    ного, Во            // ухожен-ного
    ным, Т              // ухожен-ным
    ном, П              // ухожен-ном
    '', кф              // ухожен
  .род ж
    ная, И              // ухожен-ная
    ной, Р              // ухожен-ной
    ной, Д              // ухожен-ной
    ную, В              // ухожен-ную
    ной, Т              // ухожен-ной
    ною, Т              // ухожен-ною
    ной, П              // ухожен-ной
    а, кф               // ухожен-а
  .род с
    ное, И              // ухожен-ное
    ного, Р             // ухожен-ного
    ному, Д             // ухожен-ному
    ное, В              // ухожен-ное
    ным, Т              // ухожен-ным
    ном, П              // ухожен-ном
    о, кф               // ухожен-о
  .род
  .число М
    ные, И              // ухожен-ные
    ных, Р              // ухожен-ных
    ным, Д              // ухожен-ным
    ные, Вн             // ухожен-ные
    ных, Во             // ухожен-ных
    ными, Т             // ухожен-ными
    ных, П              // ухожен-ных
    ы, кф               // ухожен-ы
.число
    но, нр
}

.тип п 1*a"2"~
//--------------------------------------------------------------------------
// Пример:
// Отсутствует наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // ухожен-ный
    ного, Р             // ухожен-ного
    ному, Д             // ухожен-ному
    ный, Вн             // ухожен-ный
    ного, Во            // ухожен-ного
    ным, Т              // ухожен-ным
    ном, П              // ухожен-ном
    '', кф              // ухожен
  .род ж
    ная, И              // ухожен-ная
    ной, Р              // ухожен-ной
    ной, Д              // ухожен-ной
    ную, В              // ухожен-ную
    ной, Т              // ухожен-ной
    ною, Т              // ухожен-ною
    ной, П              // ухожен-ной
    а, кф               // ухожен-а
  .род с
    ное, И              // ухожен-ное
    ного, Р             // ухожен-ного
    ному, Д             // ухожен-ному
    ное, В              // ухожен-ное
    ным, Т              // ухожен-ным
    ном, П              // ухожен-ном
    о, кф               // ухожен-о
  .род
  .число М
    ные, И              // ухожен-ные
    ных, Р              // ухожен-ных
    ным, Д              // ухожен-ным
    ные, Вн             // ухожен-ные
    ных, Во             // ухожен-ных
    ными, Т             // ухожен-ными
    ных, П              // ухожен-ных
    ы, кф               // ухожен-ы
.число
    ней, ср             // ухожен-ней
    нее, ср             // ухожен-нее
    но, соед
}

.тип п 1*a"2"!&
//--------------------------------------------------------------------------
// Пример: йодированный
// Отсутствуют краткие формы и сравнительная степень
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // йодирован-ный
    ного, Р             // йодирован-ного
    ному, Д             // йодирован-ному
    ный, Вн             // йодирован-ный
    ного, Во            // йодирован-ного
    ным, Т              // йодирован-ным
    ном, П              // йодирован-ном
  .род ж
    ная, И              // йодирован-ная
    ной, Р              // йодирован-ной
    ной, Д              // йодирован-ной
    ную, В              // йодирован-ную
    ной, Т              // йодирован-ной
    ною, Т              // йодирован-ною
    ной, П              // йодирован-ной
  .род с
    ное, И              // йодирован-ное
    ного, Р             // йодирован-ного
    ному, Д             // йодирован-ному
    ное, В              // йодирован-ное
    ным, Т              // йодирован-ным
    ном, П              // йодирован-ном
  .род
  .число М
    ные, И              // йодирован-ные
    ных, Р              // йодирован-ных
    ным, Д              // йодирован-ным
    ные, Вн             // йодирован-ные
    ных, Во             // йодирован-ных
    ными, Т             // йодирован-ными
    ных, П              // йодирован-ных
.число
    но, нр
}

.тип п 1*a"2"&~
//--------------------------------------------------------------------------
// Пример: ухоженный
// Отсутствует сравнительная степень и наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // ухожен-ный
    ного, Р             // ухожен-ного
    ному, Д             // ухожен-ному
    ный, Вн             // ухожен-ный
    ного, Во            // ухожен-ного
    ным, Т              // ухожен-ным
    ном, П              // ухожен-ном
    '', кф              // ухожен
  .род ж
    ная, И              // ухожен-ная
    ной, Р              // ухожен-ной
    ной, Д              // ухожен-ной
    ную, В              // ухожен-ную
    ной, Т              // ухожен-ной
    ною, Т              // ухожен-ною
    ной, П              // ухожен-ной
    а, кф               // ухожен-а
  .род с
    ное, И              // ухожен-ное
    ного, Р             // ухожен-ного
    ному, Д             // ухожен-ному
    ное, В              // ухожен-ное
    ным, Т              // ухожен-ным
    ном, П              // ухожен-ном
    о, кф               // ухожен-о
  .род
  .число М
    ные, И              // ухожен-ные
    ных, Р              // ухожен-ных
    ным, Д              // ухожен-ным
    ные, Вн             // ухожен-ные
    ных, Во             // ухожен-ных
    ными, Т             // ухожен-ными
    ных, П              // ухожен-ных
    ы, кф               // ухожен-ы
  .число
    о, соед
}

.тип п 1*a"2"-
//--------------------------------------------------------------------------
// Пример: горячекатанный
// Отсутствуют краткие формы, сравнительная степень и наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // йодирован-ный
    ного, Р             // йодирован-ного
    ному, Д             // йодирован-ному
    ный, Вн             // йодирован-ный
    ного, Во            // йодирован-ного
    ным, Т              // йодирован-ным
    ном, П              // йодирован-ном
  .род ж
    ная, И              // йодирован-ная
    ной, Р              // йодирован-ной
    ной, Д              // йодирован-ной
    ную, В              // йодирован-ную
    ной, Т              // йодирован-ной
    ною, Т              // йодирован-ною
    ной, П              // йодирован-ной
  .род с
    ное, И              // йодирован-ное
    ного, Р             // йодирован-ного
    ному, Д             // йодирован-ному
    ное, В              // йодирован-ное
    ным, Т              // йодирован-ным
    ном, П              // йодирован-ном
  .род
  .число М
    ные, И              // йодирован-ные
    ных, Р              // йодирован-ных
    ным, Д              // йодирован-ным
    ные, Вн             // йодирован-ные
    ных, Во             // йодирован-ных
    ными, Т             // йодирован-ными
    ных, П              // йодирован-ных
  .число
    о, соед
}

.тип п 1*a/b"2"
//--------------------------------------------------------------------------
// Пример: изможденный
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // изможден-ный
    ного, Р             // изможден-ного
    ному, Д             // изможден-ному
    ный, Вн             // изможден-ный
    ного, Во            // изможден-ного
    ным, Т              // изможден-ным
    ном, П              // изможден-ном
    '', кф
  .род ж
    ная, И              // изможден-ная
    ной, Р              // изможден-ной
    ной, Д              // изможден-ной
    ную, В              // изможден-ную
    ной, Т              // изможден-ной
    ною, Т              // изможден-ною
    ной, П              // изможден-ной
    а, кф
  .род с
    ное, И              // изможден-ное
    ного, Р             // изможден-ного
    ному, Д             // изможден-ному
    ное, В              // изможден-ное
    ным, Т              // изможден-ным
    ном, П              // изможден-ном
    о, кф
  .род
  .число М
    ные, И              // изможден-ные
    ных, Р              // изможден-ных
    ным, Д              // изможден-ным
    ные, Вн             // изможден-ные
    ных, Во             // изможден-ных
    ными, Т             // изможден-ными
    ных, П              // изможден-ных
    ы, кф
.число
    нее, ср             // изможден-нее
    ней, ср             // изможден-ней
    но, нр
}

.тип п 1*a/b"2"&
//--------------------------------------------------------------------------
// Пример: изможденный
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // изможден-ный
    ного, Р             // изможден-ного
    ному, Д             // изможден-ному
    ный, Вн             // изможден-ный
    ного, Во            // изможден-ного
    ным, Т              // изможден-ным
    ном, П              // изможден-ном
    '', кф
  .род ж
    ная, И              // изможден-ная
    ной, Р              // изможден-ной
    ной, Д              // изможден-ной
    ную, В              // изможден-ную
    ной, Т              // изможден-ной
    ною, Т              // изможден-ною
    ной, П              // изможден-ной
    а, кф
  .род с
    ное, И              // изможден-ное
    ного, Р             // изможден-ного
    ному, Д             // изможден-ному
    ное, В              // изможден-ное
    ным, Т              // изможден-ным
    ном, П              // изможден-ном
    о, кф
  .род
  .число М
    ные, И              // изможден-ные
    ных, Р              // изможден-ных
    ным, Д              // изможден-ным
    ные, Вн             // изможден-ные
    ных, Во             // изможден-ных
    ными, Т             // изможден-ными
    ных, П              // изможден-ных
    ы, кф
.число
    но, нр
}

.тип п 1*a/b"2"&~
//--------------------------------------------------------------------------
// Пример: полуобнаженный
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // полуобнажен-ный
    ного, Р             // полуобнажен-ного
    ному, Д             // полуобнажен-ному
    ный, Вн             // полуобнажен-ный
    ного, Во            // полуобнажен-ного
    ным, Т              // полуобнажен-ным
    ном, П              // полуобнажен-ном
    '', кф              // полуобнажен
  .род ж
    ная, И              // полуобнажен-ная
    ной, Р              // полуобнажен-ной
    ной, Д              // полуобнажен-ной
    ную, В              // полуобнажен-ную
    ной, Т              // полуобнажен-ной
    ною, Т              // полуобнажен-ною
    ной, П              // полуобнажен-ной
    а, кф               // полуобнажен-а
  .род с
    ное, И              // полуобнажен-ное
    ного, Р             // полуобнажен-ного
    ному, Д             // полуобнажен-ному
    ное, В              // полуобнажен-ное
    ным, Т              // полуобнажен-ным
    ном, П              // полуобнажен-ном
    о, кф               // полуобнажен-о
  .род
  .число М
    ные, И              // полуобнажен-ные
    ных, Р              // полуобнажен-ных
    ным, Д              // полуобнажен-ным
    ные, Вн             // полуобнажен-ные
    ных, Во             // полуобнажен-ных
    ными, Т             // полуобнажен-ными
    ных, П              // полуобнажен-ных
    ы, кф               // полуобнажен-ы
}

.тип п 1*a/b"2"-
//--------------------------------------------------------------------------
// Пример: лишенный
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // изможден-ный
    ного, Р             // изможден-ного
    ному, Д             // изможден-ному
    ный, Вн             // изможден-ный
    ного, Во            // изможден-ного
    ным, Т              // изможден-ным
    ном, П              // изможден-ном
  .род ж
    ная, И              // изможден-ная
    ной, Р              // изможден-ной
    ной, Д              // изможден-ной
    ную, В              // изможден-ную
    ной, Т              // изможден-ной
    ною, Т              // изможден-ною
    ной, П              // изможден-ной
  .род с
    ное, И              // изможден-ное
    ного, Р             // изможден-ного
    ному, Д             // изможден-ному
    ное, В              // изможден-ное
    ным, Т              // изможден-ным
    ном, П              // изможден-ном
  .род
  .число М
    ные, И              // изможден-ные
    ных, Р              // изможден-ных
    ным, Д              // изможден-ным
    ные, Вн             // изможден-ные
    ных, Во             // изможден-ных
    ными, Т             // изможден-ными
    ных, П              // изможден-ных
  .число
    но, соед
}

.тип п 1*a/b"2"~
//--------------------------------------------------------------------------
// Пример: изможденный
// Отсутствует наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ный, И              // изможден-ный
    ного, Р             // изможден-ного
    ному, Д             // изможден-ному
    ный, Вн             // изможден-ный
    ного, Во            // изможден-ного
    ным, Т              // изможден-ным
    ном, П              // изможден-ном
    '', кф
  .род ж
    ная, И              // изможден-ная
    ной, Р              // изможден-ной
    ной, Д              // изможден-ной
    ную, В              // изможден-ную
    ной, Т              // изможден-ной
    ною, Т              // изможден-ною
    ной, П              // изможден-ной
    а, кф
  .род с
    ное, И              // изможден-ное
    ного, Р             // изможден-ного
    ному, Д             // изможден-ному
    ное, В              // изможден-ное
    ным, Т              // изможден-ным
    ном, П              // изможден-ном
    о, кф
  .род
  .число М
    ные, И              // изможден-ные
    ных, Р              // изможден-ных
    ным, Д              // изможден-ным
    ные, Вн             // изможден-ные
    ных, Во             // изможден-ных
    ными, Т             // изможден-ными
    ных, П              // изможден-ных
    ы, кф
.число
    нее, ср             // изможден-нее
    ней, ср             // изможден-ней
    но, соед
}

.тип п 1a&~, п 1*a&~
//--------------------------------------------------------------------------
// Пример: шишкастый
// Отсутствует сравнительная степень и наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // шишкаст-ый
    ого, Р              // шишкаст-ого
    ому, Д              // шишкаст-ому
    ый, Вн              // шишкаст-ый
    ого, Во             // шишкаст-ого
    ым, Т               // шишкаст-ым
    ом, П               // шишкаст-ом
    '', кф              // шишкаст
  .род ж
    ая, И               // шишкаст-ая
    ой, Р               // шишкаст-ой
    ой, Д               // шишкаст-ой
    ую, В               // шишкаст-ую
    ой, Т               // шишкаст-ой
    ою, Т               // шишкаст-ою
    ой, П               // шишкаст-ой
    а, кф               // шишкаст-а
  .род с
    ое, И               // шишкаст-ое
    ого, Р              // шишкаст-ого
    ому, Д              // шишкаст-ому
    ое, В               // шишкаст-ое
    ым, Т               // шишкаст-ым
    ом, П               // шишкаст-ом
    о, кф               // шишкаст-о
  .род
  .число М
    ые, И               // шишкаст-ые
    ых, Р               // шишкаст-ых
    ым, Д               // шишкаст-ым
    ые, Вн              // шишкаст-ые
    ых, Во              // шишкаст-ых
    ыми, Т              // шишкаст-ыми
    ых, П               // шишкаст-ых
    ы, кф               // шишкаст-ы
  .число
    о, соед
}

.тип п 1*a&, п 1a&, п 1a'&, п 1a/c&, п 1*a/b&, п 1*a/c&, п 1*a/c'&, п 1*a/c'&E1, п 1*a/c''&, п 1a/c'&
//--------------------------------------------------------------------------
// Пример: неослабный, жеребый
// Отсутствует сравнительная степень
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // неослабн-ый
    ого, Р              // неослабн-ого
    ому, Д              // неослабн-ому
    ый, Вн              // неослабн-ый
    ого, Во             // неослабн-ого
    ым, Т               // неослабн-ым
    ом, П               // неослабн-ом
    '', кф              // лечебен
  .род ж
    ая, И               // неослабн-ая
    ой, Р               // неослабн-ой
    ой, Д               // неослабн-ой
    ую, В               // неослабн-ую
    ой, Т               // неослабн-ой
    ою, Т               // неослабн-ою
    ой, П               // неослабн-ой
    а, кф               // неослабн-а
  .род с
    ое, И               // неослабн-ое
    ого, Р              // неослабн-ого
    ому, Д              // неослабн-ому
    ое, В               // неослабн-ое
    ым, Т               // неослабн-ым
    ом, П               // неослабн-ом
    о, кф               // неослабн-о
  .род
  .число М
    ые, И               // неослабн-ые
    ых, Р               // неослабн-ых
    ым, Д               // неослабн-ым
    ые, Вн              // неослабн-ые
    ых, Во              // неослабн-ых
    ыми, Т              // неослабн-ыми
    ых, П               // неослабн-ых
    ы, кф               // неослабн-ы
.число
    о, нр               // неослабн-о
}

.тип п 1a/c&E1
//--------------------------------------------------------------------------
// Пример: несоленый
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    еный, И             // несол-еный
    еного, Р            // несол-еного
    еному, Д            // несол-еному
    еный, Вн            // несол-еный
    еного, Во           // несол-еного
    еным, Т             // несол-еным
    еном, П             // несол-еном
    он, кф              // несолон
  .род ж
    еная, И             // несол-еная
    еной, Р             // несол-еной
    еной, Д             // несол-еной
    еную, В             // несол-еную
    еной, Т             // несол-еной
    еною, Т             // несол-еною
    еной, П             // несол-еной
    она, кф             // несол-она
  .род с
    еное, И             // несол-еное
    еного, Р            // несол-еного
    еному, Д            // несол-еному
    еное, В             // несол-еное
    еным, Т             // несол-еным
    еном, П             // несол-еном
    оно, кф             // несол-оно
  .род
  .число М
    еные, И             // несол-еные
    еных, Р             // несол-еных
    еным, Д             // несол-еным
    еные, Вн            // несол-еные
    еных, Во            // несол-еных
    еными, Т            // несол-еными
    еных, П             // несол-еных
    оны, кф             // несол-оны
.число
    оно, нр             // несол-оно
}

.тип п 1a/c'E1, п 1a/cE2
//--------------------------------------------------------------------------
// Пример: толстый, частый
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // толст-ый
    ого, Р              // толст-ого
    ому, Д              // толст-ому
    ый, Вн              // толст-ый
    ого, Во             // толст-ого
    ым, Т               // толст-ым
    ом, П               // толст-ом
    '', кф              // лечебен
  .род ж
    ая, И               // толст-ая
    ой, Р               // толст-ой
    ой, Д               // толст-ой
    ую, В               // толст-ую
    ой, Т               // толст-ой
    ою, Т               // толст-ою
    ой, П               // толст-ой
    а, кф               // толст-а
  .род с
    ое, И               // толст-ое
    ого, Р              // толст-ого
    ому, Д              // толст-ому
    ое, В               // толст-ое
    ым, Т               // толст-ым
    ом, П               // толст-ом
    о, кф               // толст-о
  .род
  .число М
    ые, И               // толст-ые
    ых, Р               // толст-ых
    ым, Д               // толст-ым
    ые, Вн              // толст-ые
    ых, Во              // толст-ых
    ыми, Т              // толст-ыми
    ых, П               // толст-ых
    ы, кф               // толст-ы
.число
    е, ср               // толщ-е
    о, нр               // толст-о
}

.тип п 1a/c'E2
//--------------------------------------------------------------------------
// Пример: соленый
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    еный, И
    еного, Р
    еному, Д
    еный, Вн
    еного, Во
    еным, Т
    еном, П
    он, кф
  .род ж
    еная, И
    еной, Р
    еной, Д
    еную, В
    еной, Т
    еною, Т
    еной, П
    она, кф
  .род с
    еное, И
    еного, Р
    еному, Д
    еное, В
    еным, Т
    еном, П
    оно, кф
  .род
  .число М
    еные, И
    еных, Р
    еным, Д
    еные, Вн
    еных, Во
    еными, Т
    еных, П
    оны, кф
.число
    онее, ср
    оней, ср
    оно, нр
}

.тип п 1a&_пф_нет, п 1a/c&_пф_нет
//--------------------------------------------------------------------------
// Пример: горазд
// Отсутствуют полные формы
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    '', кф              // горазд
  .род ж
    а, кф               // горазд-а
  .род с
    о, кф               // горазд-о
  .род
  .число М
    ы, кф               // горазд-ы
}

.тип п 1*a&_кфж_зтр, п 1*a/c&_кфж_зтр, п 1*a'&_кфж_зтр, п 1a&_кфж_зтр, п 1a'&_кфж_зтр, п 1a/c&_кфж_зтр
//--------------------------------------------------------------------------
// Пример: ярко-красный
// Отсутствует сравнительная степень, затруднена форма кф. ж.
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // ярко-красн-ый
    ого, Р              // ярко-красн-ого
    ому, Д              // ярко-красн-ому
    ый, Вн              // ярко-красн-ый
    ого, Во             // ярко-красн-ого
    ым, Т               // ярко-красн-ым
    ом, П               // ярко-красн-ом
    '', кф              // лечебен
  .род ж
    ая, И               // ярко-красн-ая
    ой, Р               // ярко-красн-ой
    ой, Д               // ярко-красн-ой
    ую, В               // ярко-красн-ую
    ой, Т               // ярко-красн-ой
    ою, Т               // ярко-красн-ою
    ой, П               // ярко-красн-ой
    а, кф|затрудн       // ярко-красн-а
  .род с
    ое, И               // ярко-красн-ое
    ого, Р              // ярко-красн-ого
    ому, Д              // ярко-красн-ому
    ое, В               // ярко-красн-ое
    ым, Т               // ярко-красн-ым
    ом, П               // ярко-красн-ом
    о, кф               // ярко-красн-о
  .род
  .число М
    ые, И               // ярко-красн-ые
    ых, Р               // ярко-красн-ых
    ым, Д               // ярко-красн-ым
    ые, Вн              // ярко-красн-ые
    ых, Во              // ярко-красн-ых
    ыми, Т              // ярко-красн-ыми
    ых, П               // ярко-красн-ых
    ы, кф               // ярко-красн-ы
.число
    о, нр               // ярко-красн-о
}

.тип п 1a'_кфж_зтр
//--------------------------------------------------------------------------
// Пример: левый
// Затруднена форма кф. ж.
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // лев-ый
    ого, Р              // лев-ого
    ому, Д              // лев-ому
    ый, Вн              // лев-ый
    ого, Во             // лев-ого
    ым, Т               // лев-ым
    ом, П               // лев-ом
    '', кф              // лечебен
  .род ж
    ая, И               // лев-ая
    ой, Р               // лев-ой
    ой, Д               // лев-ой
    ую, В               // лев-ую
    ой, Т               // лев-ой
    ою, Т               // лев-ою
    ой, П               // лев-ой
    а, кф|затрудн       // лев-а
  .род с
    ое, И               // лев-ое
    ого, Р              // лев-ого
    ому, Д              // лев-ому
    ое, В               // лев-ое
    ым, Т               // лев-ым
    ом, П               // лев-ом
    о, кф               // лев-о
  .род
  .число М
    ые, И               // лев-ые
    ых, Р               // лев-ых
    ым, Д               // лев-ым
    ые, Вн              // лев-ые
    ых, Во              // лев-ых
    ыми, Т              // лев-ыми
    ых, П               // лев-ых
    ы, кф               // лев-ы
.число
    о, нр               // лев-о
    ее, ср              // лев-ее
    ей, ср              // лев-ей
}

.тип п 1*a'
//--------------------------------------------------------------------------
// Пример: плавный
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // плавн-ый
    ого, Р              // плавн-ого
    ому, Д              // плавн-ому
    ый, Вн              // плавн-ый
    ого, Во             // плавн-ого
    ым, Т               // плавн-ым
    ом, П               // плавн-ом
    '', кф              // лечебен
  .род ж
    ая, И               // плавн-ая
    ой, Р               // плавн-ой
    ой, Д               // плавн-ой
    ую, В               // плавн-ую
    ой, Т               // плавн-ой
    ою, Т               // плавн-ою
    ой, П               // плавн-ой
    а, кф               // плавн-а
  .род с
    ое, И               // плавн-ое
    ого, Р              // плавн-ого
    ому, Д              // плавн-ому
    ое, В               // плавн-ое
    ым, Т               // плавн-ым
    ом, П               // плавн-ом
    о, кф               // плавн-о
  .род
  .число М
    ые, И               // плавн-ые
    ых, Р               // плавн-ых
    ым, Д               // плавн-ым
    ые, Вн              // плавн-ые
    ых, Во              // плавн-ых
    ыми, Т              // плавн-ыми
    ых, П               // плавн-ых
    ы, кф               // плавн-ы
.число
    ее, ср              // плавн-ее
    о, нр               // плавн-о
}

.тип п 1*a'&
//--------------------------------------------------------------------------
// Пример: дробный
// Отсутствует сравнительная степень
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // дробн-ый
    ого, Р              // дробн-ого
    ому, Д              // дробн-ому
    ый, Вн              // дробн-ый
    ого, Во             // дробн-ого
    ым, Т               // дробн-ым
    ом, П               // дробн-ом
    '', кф              // лечебен
  .род ж
    ая, И               // дробн-ая
    ой, Р               // дробн-ой
    ой, Д               // дробн-ой
    ую, В               // дробн-ую
    ой, Т               // дробн-ой
    ою, Т               // дробн-ою
    ой, П               // дробн-ой
    а, кф               // дробн-а
  .род с
    ое, И               // дробн-ое
    ого, Р              // дробн-ого
    ому, Д              // дробн-ому
    ое, В               // дробн-ое
    ым, Т               // дробн-ым
    ом, П               // дробн-ом
    о, кф               // дробн-о
  .род
  .число М
    ые, И               // дробн-ые
    ых, Р               // дробн-ых
    ым, Д               // дробн-ым
    ые, Вн              // дробн-ые
    ых, Во              // дробн-ых
    ыми, Т              // дробн-ыми
    ых, П               // дробн-ых
    ы, кф               // дробн-ы
.число
    о, нр               // дробн-о
}

.тип п 1*a!
//--------------------------------------------------------------------------
// Пример: разгульный
// Отсутствуют краткие формы
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // разгульн-ый
    ого, Р              // разгульн-ого
    ому, Д              // разгульн-ому
    ый, Вн              // разгульн-ый
    ого, Во             // разгульн-ого
    ым, Т               // разгульн-ым
    ом, П               // разгульн-ом
  .род ж
    ая, И               // разгульн-ая
    ой, Р               // разгульн-ой
    ой, Д               // разгульн-ой
    ую, В               // разгульн-ую
    ой, Т               // разгульн-ой
    ою, Т               // разгульн-ою
    ой, П               // разгульн-ой
  .род с
    ое, И               // разгульн-ое
    ого, Р              // разгульн-ого
    ому, Д              // разгульн-ому
    ое, В               // разгульн-ое
    ым, Т               // разгульн-ым
    ом, П               // разгульн-ом
  .род
  .число М
    ые, И               // разгульн-ые
    ых, Р               // разгульн-ых
    ым, Д               // разгульн-ым
    ые, Вн              // разгульн-ые
    ых, Во              // разгульн-ых
    ыми, Т              // разгульн-ыми
    ых, П               // разгульн-ых
.число
    ее, ср              // разгульн-ее
    о, нр               // разгульн-о
}

.тип п 1*a'-
//--------------------------------------------------------------------------
// Пример: чинный
// Отсутствует сравнительная степень и кф.
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // чинн-ый
    ого, Р              // чинн-ого
    ому, Д              // чинн-ому
    ый, Вн              // чинн-ый
    ого, Во             // чинн-ого
    ым, Т               // чинн-ым
    ом, П               // чинн-ом
  .род ж
    ая, И               // чинн-ая
    ой, Р               // чинн-ой
    ой, Д               // чинн-ой
    ую, В               // чинн-ую
    ой, Т               // чинн-ой
    ою, Т               // чинн-ою
    ой, П               // чинн-ой
  .род с
    ое, И               // чинн-ое
    ого, Р              // чинн-ого
    ому, Д              // чинн-ому
    ое, В               // чинн-ое
    ым, Т               // чинн-ым
    ом, П               // чинн-ом
  .род
  .число М
    ые, И               // чинн-ые
    ых, Р               // чинн-ых
    ым, Д               // чинн-ым
    ые, Вн              // чинн-ые
    ых, Во              // чинн-ых
    ыми, Т              // чинн-ыми
    ых, П               // чинн-ых
.число
    о, нр               // чинн-о
}

.тип п 1*a!&, п 1a!&, п 1*a/c'!&
//--------------------------------------------------------------------------
// Пример: жалобный
// Отсутствует сравнительная степень и кф., но есть наречие
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // жалобн-ый
    ого, Р              // жалобн-ого
    ому, Д              // жалобн-ому
    ый, Вн              // жалобн-ый
    ого, Во             // жалобн-ого
    ым, Т               // жалобн-ым
    ом, П               // жалобн-ом
  .род ж
    ая, И               // жалобн-ая
    ой, Р               // жалобн-ой
    ой, Д               // жалобн-ой
    ую, В               // жалобн-ую
    ой, Т               // жалобн-ой
    ою, Т               // жалобн-ою
    ой, П               // жалобн-ой
  .род с
    ое, И               // жалобн-ое
    ого, Р              // жалобн-ого
    ому, Д              // жалобн-ому
    ое, В               // жалобн-ое
    ым, Т               // жалобн-ым
    ом, П               // жалобн-ом
  .род
  .число М
    ые, И               // жалобн-ые
    ых, Р               // жалобн-ых
    ым, Д               // жалобн-ым
    ые, Вн              // жалобн-ые
    ых, Во              // жалобн-ых
    ыми, Т              // жалобн-ыми
    ых, П               // жалобн-ых
.число
    о, нр               // жалобн-о
}

