.тип п 2*a
//--------------------------------------------------------------------------
// Пример: древний
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // древн-ий
    его, Р              // древн-его
    ему, Д              // древн-ему
    ий, Вн              // древн-ий
    его, Во             // древн-его
    им, Т               // древн-им
    ем, П               // древн-ем
    '', кф              // древен
  .род ж
    яя, И               // древн-яя
    ей, Р               // древн-ей
    ей, Д               // древн-ей
    юю, В               // древн-юю
    ей, Т               // древн-ей
    ею, Т               // древн-ею
    ей, П               // древн-ей
    я, кф               // древн-я
  .род с
    ее, И               // древн-ее
    его, Р              // древн-его
    ему, Д              // древн-ему
    ее, В               // древн-ее
    им, Т               // древн-им
    ем, П               // древн-ем
    е, кф               // древн-е
  .род
  .число М
    ие, И               // древн-ие
    их, Р               // древн-их
    им, Д               // древн-им
    ие, Вн              // древн-ие
    их, Во              // древн-их
    ими, Т              // древн-ими
    их, П               // древн-их
    и, кф               // древн-и
.число
    ее, ср              // древн-ее
    е, нр               // древн-е
}

.тип п 2*a"1"&
//--------------------------------------------------------------------------
// Пример: выспренний
// Отсутствует сравнительная степень
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // выспренн-ий
    его, Р              // выспренн-его
    ему, Д              // выспренн-ему
    ий, Вн              // выспренн-ий
    его, Во             // выспренн-его
    им, Т               // выспренн-им
    ем, П               // выспренн-ем
    '', кф              // выспрен
  .род ж
    яя, И               // выспренн-яя
    ей, Р               // выспренн-ей
    ей, Д               // выспренн-ей
    юю, В               // выспренн-юю
    ей, Т               // выспренн-ей
    ею, Т               // выспренн-ею
    ей, П               // выспренн-ей
    я, кф               // выспренн-я
  .род с
    ее, И               // выспренн-ее
    его, Р              // выспренн-его
    ему, Д              // выспренн-ему
    ее, В               // выспренн-ее
    им, Т               // выспренн-им
    ем, П               // выспренн-ем
    е, кф               // выспренн-е
  .род
  .число М
    ие, И               // выспренн-ие
    их, Р               // выспренн-их
    им, Д               // выспренн-им
    ие, Вн              // выспренн-ие
    их, Во              // выспренн-их
    ими, Т              // выспренн-ими
    их, П               // выспренн-их
    и, кф               // выспренн-и
  .число
    е, нр               // выспренн-е
}

.тип п 2*a"1"!&
//--------------------------------------------------------------------------
// Пример: превыспренний
// Отсутствуют краткие формы и сравнительная степень
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // превыспренн-ий
    его, Р              // превыспренн-его
    ему, Д              // превыспренн-ему
    ий, Вн              // превыспренн-ий
    его, Во             // превыспренн-его
    им, Т               // превыспренн-им
    ем, П               // превыспренн-ем
  .род ж
    яя, И               // превыспренн-яя
    ей, Р               // превыспренн-ей
    ей, Д               // превыспренн-ей
    юю, В               // превыспренн-юю
    ей, Т               // превыспренн-ей
    ею, Т               // превыспренн-ею
    ей, П               // превыспренн-ей
  .род с
    ее, И               // превыспренн-ее
    его, Р              // превыспренн-его
    ему, Д              // превыспренн-ему
    ее, В               // превыспренн-ее
    им, Т               // превыспренн-им
    ем, П               // превыспренн-ем
  .род
  .число М
    ие, И               // превыспренн-ие
    их, Р               // превыспренн-их
    им, Д               // превыспренн-им
    ие, Вн              // превыспренн-ие
    их, Во              // превыспренн-их
    ими, Т              // превыспренн-ими
    их, П               // превыспренн-их
  .число
    е, нр               // превыспренн-е
}

.тип п 2*a-
//--------------------------------------------------------------------------
// Пример: вечерний
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // вечерн-ий
    его, Р              // вечерн-его
    ему, Д              // вечерн-ему
    ий, Вн              // вечерн-ий
    его, Во             // вечерн-его
    им, Т               // вечерн-им
    ем, П               // вечерн-ем
  .род ж
    яя, И               // вечерн-яя
    ей, Р               // вечерн-ей
    ей, Д               // вечерн-ей
    юю, В               // вечерн-юю
    ей, Т               // вечерн-ей
    ею, Т               // вечерн-ею
    ей, П               // вечерн-ей
  .род с
    ее, И               // вечерн-ее
    его, Р              // вечерн-его
    ему, Д              // вечерн-ему
    ее, В               // вечерн-ее
    им, Т               // вечерн-им
    ем, П               // вечерн-ем
  .род
  .число М
    ие, И               // вечерн-ие
    их, Р               // вечерн-их
    им, Д               // вечерн-им
    ие, Вн              // вечерн-ие
    их, Во              // вечерн-их
    ими, Т              // вечерн-ими
    их, П               // вечерн-их
}

.тип п 2a
//--------------------------------------------------------------------------
// Пример: тугосисий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // тугосис-ий
    его, Р              // тугосис-его
    ему, Д              // тугосис-ему
    ий, Вн              // тугосис-ий
    его, Во             // тугосис-его
    им, Т               // тугосис-им
    ем, П               // тугосис-ем
    ь, кф               // тугосис-ь
  .род ж
    яя, И               // тугосис-яя
    ей, Р               // тугосис-ей
    ей, Д               // тугосис-ей
    юю, В               // тугосис-юю
    ей, Т               // тугосис-ей
    ею, Т               // тугосис-ею
    ей, П               // тугосис-ей
    я, кф               // тугосис-я
  .род с
    ее, И               // тугосис-ее
    его, Р              // тугосис-его
    ему, Д              // тугосис-ему
    ее, В               // тугосис-ее
    им, Т               // тугосис-им
    ем, П               // тугосис-ем
    е, кф               // тугосис-е
  .род
  .число М
    ие, И               // тугосис-ие
    их, Р               // тугосис-их
    им, Д               // тугосис-им
    ие, Вн              // тугосис-ие
    их, Во              // тугосис-их
    ими, Т              // тугосис-ими
    их, П               // тугосис-их
    и, кф               // тугосис-и
}

.тип п 2a!
//--------------------------------------------------------------------------
// Пример: орлий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // орл-ий
    его, Р              // орл-его
    ему, Д              // орл-ему
    ий, Вн              // орл-ий
    его, Во             // орл-его
    им, Т               // орл-им
    ем, П               // орл-ем
  .род ж
    яя, И               // орл-яя
    ей, Р               // орл-ей
    ей, Д               // орл-ей
    юю, В               // орл-юю
    ей, Т               // орл-ей
    ею, Т               // орл-ею
    ей, П               // орл-ей
  .род с
    ее, И               // орл-ее
    его, Р              // орл-его
    ему, Д              // орл-ему
    ее, В               // орл-ее
    им, Т               // орл-им
    ем, П               // орл-ем
  .род
  .число М
    ие, И               // орл-ие
    их, Р               // орл-их
    им, Д               // орл-им
    ие, Вн              // орл-ие
    их, Во              // орл-их
    ими, Т              // орл-ими
    их, П               // орл-их
}

.тип п 2a/c
//--------------------------------------------------------------------------
// Пример: синий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // син-ий
    его, Р              // син-его
    ему, Д              // син-ему
    ий, Вн              // син-ий
    его, Во             // син-его
    им, Т               // син-им
    ем, П               // син-ем
    ь, кф               // син-ь
  .род ж
    яя, И               // син-яя
    ей, Р               // син-ей
    ей, Д               // син-ей
    юю, В               // син-юю
    ей, Т               // син-ей
    ею, Т               // син-ею
    ей, П               // син-ей
    я, кф               // син-я
  .род с
    ее, И               // син-ее
    его, Р              // син-его
    ему, Д              // син-ему
    ее, В               // син-ее
    им, Т               // син-им
    ем, П               // син-ем
    е, кф               // син-е
  .род
  .число М
    ие, И               // син-ие
    их, Р               // син-их
    им, Д               // син-им
    ие, Вн              // син-ие
    их, Во              // син-их
    ими, Т              // син-ими
    их, П               // син-их
    и, кф               // син-и
  .число
    ее, ср              // син-ее
}

.тип п 2*aE1
//--------------------------------------------------------------------------
// Пример: искренний
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // искренн-ий
    его, Р              // искренн-его
    ему, Д              // искренн-ему
    ий, Вн              // искренн-ий
    его, Во             // искренн-его
    им, Т               // искренн-им
    ем, П               // искренн-ем
    '', кф              // искренен
  .род ж
    яя, И               // искренн-яя
    ей, Р               // искренн-ей
    ей, Д               // искренн-ей
    юю, В               // искренн-юю
    ей, Т               // искренн-ей
    ею, Т               // искренн-ею
    ей, П               // искренн-ей
    а, кф               // искренн-а
  .род с
    ее, И               // искренн-ее
    его, Р              // искренн-его
    ему, Д              // искренн-ему
    ее, В               // искренн-ее
    им, Т               // искренн-им
    ем, П               // искренн-ем
    е, кф               // искренн-е
    о, кф               // искренн-о
  .род
  .число М
    ие, И               // искренн-ие
    их, Р               // искренн-их
    им, Д               // искренн-им
    ие, Вн              // искренн-ие
    их, Во              // искренн-их
    ими, Т              // искренн-ими
    их, П               // искренн-их
    и, кф               // искренн-и
    ы, кф|затрудн       // искренн-ы
.число
    ее, ср              // искренн-ее
    е, нр               // искренн-е
}

