// мафиозо - мафиози

.тип мо frn_1
//---------------------------------------------------------------------------
// Пример: мафиозо
//---------------------------------------------------------------------------
{
  .число Е
    о, И                // мафиоз-о
    о, Р                // мафиоз-о
    о, Д                // мафиоз-о
    о, В                // мафиоз-о
    о, Т                // мафиоз-о
    о, П                // мафиоз-о
  .число М
    и, И                // мафиоз-и
    и, Р                // мафиоз-и
    и, Д                // мафиоз-и
    и, В                // мафиоз-и
    и, Т                // мафиоз-и
    и, П                // мафиоз-и
}
