// Тип 7

.тип м 7a
//---------------------------------------------------------------------------
// Пример: жребий
//---------------------------------------------------------------------------
{
  .число Е
    й, И                // жреби-й
    я, Р                // жреби-я
    ю, Д                // жреби-ю
    й, В                // жреби-й
    ем, Т               // жреби-ем
    и, П                // жреби-и
  .число М
    и, И                // жреби-и
    ев, Р               // жреби-ев
    ям, Д               // жреби-ям
    и, В                // жреби-и
    ями, Т              // жреби-ями
    ях, П               // жреби-ях
}

.тип мо 7a
//---------------------------------------------------------------------------
// Пример: змий
//---------------------------------------------------------------------------
{
  .число Е
    й, И                // зми-й
    я, Р                // зми-я
    ю, Д                // зми-ю
    я, В                // зми-я
    ем, Т               // зми-ем
    и, П                // зми-и
  .число М
    и, И                // зми-и
    ев, Р               // зми-ев
    ям, Д               // зми-ям
    ев, В               // зми-ев
    ями, Т              // зми-ями
    ях, П               // зми-ях
}

.тип м//мо 7a
//---------------------------------------------------------------------------
// Пример: пилидий
//---------------------------------------------------------------------------
{
  .число Е
    й, И                // пилиди-й
    я, Р                // пилиди-я
    ю, Д                // пилиди-ю
    й, Вн               // пилиди-й
    я, Во               // пилиди-я
    ем, Т               // пилиди-ем
    и, П                // о пилиди-и
  .число М
    и, И                // пилиди-и
    ев, Р               // пилиди-ев
    ям, Д               // пилиди-ям
    и, Вн               // пилиди-и
    ев, Во              // пилиди-ев
    ями, Т              // пилиди-ями
    ях, П               // пилиди-ях
}

.тип м 7a1
//---------------------------------------------------------------------------
// Пример: гравий
// Присутствует второй родительный падеж
//---------------------------------------------------------------------------
{
  .число Е
    й, И                // грави-й
    я, Р                // грави-я
    ю, Р2               // грави-ю
    ю, Д                // грави-ю
    й, В                // грави-й
    ем, Т               // грави-ем
    и, П                // грави-и
  .число М
    и, И                // грави-и
    ев, Р               // грави-ев
    ям, Д               // грави-ям
    и, В                // грави-и
    ями, Т              // грави-ями
    ях, П               // грави-ях
}

.тип м 7a-
//---------------------------------------------------------------------------
// Пример: ниобий
//---------------------------------------------------------------------------
{
  .число Е
    й, И                // ниоби-й
    я, Р                // ниоби-я
    ю, Д                // ниоби-ю
    й, В                // ниоби-й
    ем, Т               // ниоби-ем
    и, П                // ниоби-и
}

.тип м 7a1-
//---------------------------------------------------------------------------
// Пример: опий
// Присутствует второй родительный падеж
//---------------------------------------------------------------------------
{
  .число Е
    й, И                // опи-й
    я, Р                // опи-я
    ю, Р2               // опи-ю
    ю, Д                // опи-ю
    й, В                // опи-й
    ем, Т               // опи-ем
    и, П                // опи-и
}

.тип м 7c//7b
//---------------------------------------------------------------------------
// Пример: кий
//---------------------------------------------------------------------------
{
  .число Е
    й, И                // ки-й
    я, Р                // ки-я
    ю, Д                // ки-ю
    й, В                // ки-й
    ем, Т               // ки-ем
    и, П                // ки-и
    е, П                // ки-е
  .число М
    и, И                // ки-и
    ев, Р               // ки-ев
    ям, Д               // ки-ям
    и, В                // ки-и
    ями, Т              // ки-ями
    ях, П               // ки-ях
}

// Тип 8

.тип м 8b
//---------------------------------------------------------------------------
// Пример: путь
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // пут-ь
    и, Р                // пут-и
    и, Д                // пут-и
    ь, В                // пут-ь
    ем, Т               // пут-ем
    и, П                // пут-и
  .число М
    и, И                // пут-и
    ей, Р               // пут-ей
    ям, Д               // пут-ям
    и, В                // пут-и
    ями, Т              // пут-ями
    ях, П               // пут-ях
}

