// Тип 3

.тип ж 3a, ж 3b, ж 3d, ж 3d', ж 3f', ж 3d'//3d, ж 3f//3d, ж 3f'//3f, ж 3*a, ж 3*b, ж 3*d//3*b, ж 3*e, ж 3*f'//3*d, ж 3*f//3*d, мн._от_ж 3*a, мн._от_ж 3a, м//ж 3*a
//---------------------------------------------------------------------------
// Пример: влага, острога, дуга
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // влаг-а
    и, Р                // влаг-и
    е, Д                // влаг-е
    у, В                // влаг-у
    ой, Т               // влаг-ой
    ою, Т               // влаг-ою
    е, П                // о влаг-е
  .число М
    и, И                // влаг-и
    '', Р               // влаг
    ам, Д               // влаг-ам
    и, В                // влаг-и
    ами, Т              // влаг-ами
    ах, П               // о влаг-ах
}

.тип ж 3b?, ж 3*b?, ж 3*b?E1
//---------------------------------------------------------------------------
// Пример: чека
// Затруднена форма р. мн.
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // чек-а
    и, Р                // чек-и
    е, Д                // чек-е
    у, В                // чек-у
    ой, Т               // чек-ой
    ою, Т               // чек-ою
    е, П                // о чек-е
  .число М
    и, И                // чек-и
    '', Р|затрудн       // чек
    ам, Д               // чек-ам
    и, В                // чек-и
    ами, Т              // чек-ами
    ах, П               // о чек-ах
}

.тип ж 3b!
//---------------------------------------------------------------------------
// Пример: мга
// Отсутствует форма р. мн.
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // мг-а
    и, Р                // мг-и
    е, Д                // мг-е
    у, В                // мг-у
    ой, Т               // мг-ой
    ою, Т               // мг-ою
    е, П                // о мг-е
  .число М
    и, И                // мг-и
    ам, Д               // мг-ам
    и, В                // мг-и
    ами, Т              // мг-ами
    ах, П               // о мг-ах
}

.тип ж 3a-, ж 3b-, ж 3d-, ж 3*a-, ж 3*b-
//---------------------------------------------------------------------------
// Пример: вега
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // вег-а
    и, Р                // вег-и
    е, Д                // вег-е
    у, В                // вег-у
    ой, Т               // вег-ой
    ою, Т               // вег-ою
    е, П                // о вег-е
}

.тип жо 3a, мо-жо 3a, жо 3b, мо-жо 3b, жо 3d, жо 3d//3f, жо 3*a, мо-жо 3*a, жо 3*b
//---------------------------------------------------------------------------
// Пример: навага, селенга
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // наваг-а
    и, Р                // наваг-и
    е, Д                // наваг-е
    у, В                // наваг-у
    ой, Т               // наваг-ой
    ою, Т               // наваг-ою
    е, П                // о наваг-е
  .число М
    и, И                // наваг-и
    '', Р               // наваг
    ам, Д               // наваг-ам
    '', В               // наваг
    ами, Т              // наваг-ами
    ах, П               // о наваг-ах
}

.тип ж//жо 3a, ж//жо 3*a, жо//ж 3*a
//---------------------------------------------------------------------------
// Пример: бодяга ( пресноводная губка )
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // бодяг-а
    и, Р                // бодяг-и
    е, Д                // бодяг-е
    у, В                // бодяг-у
    ой, Т               // бодяг-ой
    ою, Т               // бодяг-ою
    е, П                // о бодяг-е
  .число М
    и, И                // бодяг-и
    '', Р               // бодяг
    ам, Д               // бодяг-ам
    и, Вн               // бодяг-и
    '', Во              // бодяг
    ами, Т              // бодяг-ами
    ах, П               // о бодяг-ах
}

.тип жо 3b?
//---------------------------------------------------------------------------
// Пример: карга
// Зтруднена форма р. мн.
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // карг-а
    и, Р                // карг-и
    е, Д                // карг-е
    у, В                // карг-у
    ой, Т               // карг-ой
    ою, Т               // карг-ою
    е, П                // о карг-е
  .число М
    и, И                // карг-и
    '', Р|затрудн       // карг
    ам, Д               // карг-ам
    '', В|затрудн       // карг
    ами, Т              // карг-ами
    ах, П               // о карг-ах
}

.тип жо 3*a-, жо 3b-
//---------------------------------------------------------------------------
// Пример: сошка (мелкая)
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // сошк-а
    и, Р                // сошк-и
    е, Д                // сошк-е
    у, В                // сошк-у
    ой, Т               // сошк-ой
    ою, Т               // сошк-ою
    е, П                // о сошк-е
}

.тип ж 3a:f1
//---------------------------------------------------------------------------
// Пример: припека (сбоку припека)
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // припек-а
}

.тип ж 3*a:f14
//---------------------------------------------------------------------------
// Пример: тютелька (в тютельку)
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // тютельк-а
    у, В                // тютельк-у
}

.тип ж 3*a:f4
//---------------------------------------------------------------------------
// Пример: обнимка (в обнимку)
//---------------------------------------------------------------------------
{
  .число Е
    у, В                // обнимк-у
}

.тип ж 3*a:f45p5
//---------------------------------------------------------------------------
// Пример: мышка (под мышками)
//---------------------------------------------------------------------------
{
  .число Е
    у, В                // мышк-у
    ой, Т               // мышк-ой
  .число М
    ами, Т              // мышк-ами
}

.тип ж 3*a:f5
//---------------------------------------------------------------------------
// Пример: всячинка (со всячинкой)
//---------------------------------------------------------------------------
{
  .число Е
    ой, Т               // всячинк-ой
}

.тип ж 3*a:p1
//---------------------------------------------------------------------------
// Пример: завидки (берут)
//---------------------------------------------------------------------------
{
  .число М
    и, И                // завидк-и
}

.тип ж 3*a:p4
//---------------------------------------------------------------------------
// Пример: микитки (под микитки)
//---------------------------------------------------------------------------
{
  .число М
    и, В                // микитк-и
}

.тип ж 3*a:p46
//---------------------------------------------------------------------------
// Пример: закорки (на закорки, на закорках)
//---------------------------------------------------------------------------
{
  .число М
    и, В                // закорк-и
    ах, П               // закорк-ах
}

.тип ж 3*a:p5
//---------------------------------------------------------------------------
// Пример: саженки (плыть саженками)
//---------------------------------------------------------------------------
{
  .число М
    ами, П              // саженк-ами
}

