// Тип 4

.тип ж 4a, мн._от_ж 4a
//---------------------------------------------------------------------------
// Пример: туча
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // туч-а
    и, Р                // туч-и
    е, Д                // туч-е
    у, В                // туч-у
    ей, Т               // туч-ей
    ею, Т               // туч-ею
    е, П                // о туч-е
  .число М
    и, И                // туч-и
    '', Р               // туч
    ам, Д               // туч-ам
    и, В                // туч-и
    ами, Т              // туч-ами
    ах, П               // о туч-ах
}

.тип ж 4a-
//---------------------------------------------------------------------------
// Пример: буча
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // буч-а
    и, Р                // буч-и
    е, Д                // буч-е
    у, В                // буч-у
    ей, Т               // буч-ей
    ею, Т               // буч-ею
    е, П                // о буч-е
}

.тип ж 4a"2"
//---------------------------------------------------------------------------
// Пример: корча
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // корч-а
    и, Р                // корч-и
    е, Д                // корч-е
    у, В                // корч-у
    ей, Т               // корч-ей
    ею, Т               // корч-ею
    е, П                // о корч-е
  .число М
    и, И                // корч-и
    ей, Р               // корч-ей
    ам, Д               // корч-ам
    и, В                // корч-и
    ами, Т              // корч-ами
    ах, П               // о корч-ах
}

.тип ж 4a["2"]
//---------------------------------------------------------------------------
// Пример: верша
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // верш-а
    и, Р                // верш-и
    е, Д                // верш-е
    у, В                // верш-у
    ей, Т               // верш-ей
    ею, Т               // верш-ею
    е, П                // о верш-е
  .число М
    и, И                // верш-и
    '', Р               // верш
    ей, Р               // верш-ей
    ам, Д               // верш-ам
    и, В                // верш-и
    ами, Т              // верш-ами
    ах, П               // о верш-ах
}

.тип ж 4d'
//---------------------------------------------------------------------------
// Пример: душа
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // душ-а
    и, Р                // душ-и
    е, Д                // душ-е
    у, В                // душ-у
    ой, Т               // душ-ой
    ою, Т               // душ-ою
    е, П                // о душ-е
  .число М
    и, И                // душ-и
    '', Р               // душ
    ам, Д               // душ-ам
    и, В                // душ-и
    ами, Т              // душ-ами
    ах, П               // о душ-ах
}

.тип ж 4b, ж 4f, ж 4b//4f
//---------------------------------------------------------------------------
// Пример: парча, вожжа
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // парч-а
    и, Р                // парч-и
    е, Д                // парч-е
    у, В                // парч-у
    ой, Т               // парч-ой
    ою, Т               // парч-ою
    е, П                // о парч-е
  .число М
    и, И                // парч-и
    ей, Р               // парч-ей
    ам, Д               // парч-ам
    и, В                // парч-и
    ами, Т              // парч-ами
    ах, П               // о парч-ах
}

.тип ж 4a//4b
//---------------------------------------------------------------------------
// Пример: баржа
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // барж-а
    и, Р                // барж-и
    е, Д                // барж-е
    у, В                // барж-у
    ей, Т               // барж-ей
    ею, Т               // барж-ею
    ой, Т               // барж-ой
    ою, Т               // барж-ою
    е, П                // о барж-е
  .число М
    и, И                // барж-и
    '', Р               // барж
    ей, Р               // барж-ей
    ам, Д               // барж-ам
    и, В                // барж-и
    ами, Т              // барж-ами
    ах, П               // о барж-ах
}

.тип ж 4b//4d, ж 4f~
//---------------------------------------------------------------------------
// Пример: межа, свеча
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // меж-а
    и, Р                // меж-и
    е, Д                // меж-е
    у, В                // меж-у
    ой, Т               // меж-ой
    ою, Т               // меж-ою
    е, П                // о меж-е
  .число М
    и, И                // меж-и
    '', Р               // меж
    ей, Р               // меж-ей
    ам, Д               // меж-ам
    и, В                // меж-и
    ами, Т              // меж-ами
    ах, П               // о меж-ах
}

.тип ж 4b-
//---------------------------------------------------------------------------
// Пример: моча
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // моч-а
    и, Р                // моч-и
    е, Д                // моч-е
    у, В                // моч-у
    ой, Т               // моч-ой
    ою, Т               // моч-ою
    е, П                // о моч-е
}

.тип жо 4a, мо-жо 4a
//---------------------------------------------------------------------------
// Пример: кляча
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // кляч-а
    и, Р                // кляч-и
    е, Д                // кляч-е
    у, В                // кляч-у
    ей, Т               // кляч-ей
    ею, Т               // кляч-ею
    е, П                // о кляч-е
  .число М
    и, И                // кляч-и
    '', Р               // кляч
    ам, Д               // кляч-ам
    '', В               // кляч
    ами, Т              // кляч-ами
    ах, П               // о кляч-ах
}

.тип жо 4a"2", мо-жо 4a"2"
//---------------------------------------------------------------------------
// Пример: юноша
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // юнош-а
    и, Р                // юнош-и
    е, Д                // юнош-е
    у, В                // юнош-у
    ей, Т               // юнош-ей
    ею, Т               // юнош-ею
    е, П                // о юнош-е
  .число М
    и, И                // юнош-и
    ей, Р               // юнош-ей
    ам, Д               // юнош-ам
    ей, В               // юнош-ей
    ами, Т              // юнош-ами
    ах, П               // о юнош-ах
}

.тип жо 4a["2"]
//---------------------------------------------------------------------------
// Пример: кумжа
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // кумж-а
    и, Р                // кумж-и
    е, Д                // кумж-е
    у, В                // кумж-у
    ей, Т               // кумж-ей
    ею, Т               // кумж-ею
    е, П                // о кумж-е
  .число М
    и, И                // кумж-и
    '', Р               // кумж
    ей, Р               // кумж-ей
    ам, Д               // кумж-ам
    ей, В               // кумж-ей
    ами, Т              // кумж-ами
    ах, П               // о кумж-ах
}

.тип жо 4b, мо-жо 4b
//---------------------------------------------------------------------------
// Пример: саджа
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // садж-а
    и, Р                // садж-и
    е, Д                // садж-е
    у, В                // садж-у
    ой, Т               // садж-ой
    ою, Т               // садж-ою
    е, П                // о садж-е
  .число М
    и, И                // садж-и
    ей, Р               // садж-ей
    ам, Д               // садж-ам
    ей, В               // садж-ей
    ами, Т              // садж-ами
    ах, П               // о садж-ах
}

.тип жо 4a//4b
//---------------------------------------------------------------------------
// Пример: чавыча
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // чавыч-а
    и, Р                // чавыч-и
    е, Д                // чавыч-е
    у, В                // чавыч-у
    ей, Т               // чавыч-ей
    ею, Т               // чавыч-ею
    ой, Т               // чавыч-ой
    ою, Т               // чавыч-ою
    е, П                // о чавыч-е
  .число М
    и, И                // чавыч-и
    '', Р               // чавыч
    ей, Р               // чавыч-ей
    ам, Д               // чавыч-ам
    '', В               // чавыч
    ей, В               // чавыч-ей
    ами, Т              // чавыч-ами
    ах, П               // о чавыч-ах
}

.тип жо 4b-
//---------------------------------------------------------------------------
// Пример: моща
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // мощ-а
    и, Р                // мощ-и
    е, Д                // мощ-е
    у, В                // мощ-у
    ой, Т               // мощ-ой
    ою, Т               // мощ-ою
    е, П                // о мощ-е
}

.тип ж 4a:p4
//---------------------------------------------------------------------------
// Пример: баклуши (бить)
//---------------------------------------------------------------------------
{
  .число М
    и, В                // баклуш-и
}

