// Существительные женского рода, тип словоизменения 7

.тип ж 7a
//---------------------------------------------------------------------------
// Пример: линия
//---------------------------------------------------------------------------
{
  .число Е
    я, И                // лини-я
    и, Р                // лини-и
    и, Д                // лини-и
    ю, В                // лини-ю
    ей, Т               // лини-ей
    ею, Т               // лини-ею
    и, П                // о лини-и
  .число М
    и, И                // лини-и
    й, Р                // лини-й
    ям, Д               // лини-ям
    и, В                // лини-и
    ями, Т              // лини-ями
    ях, П               // лини-ях
}

.тип ж 7a-, жо 7a-
//---------------------------------------------------------------------------
// Пример: русофобия, нототения
//---------------------------------------------------------------------------
{
  .число Е
    я, И                // русофоби-я
    и, Р                // русофоби-и
    и, Д                // русофоби-и
    ю, В                // русофоби-ю
    ей, Т               // русофоби-ей
    ею, Т               // русофоби-ею
    и, П                // русофоби-и
}

.тип ж 7b
//---------------------------------------------------------------------------
// Пример: лития
//---------------------------------------------------------------------------
{
  .число Е
    я, И                // лити-я
    и, Р                // лити-и
    и, Д                // лити-и
    ю, В                // лити-ю
    ей, Т               // лити-ей
    и, П                // о лити-и
  .число М
    и, И                // лити-и
    й, Р                // лити-й
    ям, Д               // лити-ям
    и, В                // лити-и
    ями, Т              // лити-ями
    ях, П               // лити-ях
}

.тип жо 7a, мо-жо 7a
//---------------------------------------------------------------------------
// Пример: амфибия
//---------------------------------------------------------------------------
{
  .число Е
    я, И                // амфиби-я
    и, Р                // амфиби-и
    и, Д                // амфиби-и
    ю, В                // амфиби-ю
    ей, Т               // амфиби-ей
    ею, Т               // амфиби-ею
    и, П                // об амфиби-и
  .число М
    и, И                // амфиби-и
    й, Р                // амфиби-й
    ям, Д               // амфиби-ям
    й, В                // амфиби-й
    ями, Т              // амфиби-ями
    ях, П               // об амфиби-ях
}

.тип ж//жо 7a, жо//ж 7a
//---------------------------------------------------------------------------
// Пример: бактерия
//---------------------------------------------------------------------------
{
  .число Е
    я, И                // бактери-я
    и, Р                // бактери-и
    и, Д                // бактери-и
    ю, В                // бактери-ю
    ей, Т               // бактери-ей
    ею, Т               // бактери-ею
    и, П                // об бактери-и
  .число М
    и, И                // бактери-и
    й, Р                // бактери-й
    ям, Д               // бактери-ям
    и, Вн               // бактери-и
    й, Во               // бактери-й
    ями, Т              // бактери-ями
    ях, П               // о бактери-ях
}

.тип жо 7aE1
//---------------------------------------------------------------------------
// Пример: кшатрия
//---------------------------------------------------------------------------
{
  .число Е
    я, И                // кшатри-я
    и, Р                // кшатри-и
    и, Д                // кшатри-и
    ю, В                // кшатри-ю
    ей, Т               // кшатри-ей
    и, П                // о кшатри-и
  .число М
    и, И                // кшатри-и
    ев, Р               // кшатри-ев
    ям, Д               // кшатри-ям
    ев, В               // кшатри-ев
    ями, Т              // кшатри-ями
    ях, П               // о кшатри-ях
}

.тип жо 7aE2
//---------------------------------------------------------------------------
// Пример: пария
//---------------------------------------------------------------------------
{
  .число Е
    я, И                // пари-я
    и, Р                // пари-и
    и, Д                // пари-и
    ю, В                // пари-ю
    ей, Т               // пари-ей
    и, П                // о пари-и
  .число М
    и, И                // пари-и
    й, Р                // пари-й
    ев, Р               // пари-ев
    ям, Д               // пари-ям
    й, В                // пари-й
    ев, В               // пари-ев
    ями, Т              // пари-ями
    ях, П               // о пари-ях
}

.тип жо 7b
//---------------------------------------------------------------------------
// Пример: судия
//---------------------------------------------------------------------------
{
  .число Е
    я, И                // суди-я
    и, Р                // суди-и
    и, Д                // суди-и
    ю, В                // суди-ю
    ей, Т               // суди-ей
    и, П                // о суди-и
  .число М
    и, И                // суди-и
    й, Р                // суди-й
    ям, Д               // суди-ям
    й, В                // суди-й
    ями, Т              // суди-ями
    ях, П               // о суди-ях
}

.тип ж 7a:p4
//---------------------------------------------------------------------------
// Пример: антимония (разводить антимонии)
//---------------------------------------------------------------------------
{
  .число М
    и, В                // антимони-и
}

