.table "1"
{
  ся,вф
}

.table "2"
{
  сь,вф
}

.table "3"
{
  сь,вф
  ся,вф
}

.table "4"
{
  .sing
    ю
  .plur
    ємо
}

.table "5"
{
  .sing
    ш
  .plur
    те
}

.table "6"
{
  .sing
    є
  .plur
    ють
}

.table "7"
{
  .sing
    ''
  .plur
    мо
    те
}

.table "8"
{
  .sing
    му
  .plur
    мемо
    мем
}

.table "9"
{
  .sing
    меш
  .plur
    мете
}

.table "10"
{
  .sing
    ме
  .plur
    муть
}

.table "11"
{
  .plur
    мемо
    мем
}

.table "12"
{
  .plur
    мете
}

.table "13"
{
  .plur
    муть
}

.table "14"
{
  .sing
  .msc
    в
  .fem
    ла
  .nwt
    ло
  .plur
    ли
}

.table "15"
{
  .sing
  .msc
    ий, И
    ого, Р
    ому, Д
    ий, Вн
    ого, Во
    им, Т
    ім, П
    ому, П
  .fem
    а, И
    ої, Р
    ій, Д
    у, В
    ою, Т
    ій, П
  .nwt
    о, И
    е, И
    ого, Р
    ому, Д
    е, Вн
    ого, Во
    им, Т
    ому, П
    ім, П
  .plur
    і, И
    их, Р
    им, Д
    і, Вн
    их, Во
    ими, Т
    их, П
}

.table "16"
{
  .sing
    у
  .plur
    имо
}

.table "17"
{
  .sing
    ить
  .plur
    ять
}

.table "18"
{
  .sing
    '',,"3"
  .plur
    мо,,"3"
    те,,"3"
}

.table "19"
{
  .sing
    му,,"3"
  .plur
    мем,,"1"
    мемо,,"3"
}

.table "20"
{
  .sing
    меш,,"1"
  .plur
    мете,,"3"
}

.table "21"
{
  .sing
    меть,,"1"
  .plur
    муть,,"1"
}

.table "22"
{
  .sing
    ю,,"3"
  .plur
    ємо,,"3"
}

.table "23"
{
  .sing
    ш,,"1"
  .plur
    те,,"3"
}

.table "24"
{
  .sing
    єть,,"1"
  .plur
    ють,,"1"
}

.table "25"
{
  .sing
  .msc
    в,,"3"
  .fem
    ла,,"3"
  .nwt
    ло,,"3"
  .plur
    ли,,"3"
}

.table "26"
{
  .sing
    и
  .plur
    іть
    імо
}

.table "27"
{
  .sing
    у
  .plur
    емо
}

.table "28"
{
  .sing
    еш
  .plur
    ете
}

.table "29"
{
  .sing
    е
  .plur
    уть
}

.table "30"
{
  .sing
  .msc
    ''
  .fem
    ла
  .nwt
    ло
  .plur
    ли
}

.table "31"
{
  .sing
    ю
  .plur
    емо
}

.table "32"
{
  .sing
    е
  .plur
    ють
}

.table "33"
{
  .sing
    м
  .plur
    мо
}

.table "34"
{
  .sing
    си
  .plur
    сте
}

.table "35"
{
  .sing
    сть
  .plur
    дуть
}

.table "36"
{
  .sing
    є
  .plur
    є
}

.table "37"
{
  .sing
    єси
    є
  .plur
    є
}

.table "38"
{
  .sing
    є
  .plur
    суть
    є
}

.table "39"
{
  .sing
    ю
  .plur
    имо
}

.table "40"
{
  .sing
    ить
  .plur
    ать
}

.table "41"
{
  .plur
    имо
}

.table "42"
{
  .sing
    ю
  .plur
    їмо
}

.table "43"
{
  .sing
    їть
  .plur
    ять
}

.table "44"
{
  .sing
    ю,,"3"
  .plur
    имо,,"3"
}

.table "45"
{
  .sing
    ить,,"1"
  .plur
    ять,,"1"
}

.table "46"
{
  .sing
    и,,"3"
  .plur
    іть,,"1"
    імо,,"3"
}

.table "47"
{
  .sing
    у,,"3"
  .plur
    имо,,"3"
}

.table "48"
{
  .sing
    ить,,"1"
  .plur
    ать,,"1"
}

.table "49"
{
  .sing
  .msc
    '',,"1"
  .fem
    ла,,"3"
  .nwt
    ло,,"3"
  .plur
    ли,,"3"
}

.table "50"
{
  .sing
    ю,,"3"
  .plur
    їмо,,"3"
}

.table "51"
{
  .sing
    їть,,"1"
  .plur
    ять,,"1"
}

.table "52"
{
  .sing
    ї
  .plur
    їть
    їмо
}

.table "53"
{
  .sing
    ї,,"3"
  .plur
    їть,,"1"
    їмо,,"3"
}

.table "54"
{
  .sing
    '',,"1"
  .plur
    мо,,"3"
    те,,"3"
}

.table "55"
{
  .sing
    у,,"3"
  .plur
    емо,,"3"
}

.table "56"
{
  .sing
    еть,,"1"
  .plur
    уть,,"1"
}

.table "57"
{
  .sing
    ю,,"3"
  .plur
    емо,,"3"
}

.table "58"
{
  .sing
    еть,,"1"
  .plur
    ють,,"1"
}

.table "59"
{
  .sing
    м,,"1"
  .plur
    мо,,"3"
}

.table "60"
{
  .sing
    си,,"3"
  .plur
    сте,,"3"
}

.table "61"
{
  .sing
    сть,,"1"
  .plur
    дуть,,"1"
}

.table "62"
{
  .sing
    сть
  .plur
    дять
}

.table "63"
{
  .plur
    мо,,"3"
    те,,"3"
}

.table "64"
{
  .sing
    ''
  .plur
    те
}

.table "65"
{
  .sing
  .msc
    ов
  .fem
    ла
  .nwt
    ло
  .plur
    ли
}

.table "66"
{
  .sing
  .msc
    іг
  .fem
    огла
  .nwt
    огло
  .plur
    огли
}

.table "67"
{
  .sing
  .msc
    ік
  .fem
    окла
  .nwt
    окло
  .plur
    окли
}

.table "68"
{
  .sing
  .msc
    іг
  .fem
    ягла
  .nwt
    ягло
  .plur
    ягли
}

.table "69"
{
  .sing
  .msc
    іг
  .fem
    егла
  .nwt
    егло
  .plur
    егли
}

.table "70"
{
  .sing
  .msc
    ів
  .fem
    ела
  .nwt
    ело
  .plur
    ели
}

.table "71"
{
  .sing
  .msc
    іп
  .fem
    опла
  .nwt
    опло
  .plur
    опли
}

.table "72"
{
  .sing
  .msc
    іб
  .fem
    ебла
  .nwt
    ебло
  .plur
    ебли
}

.table "73"
{
  .sing
  .msc
    із
  .fem
    езла
  .nwt
    езло
  .plur
    езли
}

.table "74"
{
  .sing
  .msc
    іс
  .fem
    есла
  .nwt
    есло
  .plur
    если
}

.table "75"
{
  .sing
  .msc
    іс
  .fem
    осла
  .nwt
    осло
  .plur
    осли
}

.table "76"
{
  .sing
  .msc
    ік
  .fem
    екла
  .nwt
    екло
  .plur
    екли
}

.table "77"
{
  .sing
  .msc
    іг,,"1"
  .fem
    егла,,"3"
  .nwt
    егло,,"3"
  .plur
    егли,,"3"
}

.table "78"
{
  .sing
  .msc
    ік,,"1"
  .fem
    окла,,"3"
  .nwt
    окло,,"3"
  .plur
    окли,,"3"
}

.table "79"
{
  .sing
  .msc
    ік,,"1"
  .fem
    екла,,"3"
  .nwt
    екло,,"3"
  .plur
    екли,,"3"
}

.table "80"
{
  .sing
  .msc
    іг,,"1"
  .fem
    огла,,"3"
  .nwt
    огло,,"3"
  .plur
    огли,,"3"
}

.table "81"
{
  .sing
  .msc
    ів,,"1"
  .fem
    ела,,"3"
  .nwt
    ело,,"3"
  .plur
    ели,,"3"
}

.table "82"
{
  .sing
  .msc
    іб,,"1"
  .fem
    ебла,,"3"
  .nwt
    ебло,,"3"
  .plur
    ебли,,"3"
}

.table "83"
{
  .sing
  .msc
    іс,,"1"
  .fem
    есла,,"3"
  .nwt
    есло,,"3"
  .plur
    если,,"3"
}

.table "84"
{
  .sing
  .msc
    іс,,"1"
  .fem
    осла,,"3"
  .nwt
    осло,,"3"
  .plur
    осли,,"3"
}

.table "85"
{
  .plur
    имо,,"3"
}

.table "86"
{
  .plur
    мо
    те
}

.table "87"
{
  .sing
  .fem
    ла
  .nwt
    ло
  .plur
    ли
}

.table "88"
{
  .plur
    іть,,"1"
    імо,,"3"
}

.table "89"
{
  .sing
    е
  .plur
    ять
}

.table "90"
{
  .plur
    ємо
}

.table "91"
{
  .plur
    емо
}

.table "92"
{
  .plur
    те
}

.table "93"
{
  .plur
    ють
}

.table "94"
{
  .plur
    ємо,,"3"
}

.table "95"
{
  .plur
    емо,,"3"
}

.table "96"
{
  .plur
    те,,"3"
}

.table "97"
{
  .plur
    ють,,"1"
}

.table "98"
{
  .plur
    ли
}

.table "99"
{
  .plur
    ли,,"3"
}

.table "100"
{
  .sing
    є
}

.table "101"
{
  .sing
    е
}

.table "102"
{
  .sing
    ме
}

.table "103"
{
  .plur
    уть
}

.table "104"
{
  .sing
    еть,,"1"
}

.table "105"
{
  .sing
  .nwt
    ло
}

.table "106"
{
  .sing
  .nwt
    ло,,"3"
}

.table "107"
{
  .sing
    меть,,"1"
}

.table "108"
{
  .plur
    мемо,,"3"
}

.table "109"
{
  .plur
    мете,,"1"
}

.table "110"
{
  .plur
    муть,,"1"
}

.table "111"
{
  .sing
    ть
}

.table "112"
{
  .plur
    ять
}

.table "113"
{
  .sing
    ть,,"1"
}

.table "114"
{
  .sing
  .msc
    ов,,"3"
  .fem
    ла,,"3"
  .nwt
    ло,,"3"
  .plur
    ли,,"3"
}

.table "115"
{
  .sing
  .msc
    іп,,"1"
  .fem
    опла,,"3"
  .nwt
    опло,,"3"
  .plur
    опли,,"3"
}

.table "116"
{
  .sing
  .msc
    ів,,"3"
  .fem
    ела,,"3"
  .nwt
    ело,,"3"
  .plur
    ели,,"3"
}

.table "117"
{
  .sing
    сть,,"1"
  .plur
    дять,,"1"
}

.table "118"
{
  .plur
    іть
    імо
}

.table "119"
{
  .sing
    чу
  .plur
    тимо
}

.table "120"
{
  .plur
    ть,,"1"
}

.table "121"
{
  .sing
  .fem
    ла,,"3"
  .plur
    ли,,"3"
}

.table "122"
{
  .sing
  .msc
    іг,,"1"
  .fem
    ягла,,"3"
  .nwt
    ягло,,"3"
  .plur
    ягли,,"3"
}

.table "123"
{
  .sing
  .msc
    ий, И
    ого, Р
    ому, Д
    ий, Вн
    ого, Во
    им, Т
    ім, П
    ому, П
  .fem
    а, И
    ої, Р
    ій, Д
    у, В
    ою, Т
    ій, П
  .nwt
    е, И
    ого, Р
    ому, Д
    е, Вн
    ого, Во
    им, Т
    ім, П
    ому, П
  .plur
    і, И
    их, Р
    им, Д
    і, Вн
    их, Во
    ими, Т
    их, П
}

.table "124"
{
  .fut
    .face 1
      ти,,"8"
    .face 2
      ти,,"9"
    .face 3
      ти,,"10"
}

.table "125"
{
  .fut
    .face 1
      ести,,"19"
    .face 2
      ести,,"20"
    .face 3
      ести,,"21"
}

.table "126"
{
  .inf
    ити
  .imp
    ий,,"7"
  .fut
    .face 1
      ити,,"8"
    .face 2
      ити,,"9"
    .face 3
      ити,,"10"
  .prs
    .face 1
      ',,"4"
    .face 2
      'є,,"5"
    .face 3
      ',,"6"
    .ger
      'ючи
  .pst
    и,,"14"
    .ger
      ивши
}

.table "127"
{
  .inf
    бити
  .imp
    бий,,"7"
  .fut
    .face 1
      іб',,"4"
    .face 2
      іб'є,,"5"
    .face 3
      іб',,"6"
  .pst
    би,,"14"
    .ger
      бивши
}

.table "128"
{
  .inf
    сти
  .imp
    й,,"7"
  .fut
    .face 1
      '',,"4"
    .face 2
      є,,"5"
    .face 3
      '',,"6"
  .pst
    '',,"14"
    .psv
      л,,"15"
    .ger
      вши
}

.table "129"
{
  .inf
    ати
  .imp
    '',,"26"
  .fut
    .face 1
      '',,"31"
    .face 2
      '',,"28"
    .face 3
      '',,"32"
  .pst
    а,,"14"
    .ger
      авши
}

.table "130"
{
  .inf
    оти
  .imp
    '',,"26"
  .fut
    .face 1
      оти,,"8"
    .face 2
      оти,,"9"
    .face 3
      оти,,"10"
  .prs
    .face 1
      '',,"31"
    .face 2
      '',,"28"
    .face 3
      '',,"32"
    .ger
      ючи
  .pst
    о,,"14"
    .psv
      от,,"15"
      ен,,"15"
    .ger
      овши
}

.table "131"
{
  .inf
    оти
  .imp
    '',,"26"
  .fut
    .face 1
      оти,,"8"
    .face 2
      оти,,"9"
    .face 3
      оти,,"10"
  .prs
    .face 1
      '',,"31"
    .face 2
      '',,"28"
    .face 3
      '',,"32"
    .act
      юч,,"15"
    .ger
      ючи
  .pst
    о,,"14"
    .psv
      от,,"15"
      ен,,"15"
    .ger
      овши
}

.table "132"
{
  .inf
    ути
  .imp
    ь,,"7"
  .fut
    .face 1
      '',,"27"
    .face 2
      '',,"28"
    .face 3
      '',,"29"
  .pst
    у,,"14"
    '',,"14"
    .ger
      нувши
      вши
}

.table "133"
{
  .inf
    ути
  .fut
    .face 1
      '',,"27"
    .face 2
      '',,"28"
    .face 3
      '',,"29"
  .pst
    у,,"14"
    .ger
      увши
}

.table "134"
{
  .inf
    сти
  .imp
    '',,"26"
  .fut
    .face 1
      сти,,"8"
    .face 2
      сти,,"9"
    .face 3
      сти,,"10"
  .prs
    .face 1
      '',,"27"
    .face 2
      '',,"28"
    .face 3
      '',,"29"
    .ger
      учи
  .pst
    '',,"14"
    .psv
      т,,"15"
    .ger
      вши
}

.table "135"
{
  .inf
    екти
  .imp
    еч,,"26"
  .fut
    .face 1
      екти,,"8"
    .face 2
      екти,,"9"
    .face 3
      екти,,"10"
  .prs
    .face 1
      еч,,"27"
    .face 2
      еч,,"28"
    .face 3
      еч,,"29"
    .ger
      ечучи
  .pst
    '',,"76"
    .psv
      ечен,,"15"
    .ger
      ікши
}

.table "136"
{
  .inf
    окти
  .imp
    оч,,"26"
  .fut
    .face 1
      окти,,"8"
    .face 2
      окти,,"9"
    .face 3
      окти,,"10"
  .prs
    .face 1
      оч,,"27"
    .face 2
      оч,,"28"
    .face 3
      оч,,"29"
    .ger
      очучи
  .pst
    '',,"67"
    .psv
      очен,,"15"
    .ger
      ікши
}

.table "137"
{
  .inf
    ягти
  .imp
    яж,,"7"
  .fut
    .face 1
      яж,,"27"
    .face 2
      яж,,"28"
    .face 3
      яж,,"29"
  .pst
    '',,"68"
    .psv
      егл,,"15"
    .ger
      ігши
}

.table "138"
{
  .inf
    ести
  .imp
    ед,,"26"
  .fut
    .face 1
      ести,,"8"
    .face 2
      ести,,"9"
    .face 3
      ести,,"10"
  .prs
    .face 1
      ед,,"27"
    .face 2
      ед,,"28"
    .face 3
      ед,,"29"
    .ger
      едучи
  .pst
    '',,"70"
    .psv
      еден,,"15"
    .ger
      івши
}

.table "139"
{
  .inf
    ти
  .imp
    д,,"26"
  .fut
    .face 1
      д,,"27"
    .face 2
      д,,"28"
    .face 3
      д,,"29"
  .pst
    ш,,"65"
    .psv
      шл,,"15"
    .ger
      шовши
}

.table "140"
{
  .inf
    сти
  .imp
    дь,,"7"
  .fut
    .face 1
      сти,,"8"
    .face 2
      сти,,"9"
    .face 3
      сти,,"10"
  .prs
    .face 1
      д,,"27"
    .face 2
      д,,"28"
    .face 3
      д,,"29"
    .ger
      дучи
  .pst
    '',,"14"
    .psv
      ден,,"15"
    .ger
      вши
}

.table "141"
{
  .inf
    сти
  .imp
    дь,,"7"
  .fut
    .face 1
      сти,,"8"
    .face 2
      сти,,"9"
    .face 3
      сти,,"10"
  .prs
    .face 1
      д,,"27"
    .face 2
      д,,"28"
    .face 3
      д,,"29"
    .ger
      дучи
  .pst
    '',,"14"
    .ger
      вши
}

.table "142"
{
  .inf
    ти
  .imp
    й,,"7"
  .fut
    .face 1
      '',,"33"
    .face 2
      '',,"34"
    .face 3
      '',,"35"
  .pst
    '',,"14"
    .psv
      л,,"15"
    .ger
      вши
}

.table "143"
{
  .inf
    ати
  .imp
    '',,"26"
  .fut
    .face 1
      л,,"31"
    .face 2
      л,,"28"
    .face 3
      л,,"32"
  .pst
    а,,"14"
    .psv
      ан,,"15"
    .ger
      авши
}

.table "144"
{
  .inf
    ти
  .imp
    '',,"26"
  .fut
    .face 1
      '',,"27"
    .face 2
      '',,"28"
    .face 3
      '',,"29"
  .pst
    і,,"14"
    .ger
      івши
}

.table "145"
{
  .inf
    езти
  .imp
    ез,,"26"
  .fut
    .face 1
      езти,,"8"
    .face 2
      езти,,"9"
    .face 3
      езти,,"10"
  .prs
    .face 1
      ез,,"27"
    .face 2
      ез,,"28"
    .face 3
      ез,,"29"
    .ger
      езучи
  .pst
    '',,"73"
    .psv
      езен,,"15"
    .ger
      ізши
}

.table "146"
{
  .inf
    ости
  .imp
    ост,,"26"
  .fut
    .face 1
      ости,,"8"
    .face 2
      ости,,"9"
    .face 3
      ости,,"10"
  .prs
    .face 1
      ост,,"27"
    .face 2
      ост,,"28"
    .face 3
      ост,,"29"
    .ger
      остучи
  .pst
    '',,"75"
    .ger
      ісши
}

.table "147"
{
  .inf
    ости
  .imp
    ост,,"26"
  .fut
    .face 1
      ост,,"27"
    .face 2
      ост,,"28"
    .face 3
      ост,,"29"
  .pst
    '',,"75"
    .psv
      л,,"15"
    .ger
      ісши
}

.table "148"
{
  .inf
    ти
  .imp
    '',,"26"
  .fut
    .face 1
      '',,"27"
    .face 2
      '',,"28"
    .face 3
      '',,"29"
  .pst
    '',,"30"
    .psv
      л,,"15"
    .ger
      вши
}

.table "149"
{
  .inf
    ати
  .imp
    '',,"26"
  .fut
    .face 3
      ати,,"10"
  .prs
    .face 3
      л,,"32"
    .ger
      лючи
  .pst
    а,,"14"
    .ger
      авши
}

.table "150"
{
  .inf
    нути
  .fut
    .face 3
      н,,"29"
  .pst
    ну,,"14"
    '',,"30"
    .psv
      л,,"15"
      нут,,"15"
    .ger
      ши
      нувши
}

.table "151"
{
  .inf
    ути
  .fut
    .face 3
      '',,"29"
  .pst
    '',,"87"
    у,,"14"
    .ger
      ши
      увши
}

.table "152"
{
  .inf
    ти
  .fut
    .face 3
      '',,"29"
  .pst
    '',,"30"
    .psv
      л,,"15"
    .ger
      вши
}

.table "153"
{
  .inf
    ути
  .imp
    '',,"118"
  .fut
    .face 1
      '',,"91"
    .face 2
      е,,"92"
    .face 3
      '',,"103"
  .pst
    у,,"98"
    .psv
      ул,,"15"
    .ger
      увши
}

.table "154"
{
  .inf
    ввити,,"3"
  .imp
    ввий,,"54"
  .fut
    .face 1
      ув',,"22"
    .face 2
      ув'є,,"23"
    .face 3
      ув',,"24"
  .pst
    вви,,"25"
    .ger
      ввивши,,"2"
}

.table "155"
{
  .inf
    окти,,"3"
  .imp
    оч,,"46"
  .fut
    .face 1
      окти,,"19"
    .face 2
      окти,,"20"
    .face 3
      окти,,"21"
  .prs
    .face 1
      оч,,"55"
    .face 2
      оче,,"23"
    .face 3
      оч,,"56"
    .ger
      очучи,,"2"
  .pst
    '',,"78"
    .ger
      ікши,,"2"
}

.table "156"
{
  .inf
    ати,,"3"
  .imp
    '',,"26"
  .fut
    .face 1
      л,,"57"
    .face 2
      ле,,"23"
    .face 3
      л,,"58"
  .pst
    а,,"25"
    .ger
      авши,,"2"
}

.table "157"
{
  .inf
    ести,,"3"
  .fut
    .face 3
      ед,,"56"
  .pst
    '',,"116"
    .ger
      івши,,"2"
}

.table "158"
{
  .inf
    ти,,"3"
  .fut
    .face 3
      н,,"56"
  .pst
    '',,"25"
    .ger
      вши,,"2"
}

.table "159"
{
  .inf
    ути,,"3"
  .fut
    .face 3
      ути,,"21"
  .prs
    .face 3
      '',,"56"
  .pst
    у,,"25"
    .ger
      увши,,"2"
}

.table "160"
{
  .inf
    нути,,"3"
  .fut
    .face 3
      н,,"56"
      нути,,"21"
  .pst
    ну,,"25"
    '',,"49"
    .ger
      увши,,"2"
}

.table "161"
{
  .inf
    ти,,"3"
  .fut
    .face 3
      ти,,"21"
    .ger
      ючи,,"2"
  .prs
    .face 3
      '',,"24"
  .pst
    '',,"121"
    .ger
      вши,,"2"
}

.table "162"
{
  .inf
    яти,,"3"
  .fut
    .face 3
      яти,,"21"
    .ger
      ючи,,"2"
  .prs
    .face 3
      '',,"24"
  .pst
    я,,"25"
    .ger
      явши,,"2"
}

.table "163"
{
  .inf
    ти,,"3"
  .fut
    .face 3
      ти,,"21"
  .prs
    .face 3
      '',,"24"
    .ger
      ючи,,"2"
  .pst
    '',,"25"
    .ger
      вши,,"2"
}

.table "164"
{
  .inf
    ости,,"3"
  .fut
    .face 3
      ост,,"56"
  .pst
    '',,"84"
    .ger
      ісши,,"2"
}

.table "165"
{
  .inf
    ти,,"3"
  .imp
    '',,"46"
  .fut
    .face 1
      '',,"95"
    .face 2
      е,,"96"
    .face 3
      у,,"120"
  .pst
    '',,"99"
    .ger
      ши,,"2"
}

.table "166"
{
  .inf
    іти,,"3"
  .imp
    '',,"26"
  .fut
    .face 1
      '',,"95"
    .face 2
      е,,"96"
    .face 3
      у,,"120"
  .pst
    '',,"99"
    .ger
      ши,,"2"
}

.table "167"
{
  .inf
    іти
  .imp
    '',,"26"
  .fut
    .face 1
      '',,"31"
    .face 2
      е,,"5"
    .face 3
      '',,"89"
  .pst
    і,,"14"
    .ger
      івши
}

.table "168"
{
  .inf
    ити
  .imp
    ь,,"7"
    '',,"26"
  .fut
    .face 1
      ити,,"8"
    .face 2
      ити,,"9"
    .face 3
      ити,,"10"
  .prs
    .face 1
      '',,"16"
    .face 2
      и,,"5"
    .face 3
      '',,"17"
    .ger
      ячи
  .pst
    и,,"14"
    .psv
      ен,,"15"
    .ger
      ивши
}

.table "169"
{
  .inf
    іти
  .imp
    '',,"26"
  .fut
    .face 1
      іти,,"8"
    .face 2
      іти,,"9"
    .face 3
      іти,,"10"
  .prs
    .face 1
      '',,"16"
    .face 2
      и,,"5"
    .face 3
      '',,"17"
    .ger
      ячи
  .pst
    і,,"14"
    .psv
      ен,,"15"
    .ger
      івши
}

.table "170"
{
  .inf
    іти
  .imp
    ь,,"7"
  .fut
    .face 1
      '',,"16"
    .face 2
      и,,"5"
    .face 3
      '',,"17"
  .pst
    і,,"14"
    .psv
      ен,,"15"
    .ger
      івши
}

.table "171"
{
  .inf
    ити,,"2"
  .imp
    '',,"46"
    ь,,"54"
  .fut
    .face 1
      '',,"47"
    .face 2
      и,,"23"
    .face 3
      '',,"45"
  .pst
    и,,"25"
    .ger
      ивши,,"2"
}

.table "172"
{
  .inf
    іти,,"3"
  .imp
    ь,,"54"
  .fut
    .face 1
      іти,,"19"
    .face 2
      іти,,"20"
    .face 3
      іти,,"21"
  .prs
    .face 1
      '',,"47"
    .face 2
      и,,"23"
    .face 3
      '',,"45"
  .pst
    і,,"25"
    .ger
      івши,,"2"
}

.table "173"
{
  .inf
    ати,,"3"
  .imp
    '',,"54"
  .fut
    .face 1
      ати,,"19"
    .face 2
      ати,,"20"
    .face 3
      ати,,"21"
  .prs
    .face 1
      '',,"47"
    .face 2
      и,,"23"
    .face 3
      '',,"48"
    .ger
      ачи,,"2"
  .pst
    а,,"25"
    .ger
      авши,,"2"
}

.table "174"
{
  .inf
    ити,,"3"
  .fut
    .face 3
      '',,"45"
  .pst
    и,,"121"
    .ger
      ивши,,"2"
}

.table "175"
{
  .sing
  .msc
    ий, И
    ого, Р
    ому, Д
    ого, Во
    им, Т
    ім, П
    ому, П
  .fem
    а, И
    ої, Р
    ій, Д
    у, В
    ою, Т
    ій, П
  .nwt
    е, И
    ого, Р
    ому, Д
    е, В
    им, Т
    ім, П
    ому, П
  .plur
    і, И
    их, Р
    им, Д
    их, Во
    ими, Т
    их, П
}

.table "176"
{
  .sing
  .msc
    ій, И
    ього, Р
    ьому, Д
    ій, Вн
    ього, Во
    ім, Т
    ьому, П
    ім, П
}

.table "177"
{
  .sing
  .nwt
    є, И
    ього, Р
    ьому, Д
    ім, Т
    ьому, П
    ім, П
}

.table "178"
{
  .plur
    і, И
    іх, Р
    ім, Д
    і, В
    іх, В
    іми, Т
    іх, П
}

.table "179"
{
  .sing
  .fem
    а, И
    ої, Р
    ій, Д
    у, В
    ою, Т
    ій, П
}

.table "180"
{
  .sing
  .nwt
    е, И
    ого, Р
    ому, Д
    им, Т
    ому, П
    ім, П
}

.table "181"
{
  .sing
  .fem
    єва, И
    євої, Р
    євій, Д
    єву, В
    євою, Т
    євій, П
}

.table "182"
{
  .sing
  .nwt
    єве, И
    євого, Р
    євому, Д
    євим, Т
    євому, П
    євім, П
}

.table "183"
{
  .plur
    єві, И
    євих, Р
    євим, Д
    єві, В
    євих, В
    євими, Т
    євих, П
}

.table "184"
{
  .sing
    ірня, И
    ірні, Р
    ірні, Д
    ірню, В
    ірнею, Т
    ірні, П
    ірне, З
  .plur
    ерні, И
    ерень, Р
    ерням, Д
    ерні, В
    ернями, Т
    ернях, П
    ерні, З
}

.table "185"
{
  .sing
    іль, И
    елі, Р
    елі, Д
    іль, В
    елею, Т
    іллю, Т
    елі, П
    еле, З
  .plur
    елі, И
    елей, Р
    елям, Д
    елі, В
    елями, Т
    елях, П
    елі, З
}

.table "186"
{
  .sing
    ість, И
    ості, Р
    ості, Д
    ість, В
    істю, Т
    ості, П
    осте, З
  .plur
    ості, И
    остей, Р
    остям, Д
    ості, В
    істьми, Т
    остями, Т
    остях, П
    ості, З
}

.table "187"
{
  .sing
    я, И
    ьої, Р
    ій, Д
    ю, В
    ьою, Т
    ій, П
  .plur
    і, И
    іх, Р
    ім, Д
    і, В
    іми, Т
    іх, П
}

.table "188"
{
  .sing
    а, И
    ої, Р
    ій, Д
    у, В
    ою, Т
    ій, П
  .plur
    і, И
    их, Р
    им, Д
    их, В
    ими, Т
    их, П
}

.table "189"
{
  .sing
    а, И
    ої, Р
    ій, Д
    у, В
    ою, Т
    ій, П
    а, З
  .plur
    і, И
    их, Р
    им, Д
    і, В
    ими, Т
    их, П
    і, З
}

.table "190"
{
  .sing
    я, Р
    ю, Д
    й, В
    ю, З
  .plur
    ям, Д
    ями, Т
    ях, П
}

.table "191"
{
  .sing
    '', И
    у, Д
    ові, Д
    ом, Т
    і, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    ами, Т
    ах, П
}

.table "192"
{
  .sing
    '', И
    ю, Р
    еві, Д
    ю, Д
    '', В
    ем, Т
    і, П
    ю, З
}

.table "193"
{
  .sing
    '', И
    а, Р
    ові, Д
    у, Д
    '', В
    ом, Т
    у, П
    е, З
}

.table "194"
{
  .sing
    '', И
    а, Р
    у, Д
    '', В
    ом, Т
    у, П
    у, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.table "195"
{
  .sing
    '', И
    а, Р
    ові, Д
    у, Д
    а, В
    ом, Т
    і, П
    ові, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    ів, В
    ами, Т
    ах, П
    ове, З
    и, З
}

.table "196"
{
  .sing
    ес, И
    са, Р
    сові, Д
    су, Д
    са, В
    сом, Т
    сі, П
    сові, П
    есе, З
  .plur
    си, И
    сів, Р
    сам, Д
    сів, В
    сами, Т
    сах, П
    си, З
}

.table "197"
{
  .sing
    '', И
    у, Р
    у, Д
    '', В
    ом, Т
    у, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.table "198"
{
  .sing
    '', И
    у, Р
    ові, Д
    у, Д
    '', В
    ом, Т
    у, П
    е, З
}

.table "199"
{
  .sing
    рець, И
    ерцю, Р
    ерцеві, Д
    ерцю, Д
    рець, В
    ерцем, Т
    ерцеві, П
    ерці, П
    ерцю, З
  .plur
    ерці, И
    ерців, Р
    ерцям, Д
    ерців, В
    ерцями, Т
    ерцях, П
    ерці, З
}

.table "200"
{
  .sing
    '', И
    у, Р
    еві, Д
    у, Д
    '', В
    ем, Т
    еві, П
    і, П
    у, З
  .plur
    і, И
    ів, Р
    ам, Д
    і, В
    ами, Т
    ах, П
    і, З
}

.table "201"
{
  .sing
    о, И
    а, Р
    у, Д
    ові, Д
    а, В
    ом, Т
    ові, П
    о, З
  .plur
    и, И
    ів, Р
    ам, Д
    '', В
    ами, Т
    ах, П
    и, З
}

.table "202"
{
  .sing
    дя, И
    ді, Р
    ді, Д
    дю, В
    дею, Т
    ді, П
    де, З
  .plur
    ді, И
    ей, Р
    дям, Д
    ей, В
    дями, Т
    дях, П
    ді, З
}

.table "203"
{
  .sing
    е, И
    я, Р
    еві, Д
    ю, Д
    е, В
    ем, Т
    і, П
    е, З
  .plur
    і, И
    я, И
    ь, Р
    ям, Д
    я, В
    і, В
    ями, Т
    ях, П
    я, З
}

.table "204"
{
  .sing
    я, И
    я, Р
    ю, Д
    я, В
    ям, Т
    ї, П
    я, З
  .plur
    я, И
    їв, Р
    ям, Д
    їв, В
    ями, Т
    ях, П
    я, З
}

.table "205"
{
  .sing
    ім'я, И
    ім'я, Р
    ім'ю, Д
    ім'я, В
    ім'ям, Т
    ім'ї, П
    ім'я, З
  .plur
    емена, И
    емен, Р
    еменам, Д
    емена, В
    еменами, Т
    еменах, П
    емена, З
}

.table "206"
{
  .plur
    лі, И
    ель, Р
    лям, Д
    лі, В
    лями, Т
    лях, П
    лі, З
}

.table "207"
{
  .plur
    и, И
    ей, Р
    ям, Д
    ей, В
    ми, Т
    ях, П
    и, З
}

.table "208"
{
  .sing
  .msc
    який, И
    якого, Р
    якому, Д
    який, Вн
    якого, Во
    яким, Т
    якім, П
    якому, П
  .fem
    яка, И
    якої, Р
    якій, Д
    яку, В
    якою, Т
    якій, П
  .nwt
    яке, И
    якого, Р
    якому, Д
    яким, Т
    якім, П
    якому, П
  .plur
    які, И
    яких, Р
    яким, Д
    яких, Вн
    які, Во
    якими, Т
    яких, П
}

.table "209"
{
  .sing
    и, И
    ас, Р
    ам, Д
    ас, В
    ами, Т
    ас, П
}

.table "210"
{
  .sing
    ебе, Р
    обі, Д
    ебе, В
    обою, Т
    обі, П
}

.table "211"
{
  .sing
    ім, И
    еми, Р
    імох, Р
    еми, Д
    імом, Д
    ім, В
    імох, В
    імома, Т
    ьома, Т
    імох, П
    еми, П
}

.table "212"
{
  .sing
    емеро, И
    імох, Р
    імом, Д
    імох, В
    імома, Т
    імох, П
}

.table "213"
{
  .sing
    ісім, И
    ісьмох, Р
    осьми, Р
    ісьмом, Д
    осьми, Д
    ісім, В
    ісьмох, В
    ісьма, Т
    ісьмома, Т
    осьми, П
    ісьмох, П
}

.table "214"
{
  .sing
    осьмеро, И
    ісьмох, Р
    ісьмом, Д
    осьмеро, В
    ісьмох, В
    ісьмома, Т
    ісьмох, П
}

.table "215"
{
  .sing
    істсот, И
    естисот, Р
    естистам, Д
    істсот, В
    істьмастами, Т
    естистах, П
}

.table "216"
{
  .sing
    імсот, И
    емисот, Р
    емистам, Д
    імсот, В
    емистами, Т
    емистах, П
}

.table "217"
{
  .sing
    ісімсот, И
    осьмисот, Р
    осьмистам, Д
    ісімсот, В
    осьмистами, Т
    осьмистах, П
}
