.type ж <00001>
{
  .sing
    я, И
    ї, Р
    ї, Д
    ю, В
    єю, Т
    ї, П
    є, З
  .plur
    ї, И
    й, Р
    ям, Д
    ї, В
    ями, Т
    ях, П
    ї, З
}

.type ж <00002>
{
  .sing
    ь, И
    і, Р
    і, Д
    ь, В
    ю, Т
    і, П
    е, З
  .plur
    і, И
    ей, Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type ж <00003>, ч/ж <00002>, чi/жi <00007>
{
  .sing
    а, И
    и, Р
    і, Д
    у, В
    ою, Т
    і, П
    о, З
  .plur
    и, И
    '', Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ж <00004>
{
  .sing
    а, И
    і, Р
    і, Д
    у, В
    ею, Т
    і, П
    е, З
  .plur
    і, И
    '', Р
    ам, Д
    і, В
    ами, Т
    ах, П
    і, З
}

.type ж <00005>
{
  .sing
    ь, И
    і, Р
    і, Д
    ь, В
    ю, Т
    і, П
    е, З
}

.type ж <00006>
{
  .sing
    а, И
    и, Р
    і, Д
    у, В
    ою, Т
    і, П
    о, З
}

.type ж <00007>
{
  .sing
    я, И
    ї, Р
    ї, Д
    ю, В
    єю, Т
    ї, П
    є, З
}

.type ж <00008>
{
  .sing
    '', И
    і, Р
    і, Д
    '', В
    ю, Т
    і, П
    е, З
  .plur
    і, И
    ей, Р
    ам, Д
    і, В
    ами, Т
    ах, П
    і, З
}

.type ж <00009>
{
  .sing
    я, И
    і, Р
    і, Д
    ю, В
    ею, Т
    і, П
    е, З
  .plur
    і, И
    ь, Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type ж <00010>, ж/с <00001>, жi <00004>, с <00001>, ч <00002>, ч/с <00001>, ч/ж <00001>, чi <00010>, чi/жi <00002>
{
  .sing
    '', И
    '', Р
    '', Д
    '', В
    '', Т
    '', П
    '', З
  .plur
    '', И
    '', Р
    '', Д
    '', В
    '', Т
    '', П
    '', З
}

.type ж <00011>
{
  .sing
    а, И
    і, Р
    і, Д
    у, В
    ею, Т
    і, П
    е, З
}

.type ж <00012>
{
  .sing
    я, И
    і, Р
    і, Д
    ю, В
    ею, Т
    і, П
    е, З
}

.type ж <00013>
{
  .sing
    '', И
    і, Р
    і, Д
    '', В
    ею, Т
    і, П
    е, З
  .plur
    і, И
    ів, Р
    ам, Д
    і, В
    ами, Т
    ах, П
    і, З
}

.type ж <00014>
{
  .sing
    гра, И
    гри, Р
    грі, Д
    гру, В
    грою, Т
    грі, П
    гро, З
  .plur
    ігри, И
    ігор, Р
    іграм, Д
    ігри, В
    іграми, Т
    іграх, П
    ігри, З
}

.type ж <00015>
{
  .sing
    я, И
    і, Р
    і, Д
    ю, В
    ею, Т
    і, П
    е, З
  .plur
    і, И
    ей, Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type ж <00016>, жi <00012>
{
  .sing
    а, И
    ої, Р
    ій, Д
    у, В
    ою, Т
    ій, П
  .plur
    і, И
    их, Р
    им, Д
    і, В
    ими, Т
    их, П
}

.type ж <00017>
{
  .sing
    '', И
    і, Р
    і, Д
    '', В
    ю, Т
    і, П
    е, З
}

.type ж <00018>
{
  .sing
    '', И
    і, Р
    і, Д
    '', В
    'ю, Т
    і, П
    е, З
  .plur
    і, И
    ей, Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type ж <00019>
{
  .sing
    я-регія, И
    ї-регії, Р
    ї-регії, Д
    ю-регію, В
    єю-регією, Т
    ї-регії, П
    є-регіє, З
  .plur
    ї-регії, И
    й-регій, Р
    ям-регіям, Д
    ї-регії, В
    ям-регіям, Т
    ях-регіях, П
    ї-регії, З
}

.type ж <00020>
{
  .sing
    а, И
    и, Р
    і, Д
    у, В
    ою, Т
    і, П
    о, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ж <00021>
{
  .sing
    я, И
    і, Р
    і, Д
    ю, В
    ею, Т
    і, П
    е, З
  .plur
    і, И
    '', Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type ж <00022>
{
  .sing
    я, И
    і, Р
    і, Д
    ю, В
    ею, Т
    і, П
    е, З
  .plur
    і, И
    ів, Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type ж <00023>
{
  .sing
    я, И
    і, Р
    і, Д
    ю, В
    ею, Т
    і, П
    е, З
  .plur
    і, И
    ь, Р
    ів, Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type ж <00024>
{
  .sing
    '', И
    і, Р
    і, Д
    '', В
    'ю, Т
    і, П
    е, З
}

.type ж <00025>
{
  .sing
    я, И
    єї, Р
    їй, Д
    ю, В
    єю, Т
    їй, П
    я, З
  .plur
    ї, И
    їх, Р
    їм, Д
    ї, В
    їх, В
    їми, Т
    їх, П
    ї, З
}

.type ж <00026>
{
  .sing
    а, И
    і, Р
    і, Д
    у, В
    ею, Т
    і, П
    е, З
  .plur
    і, И
    ів, Р
    ам, Д
    і, В
    ами, Т
    ах, П
    і, З
}

.type ж <00027>
{
  .sing
    я-буря, И
    і-бурі, Р
    і-бурі, Д
    ю-бурю, В
    ею-бурею, Т
    і-бурі, П
    е-буре, З
}

.type ж/с <00002>
{
  .sing
    е, И
    а, Р
    у, Д
    е, В
    ем, Т
    і, П
    е, З
  .plur
    а, И
    '', Р
    ам, Д
    а, В
    ами, Т
    ах, П
    а, З
}

.type жi <00001>, чi <00014>, чi/жi <00001>
{
  .sing
    а, И
    и, Р
    і, Д
    у, В
    ою, Т
    і, П
    о, З
  .plur
    и, И
    '', Р
    ам, Д
    '', В
    ами, Т
    ах, П
    и, З
}

.type жi <00002>, чi <00022>, чi/жi <00003>
{
  .sing
    я, И
    і, Р
    і, Д
    ю, В
    ею, Т
    і, П
    е, З
  .plur
    і, И
    ь, Р
    ям, Д
    ь, В
    ями, Т
    ях, П
    і, З
}

.type жi <00003>, чi <00026>, чi/жi <00008>
{
  .sing
    я, И
    ї, Р
    ї, Д
    ю, В
    єю, Т
    ї, П
    є, З
  .plur
    ї, И
    й, Р
    ям, Д
    й, В
    ями, Т
    ях, П
    ї, З
}

.type жi <00005>
{
  .sing
    вівця, И
    вівці, Р
    вівці, Д
    вівцю, В
    вівцею, Т
    вівці, П
    вівце, З
  .plur
    вівці, И
    овець, Р
    вівцям, Д
    овець, В
    вівці, В
    вівцями, Т
    вівцях, П
    вівці, З
}

.type жi <00006>, чi/сi <00003>
{
  .sing
    о, И
    а, Р
    ові, Д
    у, Д
    а, В
    ом, Т
    ові, П
    о, З
  .plur
    а, И
    '', Р
    ам, Д
    '', В
    ами, Т
    ах, П
    а, З
}

.type жi <00007>
{
  .sing
    ка, И
    ки, Р
    ці, Д
    ку, В
    кою, Т
    ці, П
    ко, З
  .plur
    ки, И
    ок, Р
    кам, Д
    ок, В
    ки, В
    ками, Т
    ках, П
    ки, З
}

.type жi <00008>
{
  .sing
    а, И
    и, Р
    і, Д
    у, В
    ою, Т
    і, П
    о, З
  .plur
    и, И
    ів, Р
    ам, Д
    ів, В
    ами, Т
    ах, П
    и, З
}

.type жi <00009>, сi <00003>, чi <00020>, чi/жi <00006>
{
  .sing
    е, И
    а, Р
    еві, Д
    у, Д
    е, В
    ем, Т
    і, П
    еві, П
    е, З
  .plur
    а, И
    '', Р
    ам, Д
    '', В
    ами, Т
    ах, П
    а, З
}

.type жi <00010>
{
  .sing
    е, И
    і, Р
    і, Д
    е, В
    ею, Т
    і, П
    е, З
  .plur
    і, И
    '', Р
    ам, Д
    '', В
    ами, Т
    ах, П
    і, З
}

.type жi <00011>
{
  .sing
    ь, И
    і, Р
    і, Д
    ь, В
    ю, Т
    і, П
    е, З
  .plur
    і, И
    ей, Р
    ям, Д
    ей, В
    ями, Т
    ях, П
    і, З
}

.type жi <00013>
{
  .sing
    ір, И
    ері, Р
    ері, Д
    ір, В
    ір'ю, Т
    ері, П
    ір, З
}

.type жi <00014>
{
  .sing
    я, И
    і, Р
    і, Д
    ю, В
    ею, Т
    і, П
    е, З
  .plur
    і, И
    ей, Р
    ям, Д
    ей, В
    ями, Т
    ях, П
    і, З
}

.type жi <00015>, чi <00021>, чi/жi <00005>
{
  .sing
    а, И
    і, Р
    і, Д
    у, В
    ею, Т
    і, П
    е, З
  .plur
    і, И
    '', Р
    ам, Д
    '', В
    ами, Т
    ах, П
    і, З
}

.type жi <00016>
{
  .sing
    а, И
    і, Р
    і, Д
    у, В
    ею, Т
    і, П
    е, З
  .plur
    і, И
    ей, Р
    ам, Д
    і, В
    ами, Т
    има, Т
    ах, П
    і, З
}

.type жi <00017>
{
  .sing
    е, И
    а, Р
    у, Д
    е, В
    ем, Т
    і, П
    е, З
  .plur
    а, И
    '', Р
    ам, Д
    '', В
    ами, Т
    ах, П
    а, З
}

.type жi <00018>
{
  .sing
    я, И
    і, Р
    і, Д
    ю, В
    ею, Т
    і, П
    е, З
  .plur
    і, И
    ів, Р
    ям, Д
    ів, В
    ями, Т
    ях, П
    і, З
}

.type жi <00019>
{
  .sing
    ина, И
    ини, Р
    ині, Д
    ину, В
    иною, Т
    ині, П
    ино, З
  .plur
    и, И
    ей, Р
    ям, Д
    ей, В
    ьми, Т
    ях, П
    и, З
}

.type жi <00020>
{
  .sing
    ка, И
    ки, Р
    ці, Д
    ку, В
    кою, Т
    ці, П
    ко, З
}

.type жi <00021>
{
  .sing
    и, И
    ері, Р
    ері, Д
    ір, В
    ір'ю, Т
    ері, П
    и, З
  .plur
    ері, И
    ерів, Р
    ерям, Д
    ерів, В
    ерями, Т
    ерях, П
    ері, З
}

.type жi <00022>
{
  .sing
    '', И
    і, Р
    і, Д
    '', В
    'ю, Т
    і, П
    е, З
  .plur
    і, И
    ей, Р
    ям, Д
    ей, В
    ями, Т
    ях, П
    і, З
}

.type жi <00023>
{
  .sing
    а-чужанина, И
    ої-чужанини, Р
    ій-чужанині, Д
    у-чужанину, В
    ою-чужаниною, Т
    ій-чужанині, П
    а-чужанино, З
}

.type жi <00024>
{
  .sing
    а-чужаниця, И
    ої-чужаниці, Р
    ій-чужаниці, Д
    у-чужаницю, В
    ою-чужаницею, Т
    ій-чужаниці, П
    а-чужанице, З
}

.type жi <00025>
{
  .sing
    га, И
    ги, Р
    зі, Д
    гу, В
    гою, Т
    зі, П
    го, З
  .plur
    ги, И
    гам, Д
    гами, Т
    гах, П
    ги, З
}

.type мн <00001>
{
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type мн <00002>
{
  .plur
    и, И
    ей, Р
    ям, Д
    и, В
    ьми, Т
    ями, Т
    ях, П
    и, З
}

.type мн <00003>
{
  .plur
    и, И
    '', Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type мн <00004>
{
  .plur
    а, И
    '', Р
    ам, Д
    и, В
    ами, Т
    ах, П
    а, З
}

.type мн <00005>
{
  .plur
    і, И
    ів, Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type мн <00006>, мнi <00005>
{
  .plur
    і, И
    ів, Р
    ам, Д
    ів, В
    ами, Т
    ах, П
    і, З
}

.type мн <00007>
{
  .plur
    і, И
    ей, Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type мн <00008>
{
  .plur
    і, И
    ь, Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type мн <00009>, мнi <00008>
{
  .plur
    ї, И
    їв, Р
    ям, Д
    їв, В
    ями, Т
    ях, П
    ї, З
}

.type мн <00010>
{
  .plur
    я, И
    '', Р
    ям, Д
    '', В
    ями, Т
    ях, П
    я, З
}

.type мн <00011>
{
  .plur
    и, И
    ей, Р
    ям, Д
    и, В
    ьми, Т
    ях, П
    и, З
}

.type мн <00012>
{
  .plur
    '', И
    '', Р
    '', Д
    '', В
    '', Т
    '', П
    '', З
}

.type мн <00013>
{
  .plur
    лі, И
    лів, Р
    ель, Р
    лям, Д
    лі, В
    лями, Т
    лях, П
    лі, З
}

.type мн <00014>
{
  .plur
    оші, И
    ошей, Р
    ошам, Д
    оші, В
    ошами, Т
    ошах, П
    оші, З
}

.type мн <00015>
{
  .plur
    и, И
    ів, Р
    '', Р
    кам, Д
    ки, В
    ками, Т
    ках, П
    ки, З
}

.type мн <00016>
{
  .plur
    івця, И
    овець, Р
    івець, Р
    івцям, Д
    івця, В
    івцями, Т
    івцях, П
    івця, З
}

.type мн <00017>
{
  .plur
    ки, И
    ок, Р
    ків, Р
    кам, Д
    ки, В
    ками, Т
    ках, П
    ки, З
}

.type мн <00018>
{
  .plur
    і, И
    ей, Р
    ам, Д
    і, В
    ами, Т
    ах, П
    і, З
}

.type мн <00019>
{
  .plur
    і, И
    '', Р
    ам, Д
    і, В
    ами, Т
    ах, П
    і, З
}

.type мн <00020>
{
  .plur
    ни, И
    нів, Р
    ін, Р
    нам, Д
    ни, В
    нами, Т
    нах, П
    ни, З
}

.type мн <00021>
{
  .plur
    а, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    а, З
}

.type мн <00022>
{
  .plur
    ї, И
    їв, Р
    ям, Д
    ї, В
    ями, Т
    ях, П
    ї, З
}

.type мн <00023>
{
  .plur
    ї, И
    й, Р
    їв, Р
    ям, Д
    ї, В
    ями, Т
    ях, П
    ї, З
}

.type мн <00024>
{
  .plur
    и, И
    ів, Р
    ям, Д
    ам, Д
    и, В
    ами, Т
    ьми, Т
    ями, Т
    ах, П
    ях, П
    и, З
}

.type мн_п <00001>
{
  .plur
    і, И
    их, Р
    им, Д
    і, В
    ими, Т
    их, П
}

.type мн_п <00002>
{
  .plur
    і, И
    их, Р
    им, Д
    их, В
    ими, Т
    их, П
}

.type мнi <00001>
{
  .plur
    и, И
    '', Р
    ам, Д
    '', В
    ами, Т
    ах, П
    и, З
}

.type мнi <00002>
{
  .plur
    и, И
    ів, Р
    ам, Д
    ів, В
    ами, Т
    ах, П
    и, З
}

.type мнi <00003>
{
  .plur
    і, И
    ів, Р
    ям, Д
    ів, В
    ями, Т
    ях, П
    і, З
}

.type мнi <00004>
{
  .plur
    ї, И
    й, Р
    ям, Д
    ї, В
    ями, Т
    ях, П
    ї, З
}

.type мнi <00006>
{
  .plur
    а, И
    '', Р
    ам, Д
    '', В
    ами, Т
    ах, П
    а, З
}

.type мнi <00007>
{
  .plur
    и, И
    ей, Р
    ям, Д
    ей, В
    ьми, Т
    ях, П
    и, З
}

.type с <00002>
{
  .sing
    я, И
    я, Р
    ю, Д
    я, В
    ям, Т
    і, П
    я, З
  .plur
    я, И
    ь, Р
    ям, Д
    я, В
    ями, Т
    ях, П
    я, З
}

.type с <00003>
{
  .sing
    о, И
    а, Р
    у, Д
    о, В
    ом, Т
    і, П
    о, З
  .plur
    а, И
    '', Р
    ам, Д
    а, В
    ами, Т
    ах, П
    а, З
}

.type с <00004>
{
  .sing
    о, И
    а, Р
    ові, Д
    у, Д
    о, В
    ом, Т
    у, П
    о, З
  .plur
    а, И
    '', Р
    ам, Д
    а, В
    ами, Т
    ах, П
    а, З
}

.type с <00005>
{
  .sing
    о, И
    а, Р
    у, Д
    о, В
    ом, Т
    і, П
    о, З
}

.type с <00006>, ч <00036>
{
  .sing
    о, И
    а, Р
    ові, Д
    у, Д
    о, В
    ом, Т
    і, П
    о, З
  .plur
    а, И
    '', Р
    ам, Д
    а, В
    ами, Т
    ах, П
    а, З
}

.type с <00007>
{
  .sing
    е, И
    ого, Р
    ому, Д
    е, В
    им, Т
    ому, П
    е, З
}

.type с <00008>
{
  .sing
    я, И
    я, Р
    ю, Д
    я, В
    ям, Т
    і, П
    я, З
}

.type с <00009>
{
  .sing
    є, И
    я, Р
    ю, Д
    єві, Д
    є, В
    єм, Т
    єві, П
    ю, П
    є, З
  .plur
    я, И
    й, Р
    ям, Д
    я, В
    ями, Т
    ях, П
    я, З
}

.type с <00010>, ч <00037>, ч/с <00002>
{
  .sing
    е, И
    а, Р
    еві, Д
    у, Д
    е, В
    ем, Т
    і, П
    е, З
  .plur
    а, И
    '', Р
    ам, Д
    а, В
    ами, Т
    ах, П
    а, З
}

.type с <00011>
{
  .sing
    я, И
    я, Р
    ю, Д
    я, В
    ям, Т
    і, П
    я, З
  .plur
    я, И
    ів, Р
    ям, Д
    я, В
    ями, Т
    ях, П
    я, З
}

.type с <00012>
{
  .sing
    'я, И
    ені, Р
    'я, Р
    ені, Д
    'я, В
    'ям, Т
    енем, Т
    ені, П
    'я, З
  .plur
    ена, И
    ен, Р
    енам, Д
    ена, В
    енами, Т
    енах, П
    ена, З
}

.type с <00013>, ч <00059>
{
  .sing
    о, И
    а, Р
    ові, Д
    у, Д
    о, В
    ом, Т
    і, П
    о, З
  .plur
    а, И
    ів, Р
    ам, Д
    а, В
    ами, Т
    ах, П
    а, З
}

.type с <00014>
{
  .sing
    е, И
    я, Р
    ю, Д
    е, В
    ем, Т
    і, П
    е, З
  .plur
    я, И
    ь, Р
    ям, Д
    я, В
    ями, Т
    ях, П
    я, З
}

.type с <00015>
{
  .sing
    е, И
    я, Р
    еві, Д
    ю, Д
    е, В
    ем, Т
    і, П
    е, З
  .plur
    я, И
    ів, Р
    ям, Д
    я, В
    ями, Т
    ях, П
    я, З
}

.type с <00016>
{
  .sing
    о, И
    а, Р
    ові, Д
    у, Д
    о, В
    ом, Т
    у, П
    о, З
  .plur
    а, И
    ів, Р
    ам, Д
    а, В
    ами, Т
    ах, П
    а, З
}

.type с <00017>
{
  .sing
    е, И
    ого, Р
    ому, Д
    е, В
    им, Т
    ому, П
    е, З
  .plur
    і, И
    их, Р
    им, Д
    і, В
    ими, Т
    их, П
    і, З
}

.type с <00018>
{
  .sing
    '', И
    ти, Р
    ті, Д
    '', В
    м, Т
    ті, П
    '', З
  .plur
    та, И
    т, Р
    там, Д
    та, В
    тами, Т
    тах, П
    та, З
}

.type с <00019>
{
  .sing
    е, И
    я, Р
    ю, Д
    е, В
    ем, Т
    і, П
    е, З
}

.type с <00020>
{
  .sing
    я, И
    я, Р
    ю, Д
    я, В
    ям, Т
    ї, П
    я, З
}

.type с <00021>
{
  .sing
    я, И
    я, Р
    ю, Д
    я, В
    ям, Т
    ї, П
    я, З
  .plur
    я, И
    їв, Р
    ям, Д
    я, В
    ями, Т
    ях, П
    я, З
}

.type с <00022>
{
  .sing
    я, И
    я, Р
    ю, Д
    я, В
    ям, Т
    і, П
    я, З
  .plur
    я, И
    '', Р
    ям, Д
    я, В
    ями, Т
    ях, П
    я, З
}

.type с <00023>
{
  .sing
    хо, И
    ха, Р
    хові, Д
    ху, Д
    хо, В
    хом, Т
    сі, П
    хо, З
  .plur
    ха, И
    х, Р
    хам, Д
    ха, В
    хами, Т
    хах, П
    ха, З
}

.type с <00024>
{
  .sing
    е, И
    а, Р
    у, Д
    еві, Д
    е, В
    ем, Т
    і, П
    е, З
  .plur
    і, И
    ей, Р
    ам, Д
    і, В
    има, Т
    ах, П
    і, З
}

.type с <00025>
{
  .sing
    но, И
    на, Р
    ну, Д
    но, В
    ном, Т
    ні, П
    но, З
  .plur
    ена, И
    ен, Р
    енам, Д
    ена, В
    енами, Т
    енах, П
    ена, З
}

.type с <00026>
{
  .sing
    о, И
    а, Р
    у, Д
    ові, Д
    о, В
    ом, Т
    і, П
    о, З
  .plur
    а, И
    '', Р
    ам, Д
    а, В
    ьми, Т
    ами, Т
    ах, П
    а, З
}

.type с <00027>
{
  .sing
    е, И
    а, Р
    у, Д
    еві, Д
    е, В
    ем, Т
    і, П
    е, З
}

.type с <00028>
{
  .sing
    'я, И
    'я, Р
    'ю, Д
    'я, В
    'ям, Т
    'ї, П
    'я, З
}

.type с <00029>
{
  .sing
    о, И
    а, Р
    ові, Д
    у, Д
    о, В
    ом, Т
    і, П
    о, З
  .plur
    еса, И
    ес, Р
    есам, Д
    еса, В
    есами, Т
    есах, П
    еса, З
}

.type с <00030>
{
  .sing
    ко, И
    ка, Р
    кові, Д
    ку, Д
    ко, В
    ком, Т
    ці, П
    ко, З
  .plur
    чі, И
    чей, Р
    чам, Д
    чі, В
    чима, Т
    чах, П
    чі, З
}

.type с <00031>
{
  .sing
    кло, И
    кла, Р
    клу, Д
    клові, Д
    кло, В
    клом, Т
    клі, П
    кло, З
  .plur
    текла, И
    текол, Р
    теклам, Д
    текла, В
    теклами, Т
    теклах, П
    текла, З
}

.type с <00032>
{
  .sing
    е, И
    а, Р
    у, Д
    еві, Д
    е, В
    ем, Т
    і, П
    е, З
  .plur
    і, И
    '', Р
    ам, Д
    і, В
    има, Т
    ах, П
    а, З
}

.type с <00033>
{
  .sing
    є, И
    ього, Р
    ьому, Д
    є, В
    ім, Т
    ьому, П
    є, З
  .plur
    і, И
    их, Р
    им, Д
    і, В
    ими, Т
    их, П
    і, З
}

.type с <00034>
{
  .sing
    'я, И
    ені, Р
    'я, Р
    ені, Д
    'ю, Д
    'я, В
    'ям, Т
    енем, Т
    'ї, П
    ені, П
    'я, З
}

.type сi <00001>
{
  .sing
    '', И
    ти, Р
    ті, Д
    '', В
    м, Т
    ті, П
    '', З
  .plur
    та, И
    т, Р
    там, Д
    т, В
    тами, Т
    тах, П
    та, З
}

.type сi <00002>
{
  .sing
    о, И
    а, Р
    у, Д
    ові, Д
    о, В
    ом, Т
    ові, П
    о, З
  .plur
    а, И
    '', Р
    ам, Д
    '', В
    ами, Т
    ах, П
    а, З
}

.type сi <00004>, чi <00004>, чi/сi <00002>
{
  .sing
    о, И
    а, Р
    ові, Д
    у, Д
    а, В
    ом, Т
    ові, П
    у, З
  .plur
    и, И
    ів, Р
    ам, Д
    ів, В
    ами, Т
    ах, П
    и, З
}

.type сi <00005>, чi <00017>, чi/жi <00004>, чi/сi <00001>
{
  .sing
    о, И
    а, Р
    ові, Д
    у, Д
    а, В
    ом, Т
    і, П
    о, З
  .plur
    а, И
    '', Р
    ам, Д
    '', В
    ами, Т
    ах, П
    а, З
}

.type ч <00001>
{
  .sing
    '', И
    у, Р
    у, Д
    ові, Д
    '', В
    ом, Т
    і, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00003>
{
  .sing
    ь, И
    ю, Р
    еві, Д
    ю, Д
    ь, В
    ем, Т
    і, П
    ю, З
  .plur
    і, И
    ів, Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type ч <00004>, ч/с <00003>
{
  .sing
    '', И
    а, Р
    у, Д
    ові, Д
    '', В
    ом, Т
    і, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00005>
{
  .sing
    й, И
    ю, Р
    єві, Д
    ю, Д
    й, В
    єм, Т
    ю, П
    ї, П
    ю, З
  .plur
    ї, И
    їв, Р
    ям, Д
    ї, В
    ями, Т
    ях, П
    ї, З
}

.type ч <00006>
{
  .sing
    '', И
    а, Р
    у, Д
    ові, Д
    '', В
    ом, Т
    у, П
    у, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00007>
{
  .sing
    '', И
    у, Р
    а, Р
    у, Д
    ові, Д
    '', В
    ом, Т
    і, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00008>
{
  .sing
    ь, И
    я, Р
    ю, Д
    еві, Д
    ь, В
    ем, Т
    і, П
    ю, З
  .plur
    і, И
    ів, Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type ч <00009>
{
  .sing
    '', И
    а, Р
    у, Д
    еві, Д
    '', В
    ем, Т
    і, П
    у, З
  .plur
    і, И
    ів, Р
    ам, Д
    і, В
    ами, Т
    ах, П
    і, З
}

.type ч <00010>
{
  .sing
    г, И
    гу, Р
    гу, Д
    гові, Д
    г, В
    гом, Т
    зі, П
    гу, З
  .plur
    ги, И
    гів, Р
    гам, Д
    ги, В
    гами, Т
    гах, П
    ги, З
}

.type ч <00011>
{
  .sing
    '', И
    у, Р
    у, Д
    ові, Д
    '', В
    ом, Т
    у, П
    у, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00011_рік>
{
  .sing
    ік, И
    оку, Р
    оку, Д
    окові, Д
    ік, В
    оком, Т
    оку, П
    оці, П
    оку, З
  .plur
    оки, И
    оків, Р
    оців, Р
    окам, Д
    оки, В
    оци, В
    оками, Т
    оках, П
    оки, З
    оці, З
}

.type ч <00012>
{
  .sing
    '', И
    у, Р
    еві, Д
    у, Д
    '', В
    ем, Т
    і, П
    у, З
  .plur
    і, И
    ів, Р
    ам, Д
    і, В
    ами, Т
    ах, П
    і, З
}

.type ч <00013>
{
  .sing
    '', И
    у, Р
    у, Д
    ові, Д
    '', В
    ом, Т
    у, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00014>
{
  .sing
    '', И
    у, Р
    у, Д
    ові, Д
    '', В
    ом, Т
    і, П
    е, З
}

.type ч <00015>
{
  .sing
    '', И
    я, Р
    ю, Д
    еві, Д
    '', В
    ем, Т
    і, П
    еві, П
    ю, З
  .plur
    і, И
    ів, Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type ч <00016>
{
  .sing
    '', И
    у, Р
    а, Р
    у, Д
    ові, Д
    '', В
    ом, Т
    у, П
    у, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00017>
{
  .sing
    '', И
    у, Р
    у, Д
    ові, Д
    '', В
    ом, Т
    у, П
    у, З
}

.type ч <00018>
{
  .sing
    '', И
    у, Р
    еві, Д
    у, Д
    '', В
    ем, Т
    і, П
    у, З
}

.type ч <00019>
{
  .sing
    г, И
    га, Р
    гові, Д
    гу, Д
    г, В
    гом, Т
    зі, П
    гу, П
    гу, З
  .plur
    ги, И
    гів, Р
    гам, Д
    ги, В
    гами, Т
    гах, П
    ги, З
}

.type ч <00020>
{
  .sing
    '', И
    а, Р
    ові, Д
    у, Д
    '', В
    ом, Т
    і, П
    е, З
}

.type ч <00021>
{
  .sing
    '', И
    ю, Р
    еві, Д
    ю, Д
    '', В
    ем, Т
    і, П
    ю, З
  .plur
    і, И
    ів, Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type ч <00022>
{
  .sing
    '', И
    а, Р
    ові, Д
    у, Д
    '', В
    ом, Т
    і, П
    е, З
  .plur
    а, И
    и, И
    ів, Р
    ам, Д
    а, В
    и, В
    ами, Т
    ах, П
    а, З
}

.type ч <00023>
{
  .sing
    ий, И
    ого, Р
    ому, Д
    ий, В
    им, Т
    ім, П
    ому, П
  .plur
    і, И
    их, Р
    им, Д
    і, В
    ими, Т
    их, П
}

.type ч <00024>
{
  .sing
    к, И
    ка, Р
    ку, Д
    кові, Д
    к, В
    ком, Т
    ці, П
    ку, П
    ку, З
  .plur
    ки, И
    ків, Р
    кам, Д
    ки, В
    ками, Т
    ках, П
    ки, З
}

.type ч <00025>
{
  .sing
    к, И
    ку, Р
    ку, Д
    кові, Д
    к, В
    ком, Т
    ці, П
    ку, З
  .plur
    ки, И
    ків, Р
    кам, Д
    ки, В
    ками, Т
    ках, П
    ки, З
}

.type ч <00026>
{
  .sing
    й, И
    я, Р
    ю, Д
    єві, Д
    й, В
    єм, Т
    ї, П
    ю, З
  .plur
    ї, И
    їв, Р
    ям, Д
    ї, В
    ями, Т
    ях, П
    ї, З
}

.type ч <00027>
{
  .sing
    г, И
    гу, Р
    гові, Д
    гу, Д
    г, В
    гом, Т
    зі, П
    гу, П
    гу, З
  .plur
    ги, И
    гів, Р
    гам, Д
    ги, В
    гами, Т
    гах, П
    ги, З
}

.type ч <00028>
{
  .sing
    к, И
    ку, Р
    кові, Д
    ку, Д
    к, В
    ком, Т
    ці, П
    ку, П
    ку, З
  .plur
    ки, И
    ків, Р
    кам, Д
    ки, В
    ками, Т
    ках, П
    ки, З
}

.type ч <00029>
{
  .sing
    ь, И
    ю, Р
    еві, Д
    ю, Д
    ь, В
    ем, Т
    і, П
    ю, З
}

.type ч <00030>
{
  .sing
    '', И
    а, Р
    у, Д
    еві, Д
    '', В
    ем, Т
    і, П
    у, З
}

.type ч <00031>
{
  .sing
    х, И
    ху, Р
    хові, Д
    ху, Д
    х, В
    ом, Т
    сі, П
    ху, П
    ху, З
  .plur
    хи, И
    хів, Р
    хам, Д
    хи, В
    хами, Т
    хах, П
    хи, З
}

.type ч <00032>
{
  .sing
    к, И
    ка, Р
    ку, Д
    кові, Д
    к, В
    ком, Т
    кові, П
    че, З
  .plur
    ки, И
    ків, Р
    кам, Д
    ки, В
    ками, Т
    ках, П
    ки, З
}

.type ч <00033>
{
  .sing
    к, И
    ка, Р
    ку, Р
    кові, Д
    ку, Д
    к, В
    ком, Т
    ці, П
    ку, П
    ку, З
  .plur
    ки, И
    ків, Р
    кам, Д
    ки, В
    ками, Т
    ках, П
    ки, З
}

.type ч <00034>
{
  .sing
    г, И
    га, Р
    гові, Д
    гу, Д
    г, В
    гом, Т
    зі, П
    гу, З
  .plur
    ги, И
    гів, Р
    гам, Д
    ги, В
    гами, Т
    гах, П
    ги, З
}

.type ч <00035>
{
  .sing
    '', И
    а, Р
    у, Д
    '', В
    ом, Т
    і, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00038>, чi <00024>
{
  .sing
    га, И
    ги, Р
    зі, Д
    гу, В
    гою, Т
    зі, П
    го, З
  .plur
    ги, И
    г, Р
    гам, Д
    г, В
    гами, Т
    гах, П
    ги, З
}

.type ч <00039>, чi <00023>
{
  .sing
    ка, И
    ки, Р
    ці, Д
    ку, В
    кою, Т
    ці, П
    ко, З
  .plur
    ки, И
    к, Р
    кам, Д
    к, В
    ками, Т
    ках, П
    ки, З
}

.type ч <00040>
{
  .sing
    о, И
    а, Р
    ові, Д
    у, Д
    о, В
    ом, Т
    і, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00041>
{
  .sing
    '', И
    у, Р
    а, Р
    у, Д
    ові, Д
    '', В
    ом, Т
    і, П
    у, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00042>
{
  .sing
    '', И
    а, Р
    ові, Д
    у, Д
    '', В
    ом, Т
    у, П
    у, З
}

.type ч <00043>
{
  .sing
    х, И
    ха, Р
    хові, Д
    ху, Д
    х, В
    ом, Т
    сі, П
    ху, З
  .plur
    хи, И
    хів, Р
    хам, Д
    хи, В
    хами, Т
    хах, П
    хи, З
}

.type ч <00044>
{
  .sing
    х, И
    ху, Р
    ху, Д
    хові, Д
    х, В
    хом, Т
    сі, П
    хові, П
    ху, З
  .plur
    хи, И
    хів, Р
    хам, Д
    хи, В
    хами, Т
    хах, П
    хи, З
}

.type ч <00045>
{
  .sing
    '', И
    а, Р
    у, Р
    ові, Д
    у, Д
    '', В
    ом, Т
    у, П
    у, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00046>
{
  .sing
    й, И
    ю, Р
    єві, Д
    ю, Д
    й, В
    єм, Т
    ю, П
    ї, П
    ю, З
}

.type ч <00047>
{
  .sing
    к, И
    ка, Р
    ку, Р
    кові, Д
    ку, Д
    к, В
    ком, Т
    ці, П
    ку, З
  .plur
    ки, И
    ків, Р
    кам, Д
    ки, В
    ками, Т
    ках, П
    ки, З
}

.type ч <00048>
{
  .sing
    х, И
    ху, Р
    ху, Д
    хові, Д
    х, В
    хом, Т
    сі, П
    ху, П
    ху, З
  .plur
    хи, И
    хів, Р
    хам, Д
    хи, В
    хами, Т
    хах, П
    хи, З
}

.type ч <00049>
{
  .sing
    ь, И
    я, Р
    ю, Р
    еві, Д
    ю, Д
    ь, В
    ем, Т
    і, П
    ю, З
  .plur
    і, И
    ів, Р
    ям, Д
    і, В
    ями, Т
    ях, П
    і, З
}

.type ч <00050>
{
  .sing
    '', И
    а, Р
    у, Д
    '', В
    им, Т
    і, П
    е, З
  .plur
    и, И
    их, Р
    им, Д
    и, В
    ими, Т
    их, П
    и, З
}

.type ч <00051>
{
  .sing
    '', И
    у, Р
    ові, Д
    у, Д
    '', В
    ом, Т
    у, П
    і, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00052>
{
  .sing
    іт, И
    ету, Р
    ьоту, Р
    ьоту, Д
    ету, Д
    ьотові, Д
    етові, Д
    іт, В
    етом, Т
    ьотом, Т
    ьоті, П
    еті, П
    ете, З
    ьоте, З
  .plur
    ьоти, И
    ети, И
    ьотів, Р
    етів, Р
    ьотам, Д
    етам, Д
    ети, В
    ьоти, В
    етами, Т
    ьотами, Т
    етах, П
    ьотах, П
    ети, З
    ьоти, З
}

.type ч <00053>
{
  .sing
    ок, И
    ку, Р
    ка, Р
    кові, Д
    ку, Д
    ка, В
    ком, Т
    ку, П
    кові, П
    у, З
  .plur
    ки, И
    ків, Р
    кам, Д
    ки, В
    ками, Т
    ках, П
    ки, З
}

.type ч <00054>
{
  .sing
    к, И
    ку, Р
    ку, Д
    кові, Д
    к, В
    ком, Т
    ці, П
    ку, З
}

.type ч <00055>
{
  .sing
    '', И
    у, Р
    ові, Д
    у, Д
    '', В
    ом, Т
    і, П
    е, З
  .plur
    а, И
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00056>
{
  .sing
    '', И
    а, Р
    ові, Д
    у, Д
    '', В
    ом, Т
    у, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00057>
{
  .sing
    х, И
    ху, Р
    ху, Д
    хові, Д
    х, В
    хом, Т
    сі, П
    ху, З
  .plur
    хи, И
    хів, Р
    хам, Д
    хи, В
    хами, Т
    хах, П
    хи, З
}

.type ч <00058>
{
  .sing
    '', И
    а, Р
    у, Д
    '', В
    ом, Т
    у, П
    е, З
}

.type ч <00060>
{
  .sing
    '', И
    у, Р
    ові, Д
    у, Д
    '', В
    ом, Т
    і, П
    е, З
  .plur
    и, И
    '', Р
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00061>
{
  .sing
    іг, И
    огу, Р
    ога, Р
    огу, Д
    огові, Д
    іг, В
    огом, Т
    озі, П
    огу, З
  .plur
    оги, И
    огів, Р
    огам, Д
    оги, В
    огами, Т
    огах, П
    оги, З
}

.type ч <00062>
{
  .sing
    й, И
    ю, Р
    я, Р
    ю, Д
    єві, Д
    й, В
    єм, Т
    ю, П
    ї, П
    ю, З
  .plur
    ї, И
    їв, Р
    ям, Д
    ї, В
    ями, Т
    ях, П
    ї, З
}

.type ч <00063>
{
  .sing
    г, И
    га, Р
    гові, Д
    гу, Д
    г, В
    гом, Т
    зі, П
    гу, З
}

.type ч <00064>
{
  .sing
    г, И
    гу, Р
    гу, Д
    гові, Д
    г, В
    гом, Т
    зі, П
    гу, З
}

.type ч <00065>
{
  .sing
    ь, И
    я, Р
    еві, Д
    я, Д
    ь, В
    ем, Т
    і, П
    ю, З
}

.type ч <00066>
{
  .sing
    іг, И
    ога, Р
    огові, Д
    огу, Д
    іг, В
    огом, Т
    озі, П
    огові, П
    оже, З
  .plur
    оги, И
    огів, Р
    огам, Д
    оги, В
    огами, Т
    огах, П
    оги, З
}

.type ч <00067>
{
  .sing
    ь, И
    я, Р
    ю, Д
    еві, Д
    ь, В
    ем, Т
    і, П
    ю, З
  .plur
    і, И
    ів, Р
    ям, Д
    ів, В
    ями, Т
    ях, П
    і, З
}

.type ч <00068>
{
  .sing
    '', И
    а, Р
    ові, Д
    у, Д
    '', В
    ом, Т
    у, П
    і, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00069>
{
  .sing
    '', И
    а, Р
    у, Д
    ові, Д
    '', В
    ом, Т
    і, П
    е, З
  .plur
    і, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type ч <00070>
{
  .sing
    іт, И
    ота, Р
    отові, Д
    оту, Д
    іт, В
    отом, Т
    оті, П
    оте, З
  .plur
    оти, И
    іт, Р
    отів, Р
    отям, Д
    отам, Д
    оти, В
    ітми, Т
    отами, Т
    отах, П
    отях, П
    оти, З
}

.type ч <00071>
{
  .sing
    '', И
    га, Р
    гу, Д
    гові, Д
    '', В
    гом, Т
    зі, П
    гу, З
  .plur
    ги, И
    гів, Р
    гам, Д
    ги, В
    гами, Т
    гах, П
    ги, З
}

.type чi <00001>
{
  .sing
    '', И
    а, Р
    ові, Д
    у, Д
    а, В
    ом, Т
    ові, П
    і, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    ів, В
    ами, Т
    ах, П
    и, З
}

.type чi <00002>
{
  .sing
    ь, И
    я, Р
    ю, Д
    еві, Д
    я, В
    ем, Т
    еві, П
    і, П
    ю, З
  .plur
    і, И
    ів, Р
    ям, Д
    ів, В
    ями, Т
    ях, П
    і, З
}

.type чi <00003>
{
  .sing
    '', И
    а, Р
    ові, Д
    у, Д
    а, В
    ом, Т
    ові, П
    у, П
    у, З
  .plur
    и, И
    ів, Р
    ам, Д
    ів, В
    ами, Т
    ах, П
    и, З
}

.type чi <00005>
{
  .sing
    '', И
    я, Р
    ю, Д
    еві, Д
    я, В
    ем, Т
    і, П
    еві, П
    ю, З
  .plur
    і, И
    ів, Р
    ям, Д
    ів, В
    ями, Т
    ях, П
    і, З
}

.type чi <00006>
{
  .sing
    й, И
    я, Р
    єві, Д
    ю, Д
    я, В
    єм, Т
    ї, П
    єві, П
    ю, П
    ю, З
  .plur
    ї, И
    їв, Р
    ям, Д
    їв, В
    ями, Т
    ях, П
    ї, З
}

.type чi <00007>
{
  .sing
    ин, И
    ина, Р
    инові, Д
    ину, Д
    ина, В
    ином, Т
    ині, П
    инові, П
    ине, З
  .plur
    и, И
    '', Р
    ам, Д
    '', В
    ами, Т
    ах, П
    и, З
}

.type чi <00008>
{
  .sing
    '', И
    у, Р
    а, Р
    у, Д
    ові, Д
    '', В
    а, В
    ом, Т
    і, П
    ові, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    ів, В
    и, В
    ами, Т
    ах, П
    и, З
}

.type чi <00009>
{
  .sing
    '', И
    а, Р
    еві, Д
    у, Д
    а, В
    ем, Т
    і, П
    еві, П
    у, З
  .plur
    і, И
    ів, Р
    ам, Д
    ів, В
    ами, Т
    ах, П
    і, З
}

.type чi <00011>
{
  .sing
    ий, И
    ого, Р
    ому, Д
    ого, В
    им, Т
    ім, П
    ому, П
  .plur
    і, И
    их, Р
    им, Д
    их, В
    ими, Т
    их, П
}

.type чi <00012>
{
  .sing
    к, И
    ка, Р
    ку, Д
    кові, Д
    ка, В
    ком, Т
    кові, П
    че, З
  .plur
    ки, И
    ків, Р
    кам, Д
    ків, В
    ками, Т
    ках, П
    ки, З
}

.type чi <00013>
{
  .sing
    іг, И
    ога, Р
    огові, Д
    огу, Д
    ога, В
    огом, Т
    озі, П
    огові, П
    оже, З
  .plur
    оги, И
    огів, Р
    огам, Д
    огів, В
    огами, Т
    огах, П
    оги, З
}

.type чi <00015>
{
  .sing
    '', И
    а, Р
    ові, Д
    у, Д
    '', В
    ом, Т
    ові, П
    і, П
    е, З
  .plur
    и, И
    ів, Р
    ам, Д
    ів, В
    ами, Т
    ах, П
    и, З
}

.type чi <00016>
{
  .sing
    '', И
    а, Р
    еві, Д
    у, Д
    '', В
    ем, Т
    і, П
    е, З
  .plur
    і, И
    ів, Р
    ам, Д
    ів, В
    ами, Т
    ах, П
    і, З
}

.type чi <00018>
{
  .sing
    ьо, И
    я, Р
    ю, Д
    я, В
    ем, Т
    еві, П
    ю, З
  .plur
    і, И
    ів, Р
    ям, Д
    ів, В
    ями, Т
    ях, П
    і, З
}

.type чi <00019>
{
  .sing
    г, И
    га, Р
    гу, Д
    гові, Д
    га, В
    гом, Т
    гові, П
    же, З
  .plur
    ги, И
    гів, Р
    гам, Д
    гів, В
    гами, Т
    гах, П
    ги, З
}

.type чi <00025>
{
  .sing
    х, И
    ха, Р
    ху, Д
    хові, Д
    ха, В
    хом, Т
    хові, П
    ше, З
  .plur
    хи, И
    хів, Р
    хам, Д
    хів, В
    хами, Т
    хах, П
    хи, З
}

.type чi <00028>
{
  .sing
    г, И
    га, Р
    гу, Д
    гові, Д
    га, В
    гом, Т
    гові, П
    же, З
  .plur
    зі, И
    зів, Р
    зям, Д
    зів, В
    зями, Т
    зях, П
    зі, З
}

.type чi <00029>
{
  .sing
    нець, И
    енця, Р
    енцю, Д
    енцеві, Д
    енця, В
    енцем, Т
    енці, П
    енцеві, П
    енче, З
  .plur
    енці, И
    енців, Р
    енцям, Д
    енців, В
    енцями, Т
    енцях, П
    енці, З
}

.type чi <00030>
{
  .sing
    рець, И
    ерця, Р
    ерцю, Д
    ерцеві, Д
    ерця, В
    ерцем, Т
    ерці, П
    ерцеві, П
    ерче, З
  .plur
    ерці, И
    ерців, Р
    ерцям, Д
    ерців, В
    ерцями, Т
    ерцях, П
    ерці, З
}

.type чi <00031>
{
  .sing
    ова, И
    ови, Р
    ові, Д
    ову, В
    овою, Т
    ові, П
    ово, З
  .plur
    ови, И
    ів, Р
    овам, Д
    ів, В
    овами, Т
    овах, П
    ови, З
}

.type чi <00032>
{
  .sing
    '', И
    а, Р
    у, Д
    ові, Д
    '', В
    ом, Т
    ові, П
    і, П
    е, З
  .plur
    і, И
    ів, Р
    ам, Д
    ів, В
    ами, Т
    ах, П
    и, З
}

.type чi <00033>
{
  .sing
    к, И
    ка, Р
    ку, Д
    кові, Д
    ка, В
    ком, Т
    ку, П
    кові, П
    ку, З
    че, З
  .plur
    ки, И
    ків, Р
    кам, Д
    ків, В
    ками, Т
    ках, П
    ки, З
}

.type чi <00034>
{
  .sing
    '', И
    а, Р
    у, Д
    ові, Д
    '', В
    ом, Т
    ем, Т
    і, П
    ові, П
    е, З
  .plur
    і, И
    и, И
    ів, Р
    ам, Д
    и, В
    ами, Т
    ах, П
    и, З
}

.type чi <00035>
{
  .sing
    '', И
    а, Р
    у, Д
    ові, Д
    '', В
    ом, Т
    ові, П
    і, П
    е, З
  .plur
    и, И
    ів, Р
    '', Р
    ам, Д
    ів, В
    '', В
    ами, Т
    ах, П
    и, З
}

.type чi <00036>
{
  .sing
    ка, И
    ки, Р
    ці, Д
    ку, В
    кою, Т
    ці, П
    ко, З
  .plur
    ки, И
    ок, Р
    кам, Д
    ок, В
    ками, Т
    ках, П
    ки, З
}

.type чi <00037>
{
  .sing
    їн, И
    їна, Р
    їнові, Д
    їну, Д
    їна, В
    їном, Т
    їнові, П
    їні, П
    їне, З
  .plur
    їни, И
    ї, И
    їнів, Р
    їв, Р
    ям, Д
    їнам, Д
    їнів, В
    їв, В
    ями, Т
    їнами, Т
    їнах, П
    ях, П
    ї, З
    їни, З
}

.type чi <00038>
{
  .sing
    вець, И
    евця, Р
    евцю, Д
    евцеві, Д
    евця, В
    евцем, Т
    евцеві, П
    евці, П
    евче, З
  .plur
    евці, И
    евців, Р
    евцям, Д
    евців, В
    евцями, Т
    евцях, П
    евці, З
}

.type чi/сi <00004>
{
  .sing
    о, И
    а, Р
    еві, Д
    у, Д
    о, В
    ем, Т
    і, П
    е, З
  .plur
    а, И
    '', Р
    ам, Д
    а, В
    ами, Т
    ах, П
    а, З
}

