.type з <00001>
{
  .sing
    що, И
    чого, Р
    чому, Д
    чого, В
    чим, Т
    чому, П
    чім, П
}

.type з <00002>
{
  .sing
    хто, И
    кого, Р
    кому, Д
    кого, В
    ким, Т
    кому, П
    кім, П
}

.type з <00003>
{
  .sing
    я, И
    мене, Р
    мені, Д
    мене, В
    мною, Т
    мені, П
}

.type з <00004>
{
  .sing
    ми, И
    нас, Р
    нам, Д
    нас, В
    нами, Т
    нас, П
}

.type з <00005>
{
  .sing
    вони, И
    їх, Р
    них, Р
    їм, Д
    них, В
    їх, В
    ними, Т
    них, П
}

.type з <00006>
{
  .sing
    воно, И
    його, Р
    нього, Р
    йому, Д
    нього, В
    його, В
    ним, Т
    ньому, П
}

.type з <00007>
{
  .sing
    вона, И
    її, Р
    неї, Р
    їй, Д
    неї, В
    її, В
    нею, Т
    ній, П
}

.type з <00008>
{
  .sing
    він, И
    його, Р
    нього, Р
    йому, Д
    нього, В
    його, В
    ним, Т
    ньому, П
}

.type з <00009>
{
  .sing
    и, И
    ох, Р
    ом, Д
    и, В
    ох, В
    ома, Т
    ох, П
}

.type з <00010>
{
  .sing
    и, И
    ебе, Р
    обі, Д
    ебе, В
    обою, Т
    обі, П
}

.type зп <00001>, п <00001>, числ_п <00001>
{
  .sing
  .msc
    ий, И
    ого, Р
    ому, Д
    ий, Вн
    ого, Во
    им, Т
    ому, П
    ім, П
  .fem
    а, И
    ої, Р
    ій, Д
    у, В
    ою, Т
    ій, П
  .nwt
    е, И
    ого, Р
    ому, Д
    им, Т
    ім, П
    ому, П
  .plur
    і, И
    их, Р
    им, Д
    і, Вн
    их, Во
    ими, Т
    их, П
}

.type зп <00002>, п <00023>
{
  .sing
  .msc
    й, И
    його, Р
    єму, Д
    йому, Д
    й, Вн
    його, Во
    їм, Т
    йому, П
    їм, П
  .fem
    я, И
    єї, Р
    їй, Д
    ю, В
    єю, Т
    їй, П
  .nwt
    є, И
    його, Р
    йому, Д
    їм, Т
    єму, П
    їм, П
    йому, П
  .plur
    ї, И
    їх, Р
    їм, Д
    ї, Вн
    їх, Во
    їми, Т
    їх, П
}

.type зп <00003>, п <00004>, числ_п <00002>
{
  .sing
  .msc
    ій, И
    ього, Р
    ьому, Д
    ій, Вн
    ього, Во
    ім, Т
    ьому, П
    ім, П
  .fem
    я, И
    ьої, Р
    ій, Д
    ю, В
    ьою, Т
    ій, П
  .nwt
    є, И
    ього, Р
    ьому, Д
    ім, Т
    ім, П
    ьому, П
  .plur
    і, И
    іх, Р
    ім, Д
    і, Вн
    іх, Во
    іми, Т
    іх, П
}

.type зп <00004>
{
  .sing
  .msc
    ввесь, И
    весь, И
    увесь, И
    всього, Р
    всьому, Д
    весь, Вн
    всього, Во
    всім, Т
    всьому, П
    всім, П
  .fem
    вся, И
    всієї, Р
    всій, Д
    всю, В
    всією, Т
    всій, П
  .nwt
    все, И
    усе, И
    всього, Р
    усього, Р
    йому, Д
    всім, Т
    всьому, П
    всім, П
  .plur
    всі, И
    усі, И
    усіх, Р
    всіх, Р
    усім, Д
    всім, Д
    всі, Вн
    всіх, Во
    всіма, Т
    усіма, Т
    всіх, П
    усіх, П
}

.type зп <00005>
{
  .sing
  .msc
    '', И
    ого, Р
    ому, Д
    '', Вн
    ого, Во
    им, Т
    ому, П
    ім, П
  .fem
    а, И
    ої, Р
    ій, Д
    у, В
    ою, Т
    их, П
  .nwt
    е, И
    ого, Р
    ому, Д
    им, Т
    ім, П
    ому, П
  .plur
    і, И
    их, Р
    им, Д
    і, Вн
    их, Во
    ими, Т
    их, П
}

.type зп <00006>, п <00007>
{
  .sing
  .msc
    '', И
    ого, Р
    ому, Д
    '', Вн
    ого, Во
    им, Т
    ому, П
    ім, П
  .fem
    а, И
    ої, Р
    ій, Д
    у, В
    ою, Т
    ій, П
  .nwt
    е, И
    ого, Р
    ому, Д
    им, Т
    ім, П
    ому, П
  .plur
    і, И
    их, Р
    им, Д
    і, Вн
    их, Во
    ими, Т
    их, П
}

.type зп <00007>
{
  .sing
  .msc
    ій, И
    ого, Р
    оєму, Д
    ою, Вн
    ою, Во
    оїм, Т
    оєму, П
    оїм, П
  .fem
    оя, И
    оєї, Р
    оїй, Д
    ою, В
    оєю, Т
    оїх, П
  .nwt
    оє, И
    ого, Р
    оєму, Д
    оїм, Т
    оїм, П
    оєму, П
  .plur
    ої, И
    оїх, Р
    оїм, Д
    оїх, В
    оїх, Вн
    оїх, Во
    оїми, Т
    оїх, П
}

.type зп <00008>
{
  .sing
  .msc
    ей, И
    ього, Р
    ьому, Д
    ей, Вн
    ього, Во
    им, Т
    ім, П
    ьому, П
  .fem
    я, И
    ієї, Р
    ій, Д
    ю, В
    ією, Т
    ій, П
  .nwt
    е, И
    ього, Р
    ьому, Д
    им, Т
    ьому, П
    ім, П
  .plur
    і, И
    их, Р
    им, Д
    их, Вн
    і, Во
    ими, Т
    их, П
}

.type зп <00009>
{
  .sing
  .msc
    ой, И
    ого, Р
    ому, Д
    ой, Вн
    ого, Во
    им, Т
    ому, П
    ім, П
  .fem
    а, И
    ієї, Р
    ій, Д
    у, В
    ією, Т
    ій, П
  .nwt
    е, И
    ого, Р
    ому, Д
    им, Т
    ім, П
    ому, П
  .plur
    і, И
    их, Р
    им, Д
    их, Вн
    і, Во
    ими, Т
    их, П
}

