//**************************************************************************
//*     Прилагательные, изменяющиеся по схеме местоименного склонения.     *
//**************************************************************************

.тип мс 2*a
//--------------------------------------------------------------------------
// Пример: слово господень
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ень, И              // господ-ень
    ня, Р               // господ-ня
    ню, Д               // господ-ню
    ень, Вн             // господ-ень
    ня, Во              // господ-ня
    ним, Т              // господ-ним
    нем, П              // господ-нем
  .род ж
    ня, И               // господ-ня
    ней, Р              // господ-ней
    ней, Д              // господ-ней
    ню, В               // господ-ню
    ней, Т              // господ-ней
    ней, П              // господ-ней
  .род с
    не, И               // господ-не
    ня, Р               // господ-ня
    ню, Д               // господ-ню
    не, В               // господ-не
    ним, Т              // господ-ним
    нем, П              // господ-нем
  .число М
  .род
    ни, И               // господ-ни
    них, Р              // господ-них
    ним, Д              // господ-ним
    ни, Вн              // господ-ни
    них, Во             // господ-них
    ними, Т             // господ-ними
    них, П              // господ-них
}

