//**************************************************************************
//                       Описание склонения местоимений
// этот
// тот
// один
// сам
// сей
// весь
// наш
// ваш
// кой
// никой
// мой
// твой
// свой
// чей
// ничей
// он
// она
// оно
// они
// я - мы
// ты -вы
// себя
// кто
// что
// каков
// таков
// его
//**************************************************************************

.тип мс-п 1a
//==========================================================================
// Склонение местоимения "этот"
//==========================================================================
{
  .число Е
  .род м
    от, И
    ого, Р
    ому, Д
    ого, Во
    от, Вн
    им, Т
    ом, П
  .род с
    о, И
    ого, Р
    ому, Д
    о, В
    им, Т
    ом, П
  .род ж
    а, И
    ой, Р
    ой, Д
    у, В
    ой, Т
    ою, Т
    ой, П
  .число М
  .род
    и, И
    их, Р
    им, Д
    их, Во
    и, Вн
    ими, Т
    их, П
}

.тип мс-п 1b
//==========================================================================
// Склонение местоимения "тот"
//==========================================================================
{
  .число Е
  .род м
    от, И
    ого, Р
    ому, Д
    ого, Во
    от, Вн
    ем, Т
    ом, П
  .род с
    о, И
    ого, Р
    ому, Д
    о, В
    ем, Т
    ом, П
  .род ж
    а, И
    ой, Р
    ой, Д
    у, В
    ой, Т
    ою, Т
    ой, П
  .число М
  .род
    е, И
    ех, Р
    ем, Д
    ех, Во
    е, Вн
    еми, Т
    ех, П
}

.тип мс-п 1*b
//==========================================================================
// Склонение местоимения "один"
//==========================================================================
{
  .число Е
  .род м
    ин, И
    ного, Р
    ному, Д
    ного, Во
    ин, Вн
    ним, Т
    ном, П
  .род с
    но, И
    ного, Р
    ному, Д
    но, В
    ним, Т
    ном, П
  .род ж
    на, И
    ной, Р
    ной, Д
    ну, В
    ной, Т
    ною, Т
    ной, П
  .число М
  .род
    ни, И
    них, Р
    ним, Д
    них, Во
    ни, Вн
    ними, Т
    них, П
}

.тип мс-п 1f
//==========================================================================
// Склонение местоимения "сам"
//==========================================================================
{
  .число Е
  .род м
    '', И
    ого, Р
    ому, Д
    ого, Во
    '', Вн
    им, Т
    ом, П
  .род с
    о, И
    ого, Р
    ому, Д
    о, В
    им, Т
    ом, П
  .род ж
    а, И
    ой, Р
    ой, Д
    у, В
    ой, Т
    ою, Т
    ой, П
  .число М
  .род
    и, И
    их, Р
    им, Д
    их, Во
    и, Вн
    ими, Т
    их, П
}

.тип мс-п 2b
//==========================================================================
// Склонение местоимения "сей"
//==========================================================================
{
  .число Е
  .род м
    ей, И
    его, Р
    ему, Д
    его, Во
    ей, Вн
    им, Т
    ем, П
  .род с
    ие, И
    его, Р
    ему, Д
    ие, В
    им, Т
    ем, П
  .род ж
    ия, И
    ей, Р
    ей, Д
    ию, В
    ей, Т
    ею, Т
    ей, П
  .число М
  .род
    ии, И
    их, Р
    им, Д
    их, Во
    ии, Вн
    ими, Т
    их, П
}

.тип мс-п 2*b
//==========================================================================
// Склонение местоимения "весь"
//==========================================================================
{
  .число Е
  .род м
    есь, И
    сего, Р
    сему, Д
    сего, Во
    есь, Вн
    сем, Т
    сем, П
  .род с
    се, И
    сего, Р
    сему, Д
    се, В
    сем, Т
    сем, П
  .род ж
    ся, И
    сей, Р
    сей, Д
    сю, В
    сей, Т
    сею, Т
    сей, П
  .число М
  .род
    се, И
    сех, Р
    сем, Д
    сех, Во
    се, Вн
    семи, Т
    сех, П
}

.тип мс-п 4a
//==========================================================================
// Склонение местоимений "наш" и "ваш"
//==========================================================================
{
  .число Е
  .род м
    '', И
    его, Р
    ему, Д
    его, Во
    '', Вн
    им, Т
    ем, П
  .род с
    е, И
    его, Р
    ему, Д
    е, В
    им, Т
    ем, П
  .род ж
    а, И
    ей, Р
    ей, Д
    у, В
    ей, Т
    ею, Т
    ей, П
  .число М
  .род
    и, И
    их, Р
    им, Д
    их, Во
    и, Вн
    ими, Т
    их, П
}

.тип мс-п 6a
//==========================================================================
// Склонение местоимений "кой" и "никой"
//==========================================================================
{
  .число Е
  .род м
    й, И
    его, Р
    ему, Д
    его, Во
    й, Вн
    им, Т
    ем, П
  .род с
    е, И
    его, Р
    ему, Д
    е, В
    им, Т
    ем, П
  .род ж
    я, И
    ей, Р
    ей, Д
    ю, В
    ей, Т
    ею, Т
    ей, П
  .число М
  .род
    и, И
    их, Р
    им, Д
    их, Во
    и, Вн
    ими, Т
    их, П
}

.тип мс-п 6b
//==========================================================================
// Склонение местоимений "мой", "твой" и "свой"
//==========================================================================
{
  .число Е
  .род м
    й, И
    его, Р
    ему, Д
    его, Во
    й, Вн
    им, Т
    ем, П
  .род с
    е, И
    его, Р
    ему, Д
    е, В
    им, Т
    ем, П
  .род ж
    я, И
    ей, Р
    ей, Д
    ю, В
    ей, Т
    ею, Т
    ей, П
  .число М
  .род
    и, И
    их, Р
    им, Д
    их, Во
    и, Вн
    ими, Т
    их, П
}

.тип мс-п 6*b
//==========================================================================
// Склонение местоимений "чей" и "ничй"
//==========================================================================
{
  .число Е
  .род м
    ей, И
    ьего, Р
    ьему, Д
    ьего, Во
    ей, Вн
    ьим, Т
    ьем, П
  .род с
    ье, И
    ьего, Р
    ьему, Д
    ье, В
    ьим, Т
    ьем, П
  .род ж
    ья, И
    ьей, Р
    ьей, Д
    ью, В
    ьей, Т
    ьею, Т
    ьей, П
  .число М
  .род
    ьи, И
    ьих, Р
    ьим, Д
    ьих, Во
    ьи, Вн
    ьими, Т
    ьих, П
}

.тип мс-п E1
//==========================================================================
// Склонение местоимений "[кт]аков"
//==========================================================================
{
  .число Е
  .род м
    '', кф
  .род с
    о, кф
  .род ж
    а, кф
  .число М
  .род
    ы, кф
}

.тип мсм 1
//==========================================================================
// Склонение местоимения "он"
//==========================================================================
{
  .число Е
    он, И
    его, Р
    него, Р
    ему, Д
    нему, Д
    его, В
    него, В
    им, Т
    ним, Т
    нем, П
}

.тип мсж 1
//==========================================================================
// Склонение местоимения "она"
//==========================================================================
{
  .число Е
    она, И
    ее, Р
    нее, Р
    ей, Д
    ней, Д
    ее, В
    нее, В
    ей, Т
    ею, Т
    ней, Т
    нею, Т
    ней, П
}

.тип мсс 1
//==========================================================================
// Склонение местоимения "оно"
//==========================================================================
{
  .число Е
    оно, И
    его, Р
    него, Р
    ему, Д
    нему, Д
    его, В
    него, В
    им, Т
    ним, Т
    нем, П
}

.тип мсс 2
//==========================================================================
// Склонение местоимения "это"
//==========================================================================
{
  .число Е
    о, И
    ого, Р
    ому, Д
    о, В
    им, Т
    ом, П
}

.тип мсс 3
//==========================================================================
// Склонение местоимения "сие"
//==========================================================================
{
  .число Е
    ие, И
    его, Р
    ему, Д
    ие, В
    им, Т
    ем, П
}

.тип мсс 4
//==========================================================================
// Склонение местоимения "все:"
//==========================================================================
{
  .число Е
    е, И
    его, Р
    ему, Д
    е, В
    ем, Т
    ем, П
}

.тип мсс 5
//==========================================================================
// Склонение местоимения "то"
//==========================================================================
{
  .число Е
    о, И
    ого, Р
    ому, Д
    о, В
    ем, Т
    ом, П
}

.тип мс_мн. 1
//==========================================================================
// Склонение местоимения "они"
//==========================================================================
{
  .число М
    они, И
    их, Р
    них, Р
    им, Д
    ним, Д
    их, В
    них, В
    ими, Т
    ними, Т
    них, П
}

.тип мс_мн. 2
//==========================================================================
// Склонение местоимения "все"
//==========================================================================
{
  .число М
    е, И
    ех, Р
    ем, Д
    ех, В
    еми, Т
    ех, П
}

.тип мс 1
//==========================================================================
// Склонение местоимения "я"
//==========================================================================
{
  .число Е
    я, И
    меня, Р
    мне, Д
    меня, В
    мной, Т
    мною, Т
    мне, П
  .число М
    мы, И
    нас, Р
    нам, Д
    нас, В
    нами, Т
    нас, П
}

.тип мс 2
//==========================================================================
// Склонение местоимения "ты"
//==========================================================================
{
  .число Е
    ты, И
    тебя, Р
    тебе, Д
    тебя, В
    тобой, Т
    тобою, Т
    тебе, П
  .число М
    вы, И
    вас, Р
    вам, Д
    вас, В
    вами, Т
    вас, П
}

.тип мс 3
//==========================================================================
// Склонение местоимения "кто"
//==========================================================================
{
  .число Е
    то, И
    ого, Р
    ому, Д
    ого, В
    ем, Т
    ом, П
}

.тип мс 4
//==========================================================================
// Склонение местоимения "что"
//==========================================================================
{
  .число Е
    то, И
    его, Р
    ему, Д
    то, В
    ем, Т
    ем, П
}

.тип мс 5
//==========================================================================
// Склонение местоимения "никто"
//==========================================================================
{
  .число Е
    то, И
    ого, Р
    ому, Д
    ого, В
    ем, Т
}

.тип мс 6
//==========================================================================
// Склонение местоимения "ничто"
//==========================================================================
{
  .число Е
    то, И
    его, Р
    ему, Д
    то, В
    ем, Т
}

.тип мс 7
//==========================================================================
// Склонение местоимения "себя"
//==========================================================================
{
  .число Е
    ебя, Р
    ебе, Д
    ебя, В
    обой, Т
    обою, Т
    ебе, П
}

