//**************************************************************************
//*        Местоименные прилагательные и порядковые числительные           *
//*             Pronouns, changed just like the adjectives                 *
//**************************************************************************

.тип мсп 1a
//--------------------------------------------------------------------------
// Пример: самый
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ый, И               // сам-ый
    ого, Р              // сам-ого
    ому, Д              // сам-ому
    ый, Вн              // сам-ый
    ого, Во             // сам-ого
    ым, Т               // сам-ым
    ом, П               // сам-ом
  .род ж
    ая, И               // сам-ая
    ой, Р               // сам-ой
    ой, Д               // сам-ой
    ую, В               // сам-ую
    ой, Т               // сам-ой
    ою, Т               // сам-ою
    ой, П               // сам-ой
  .род с
    ое, И               // сам-ое
    ого, Р              // сам-ого
    ому, Д              // сам-ому
    ое, В               // сам-ое
    ым, Т               // сам-ым
    ом, П               // сам-ом
  .род
  .число М
    ые, И               // сам-ые
    ых, Р               // сам-ых
    ым, Д               // сам-ым
    ые, Вн              // сам-ые
    ых, Во              // сам-ых
    ыми, Т              // сам-ыми
    ых, П               // сам-ых
}

.тип мсп 1b
//--------------------------------------------------------------------------
// Пример: каковой
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ой, И               // каков-ой
    ого, Р              // каков-ого
    ому, Д              // каков-ому
    ой, Вн              // каков-ой
    ого, Во             // каков-ого
    ым, Т               // каков-ым
    ом, П               // каков-ом
  .род ж
    ая, И               // каков-ая
    ой, Р               // каков-ой
    ой, Д               // каков-ой
    ую, В               // каков-ую
    ой, Т               // каков-ой
    ою, Т               // каков-ою
    ой, П               // каков-ой
  .род с
    ое, И               // каков-ое
    ого, Р              // каков-ого
    ому, Д              // каков-ому
    ое, В               // каков-ое
    ым, Т               // каков-ым
    ом, П               // каков-ом
  .род
  .число М
    ые, И               // каков-ые
    ых, Р               // каков-ых
    ым, Д               // каков-ым
    ые, Вн              // каков-ые
    ых, Во              // каков-ых
    ыми, Т              // каков-ыми
    ых, П               // каков-ых
}

.тип мсп 2a
//--------------------------------------------------------------------------
// Пример: ихний
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // ихн-ий
    его, Р              // ихн-его
    ему, Д              // ихн-ему
    ий, Вн              // ихн-ий
    его, Во             // ихн-его
    им, Т               // ихн-им
    ем, П               // ихн-ем
  .род ж
    яя, И               // ихн-яя
    ей, Р               // ихн-ей
    ей, Д               // ихн-ей
    юю, В               // ихн-юю
    ей, Т               // ихн-ей
    ею, Т               // ихн-ею
    ей, П               // ихн-ей
  .род с
    ее, И               // ихн-ее
    его, Р              // ихн-его
    ему, Д              // ихн-ему
    ее, В               // ихн-ее
    им, Т               // ихн-им
    ем, П               // ихн-ем
  .род
  .число М
    ие, И               // ихн-ие
    их, Р               // ихн-их
    им, Д               // ихн-им
    ие, Вн              // ихн-ие
    их, Во              // ихн-их
    ими, Т              // ихн-ими
    их, П               // ихн-их
}

.тип мсп 3a
//--------------------------------------------------------------------------
// Пример: всякий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // всяк-ий
    ого, Р              // всяк-ого
    ому, Д              // всяк-ому
    ий, Вн              // всяк-ий
    ого, Во             // всяк-ого
    им, Т               // всяк-им
    ом, П               // о всяк-ом
  .род ж
    ая, И               // всяк-ая
    ой, Р               // всяк-ой
    ой, Д               // всяк-ой
    ую, В               // всяк-ую
    ой, Т               // всяк-ой
    ою, Т               // всяк-ою
    ой, П               // всяк-ой
  .род с
    ое, И               // всяк-ое
    ого, Р              // всяк-ого
    ому, Д              // всяк-ому
    ое, В               // всяк-ое
    им, Т               // всяк-им
    ом, П               // всяк-ом
  .род
  .число М
    ие, И               // всяк-ие
    их, Р               // всяк-их
    им, Д               // всяк-им
    ие, Вн              // всяк-ие
    их, Во              // всяк-их
    ими, Т              // всяк-ими
    их, П               // всяк-их
}

.тип мсп 3aE1
//--------------------------------------------------------------------------
// Пример: экий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // эк-ий
    ого, Р              // эк-ого
    оего, Р             // эк-оего
    ому, Д              // эк-ому
    ий, Вн              // эк-ий
    ого, Во             // эк-ого
    оего, Во            // эк-оего
    им, Т               // эк-им
    ом, П               // эк-ом
  .род ж
    ая, И               // эк-ая
    ой, Р               // эк-ой
    ой, Д               // эк-ой
    ую, В               // эк-ую
    ой, Т               // эк-ой
    ою, Т               // эк-ою
    ой, П               // эк-ой
  .род с
    ое, И               // эк-ое
    ого, Р              // эк-ого
    оего, Р             // эк-оего
    ому, Д              // эк-ому
    ое, В               // эк-ое
    им, Т               // эк-им
    ом, П               // эк-ом
  .род
  .число М
    ие, И               // эк-ие
    их, Р               // эк-их
    им, Д               // эк-им
    ие, Вн              // эк-ие
    их, Во              // эк-их
    ими, Т              // эк-ими
    их, П               // эк-их
}

.тип мсп 3aE2
//--------------------------------------------------------------------------
// Пример: некий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // нек-ий
    оего, Р             // нек-оего
    оему, Д             // нек-оему
    ий, Вн              // нек-ий
    оего, Во            // нек-оего
    им, Т               // нек-им
    оем, П              // нек-оем
  .род ж
    ая, И               // нек-ая
    ой, Р               // нек-ой
    оей, Р              // нек-оей
    ой, Д               // нек-ой
    оей, Д              // нек-оей
    ую, В               // нек-ую
    ой, Т               // нек-ой
    оей, Т              // нек-оей
    ой, П               // нек-ой
    оей, П              // нек-оей
  .род с
    ое, И               // не-ое
    оего, Р             // нек-оего
    оему, Д             // нек-оему
    ое, В               // нек-ое
    им, Т               // нек-им
    оем, П              // нек-оем
  .род
  .число М
    ие, И               // нек-ие
    их, Р               // нек-их
    им, Д               // нек-им
    ие, Вн              // нек-ие
    их, Во              // нек-их
    ими, Т              // нек-ими
    их, П               // нек-их
}

.тип мсп 3b
//--------------------------------------------------------------------------
// Пример: какой
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ой, И               // как-ой
    ого, Р              // как-ого
    ому, Д              // как-ому
    ой, Вн              // как-ой
    ого, Во             // как-ого
    им, Т               // как-им
    ом, П               // как-ом
  .род ж
    ая, И               // как-ая
    ой, Р               // как-ой
    ой, Д               // как-ой
    ую, В               // как-ую
    ой, Т               // как-ой
    ою, Т               // как-ою
    ой, П               // как-ой
  .род с
    ое, И               // как-ое
    ого, Р              // как-ого
    ому, Д              // как-ому
    ое, В               // как-ое
    им, Т               // как-им
    ом, П               // как-ом
  .род
  .число М
    ие, И               // как-ие
    их, Р               // как-их
    им, Д               // как-им
    ие, Вн              // как-ие
    их, Во              // как-их
    ими, Т              // как-ими
    их, П               // как-их
}

.тип мсп 4a
//--------------------------------------------------------------------------
// Пример: прочий
//--------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // проч-ий
    его, Р              // проч-его
    ему, Д              // проч-ему
    ий, Вн              // проч-ий
    его, Во             // проч-его
    им, Т               // проч-им
    ем, П               // проч-ем
  .род ж
    ая, И               // проч-ая
    ей, Р               // проч-ей
    ей, Д               // проч-ей
    ую, В               // проч-ую
    ей, Т               // проч-ей
    ею, Т               // проч-ею
    ей, П               // проч-ей
  .род с
    ее, И               // проч-ее
    его, Р              // проч-его
    ему, Д              // проч-ему
    ее, В               // проч-ее
    им, Т               // проч-им
    ем, П               // проч-ем
  .род
  .число М
    ие, И               // проч-ие
    их, Р               // проч-их
    им, Д               // проч-им
    ие, Вн              // проч-ие
    их, Во              // проч-их
    ими, Т              // проч-ими
    их, П               // проч-их
}

