//************************ Тип словоизменения 2 ****************************

.тип с 2a-
//--------------------------------------------------------------------------
// Пример: горе
// Отсутствует множественное число
//--------------------------------------------------------------------------
{
  .число Е
    е, И                // гор-е
    я, Р                // гор-я
    ю, Д                // гор-ю
    е, В                // гор-е
    ем, Т               // гор-ем
    е, П                // о гор-е
}

.тип с 2c
//--------------------------------------------------------------------------
// Пример: поле
//--------------------------------------------------------------------------
{
  .число Е
    е, И                // пол-е
    я, Р                // пол-я
    ю, Д                // пол-ю
    е, В                // пол-е
    ем, Т               // пол-ем
    е, П                // о пол-е
  .число М
    я, И                // пол-я
    ей, Р               // пол-ей
    ям, Д               // пол-ям
    я, В                // пол-я
    ями, Т              // пол-ями
    ях, П               // о пол-ях
}

.тип с 2c-
//--------------------------------------------------------------------------
// Пример: перекати-поле
// Отсутствуют формы множественного числа
//--------------------------------------------------------------------------
{
  .число Е
    е, И                // перекати-пол-е
    я, Р                // перекати-пол-я
    ю, Д                // перекати-пол-ю
    е, В                // перекати-пол-е
    ем, Т               // перекати-пол-ем
    е, П                // о перекати-пол-е
}

