//==========================================================================
//          Таблицы окончаний для существительных среднего рода
// Типы слов по принятой классификации:
//   14 - неодушевленные;
//   15 - одушевленные;
//   16 - одушевленно-неодушевленные;
//   17 - одушевленные мужского рода, склоняющиеся по схеме среднего;
//   18 - неодушевленные мужского рода, склоняющиеся по схеме среднего;
//
// 25.08.94 - начало разработки, обработаны все простые случаи;
// 26.08.94 - обработка закончена.
//==========================================================================

.включить middln1.tf
.включить middln2.tf
.включить middln3.tf
.включить middln4.tf
.включить middln5.tf
.включить middln6.tf
.включить middln7.tf
.включить middln8.tf

.тип со spec_1
{
.число Е
    итя, И
    итяти, Р
    итяти, Д
    итя, В
    итятей, Т
    итятею, Т
    итяти, П
.число М
    ети, И
    етей, Р
    етям, Д
    етей, В
    етьми, Т
    етях, П
}

