.тип нсв 13b$
{
.инфинитив
    вать,,,"1"          // изда-вать(ся)
.повел
    вай,,"11"           // изда-вай, изда-вай-те
.время Н        // настоящее время
  .лицо 1
    '',,"12"            // изда-ю, изда-ем
  .лицо 2
    е,,"13"             // изда-ешь, изда-ете
  .лицо 3
    '',,"10"            // изда-ет(ся), изда-ют(ся)
  .действ           // действительное причастие
    ющ,,"5"             // изда-ющ -> ий, ая и т. д.
  .страд            // страдательное причастие
    ваем,,"4"           // изда-ваем -> ый, ая и т. д.
  .деепр
    вая                 // изда-вая
.время П        // прошедшее время
    вал,,"3"            // изда-вал (-,-а,-о,-и) (сь)
  .действ
    вавш,,"5"           // изда-вавш -> (-ий)
  .деепр
    вав                 // изда-вав
    вавши               // изда-вавши
}

.тип нсв 13bФ$
{
.инфинитив
    вать,,,"1"          // да-вать(ся)
.повел
    вай,,"7"            // да-вай(ся), да-вай-те(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"8"             // да-ю(сь), да-ем(ся)
  .лицо 2
    е,,"9"              // да-ешь(ся), да-ете(сь)
  .лицо 3
    '',,"10"            // да-ет(ся), да-ют(ся)
  .действ           // действительное причастие
    ющ,,"5"             // да-ющ -> ий, ая и т. д.
  .страд            // страдательное причастие
    ваем,,"4"           // да-ваем-ый, ая и т. д.
  .деепр
    вая,,,"2"           // да-вая(сь)
.время П        // прошедшее время
    вал,,"3"            // да-вал (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    вавш,,"5"           // да-вавш-ий(ся)
  .деепр
    вав                 // да-вав
    вавши,,,"2"         // да-вавши(сь)
}

.тип нсв 13bЯ$
{
.инфинитив
    вать,,"1"           // вда-ваться
.повел
    вай,,"17"           // вда-вайся, вда-вай-тесь
.время Н        // настоящее время
  .лицо 1
    '',,"18"            // вда-юсь, вда-емся
  .лицо 2
    е,,"19"             // вда-ешься, вда-етесь
  .лицо 3
    '',,"20"            // вда-ется, вда-ются
  .действ           // действительное причастие
    ющ,,"21"            // вда-ющ-ийся, аяся и т. д.
  .деепр
    вая,,"2"            // вда-ваясь
.время П        // прошедшее время
    вал,,"22"           // вда-вал (-ся,-ась,-ось,-ись)
  .действ
    вавш,,"21"          // вда-вавш-ийся
  .деепр
    вавши,,"2"          // вда-вавшись
}

.тип нсв 13bБЯ$
{
.инфинитив
    вать,,"1"           // возда-ваться
.время Н        // настоящее время
  .лицо 3
    '',,"27"            // возда-ется
.время П        // прошедшее время
    вал,,"26"           // возда-вал-ось
}

.тип нсв_нп 13b, нсв_нп 13b$
{
.инфинитив
    вать                // вста-вать
.повел
    вай,,"11"           // вста-вай, вста-вай-те
.время Н        // настоящее время
  .лицо 1
    '',,"12"            // вста-ю, вста-ем
  .лицо 2
    е,,"13"             // вста-ешь, вста-ете
  .лицо 3
    '',,"14"            // вста-ет, вста-ют
  .действ           // действительное причастие
    ющ,,"16"            // вста-ющ -> ий, ая и т. д.
  .деепр
    вая                 // вста-вая
.время П        // прошедшее время
    вал,,"15"           // вста-вал (-,-а,-о,-и)
  .действ
    вавш,,"16"          // вста-вавш -> (-ий)
  .деепр
    вав                 // вста-вав
    вавши               // вста-вавши
}

.тип св 13b?, св_нп 13b
{
.инфинитив
    вать                // нада-вать
.повел
    вай,,"11"           // нада-вай, нада-вай-те
.время Б        // будущее время
  .лицо 1
    '',,"12"            // нада-ю, нада-ем
  .лицо 2
    е,,"13"             // нада-ешь, нада-ете
  .лицо 3
    '',,"14"            // нада-ет, нада-ют
.время П        // прошедшее время
    вал,,"15"           // нада-вал (-,-а,-о,-и)
  .действ
    вавш,,"16"          // нада-вавш -> (-ий)
  .деепр
    вав                 // нада-вав
    вавши               // нада-вавши
}

