.тип нсв 16b/c''БЯ
//**************************************************************************
// Пример: житься
//**************************************************************************
{
.инфинитив
    ть,,"1"             // жи-ться
.время Н        // настоящее время
  .лицо 3
    в,,"27"             // жи-в-ется
.время П
    л,,"26"             // жи-л-ось
}

.тип нсв_нп 16b/c
//**************************************************************************
// Пример: плыть
//**************************************************************************
{
.инфинитив
    ть                  // плы-ть
.повел
    ви,,"11"            // плы-ви(те)
.время Н        // настоящее время
  .лицо 1
    в,,"31"             // плы-в-у, плы-в-ем
  .лицо 2
    ве,,"13"            // плы-ве-шь, плы-ве-те
  .лицо 3
    в,,"32"             // плы-в-ет, плы-в-ут
  .действ
    вущ,,"16"           // плы-вущ-ий
  .деепр
    вя                  // плы-вя
.время П
    л,,"15"             // плы-л (-,-а,-о,-и)
  .действ
    вш,,"16"            // плы-вш-ий
  .деепр
    в                   // плы-в
    вши                 // плы-вши
}

.тип св 16a$, св 16b/c$
//**************************************************************************
// Пример: пережить
//**************************************************************************
{
.инфинитив
    ть                  // пережи-ть
.повел
    ви,,"11"            // пережи-ви(те)
.время Б        // будущее время
  .лицо 1
    в,,"31"             // пережи-в-у, пережи-в-ем
  .лицо 2
    ве,,"13"            // пережи-ве-шь, пережи-ве-те
  .лицо 3
    в,,"32"             // пережи-в-ет, пережи-в-ут
.время П
    л,,"15"             // пережи-л (-,-а,-о,-и)
  .действ
    вш,,"16"            // пережи-вш-ий
  .страд
    т,,"4"              // пережи-т-ый
  .деепр
    в                   // пережи-в
    вши                 // пережи-вши
}

.тип св 16b/cФ$
//**************************************************************************
// Пример: нажить
//**************************************************************************
{
.инфинитив
    ть,,,"1"            // нажи-ть(ся)
.повел
    ви,,"28"            // нажи-ви(те)(сь)
.время Б        // будущее время
  .лицо 1
    в,,"29"             // нажи-в-у(сь), нажи-в-ем(ся)
  .лицо 2
    ве,,"9"             // нажи-ве-шь(ся), нажи-ве-те(сь)
  .лицо 3
    в,,"30"             // нажи-в-ет(ся), нажи-в-ут(ся)
.время П
    л,,"3"              // нажи-л (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    вш,,"5"             // нажи-вш-ий(ся)
  .страд
    т,,"4"              // нажи-т-ый
  .деепр
    в                   // зажи-в
    вши,,,"2"           // зажи-вши
}

.тип св 16b/c''Я, св 16b/c''Я$
//**************************************************************************
// Пример: вжиться
//**************************************************************************
{
.инфинитив
    ть,,"1"             // вжи-ться
.повел
    ви,,"33"            // вжи-ви(те)сь
.время Б        // будущее время
  .лицо 1
    в,,"34"             // вжи-в-усь, вжи-в-емся
  .лицо 2
    ве,,"19"            // вжи-ве-шься, вжи-ве-тесь
  .лицо 3
    в,,"39"             // вжи-в-ется, вжи-в-утся
.время П
    л,,"22"             // вжи-л (-ся,-ась,-ось,-ись)
  .действ
    вш,,"21"            // вжи-вш-ийся
  .деепр
    вши,,"2"            // вжи-вшись
}

.тип св_нп 16b/c, св_нп 16b/c$, св 16b/c?$, св_нп 16a$
//**************************************************************************
// Пример: пожить
//**************************************************************************
{
.инфинитив
    ть                  // пожи-ть
.повел
    ви,,"11"            // пожи-ви(те)
.время Б        // будущее время
  .лицо 1
    в,,"31"             // пожи-в-у, пожи-в-ем
  .лицо 2
    ве,,"13"            // пожи-ве-шь, пожи-ве-те
  .лицо 3
    в,,"32"             // пожи-в-ет, пожи-в-ут
.время П
    л,,"15"             // пожи-л (-,-а,-о,-и)
  .действ
    вш,,"16"            // пожи-вш-ий
  .деепр
    в                   // пожи-в
    вши                 // пожи-вши
}

.тип св_нп 16b/cФ, св_нп 16b/cФ$
//**************************************************************************
// Пример: зажить
//**************************************************************************
{
.инфинитив
    ть,,,"1"            // зажи-ть(ся)
.повел
    ви,,"28"            // зажи-ви(те)(сь)
.время Б        // будущее время
  .лицо 1
    в,,"29"             // зажи-в-у(сь), зажи-в-ем(ся)
  .лицо 2
    ве,,"9"             // зажи-ве-шь(ся), зажи-ве-те(сь)
  .лицо 3
    в,,"30"             // зажи-в-ет(ся), зажи-в-ут(ся)
.время П
    л,,"3"              // зажи-л (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    вш,,"5"             // зажи-вш-ий(ся)
  .деепр
    в                   // зажи-в
    вши,,,"2"           // зажи-вши
}

