.тип нсв 1a3?
//---------------------------------------------------------------------------
// Примеры: хиротонисать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // хиротонис-ать
.повел
    уй,,"11"            // хиротонис-уй(те)
.время Н        // настоящее время
  .лицо 1
    у,,"12"             // хиротонис-у-ю, хиротонис-у-ем
  .лицо 2
    уе,,"13"            // хиротонис-уе-шь, хиротонис-уе-те
  .лицо 3
    у,,"10"             // хиротонис-у-ет(ся), хиротонис-у-ют(ся)
  .действ
    ующ,,"5"            // хиротонис-ующ-ий(ся)
  .страд
    уем,,"4"            // хиротонис-уем-ый
  .деепр
    уя                  // хиротонис-уя
.время П        // прошедшее время
    ал,,"3"             // хиротонис-ал(-(яс),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // хиротонис-авш-ий
  .деепр
    ав                  // хиротонис-ав
    авши                // хиротонис-авши
}

