// Подтип 4b1

.тип нсв 4b1, нсв 4b1?, нсв 4c//4b1
// -------------------------------------------------------------------------
// Пример: кабалить,, солить
// Перед -ить стоит гласная
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // кабал-ить(ся)
.повел
    и,,"11"             // кабал-и, кабал-и-те
.время Н        // настоящее время
  .лицо 1
    '',,"44"            // кабал-ю, кабал-им
  .лицо 2
    и,,"13"             // кабал-и-шь, кабал-и-те
  .лицо 3
    '',,"48"            // кабал-ит(ся), кабал-ят(ся)
  .действ           // действительное причастие
    ящ,,"5"             // кабал-ящ -> ий(ся), ая и т. д.
  .страд
    им,,"4"             // кабал-им-ый
  .деепр
    я                   // кабал-я
.время П        // прошедшее время
    ил,,"3"             // кабал-ил (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    ивш,,"5"            // кабал-ивш -> (-ий(ся))
  .деепр
    ив                  // кабал-ив
    ивши                // кабал-ивши
}

.тип нсв 4b1Б
// -------------------------------------------------------------------------
// Пример: тошнить
// Перед -ить стоит гласная
// -------------------------------------------------------------------------
{
.инфинитив
    ить                 // тошн-ить
.время Н        // настоящее время
  .лицо 3
    '',,"65"            // тошн-ит
.время П        // прошедшее время
    ил,,"23"            // тошн-ил (-о)
}

.тип нсв 4b1Ф, нсв 4b1!Ф, нсв 4c//4b1Ф
// -------------------------------------------------------------------------
// Пример: таить(ся), белить(ся)
// Перед -ить стоит гласная
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // та-ить(ся)
.повел
    и,,"28"             // та-и(сь), та-и-те(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"45"            // та-ю(сь), та-им(ся)
  .лицо 2
    и,,"9"              // та-и-шь(ся), та-и-те(сь)
  .лицо 3
    '',,"48"            // та-ит(ся), та-ят(ся)
  .действ           // действительное причастие
    ящ,,"5"             // та-ящ -> ий(ся), ая и т. д.
  .деепр
    я,,,"2"             // та-я(сь)
.время П        // прошедшее время
    ил,,"3"             // та-ил (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    ивш,,"5"            // та-ивш -> (-ий(ся))
  .деепр
    ив                  // та-ив
    ивши,,,"2"          // та-ивши(сь)
}

.тип нсв 4b1Я
// -------------------------------------------------------------------------
// Пример: змеиться
// Перед -ить стоит гласная
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,"1"            // зме-иться
.повел
    и,,"33"             // зме-ись, зме-и-тесь
.время Н        // настоящее время
  .лицо 1
    '',,"46"            // зме-юсь, зме-имся
  .лицо 2
    и,,"19"             // зме-и-шься, зме-и-тесь
  .лицо 3
    '',,"49"            // зме-ится, зме-ятся
  .действ           // действительное причастие
    ящ,,"21"            // зме-ящ -> ийся, ая и т. д.
  .деепр
    я,,"2"              // зме-ясь
.время П        // прошедшее время
    ил,,"22"            // зме-ил (-ся,-ась,-ось,-ись)
  .действ
    ивш,,"21"           // зме-ивш -> (-ий(ся))
  .деепр
    ивши,,"2"           // зме-ившись
}

.тип нсв 4b1БЯ
// -------------------------------------------------------------------------
// Пример: мниться
// Перед -ить стоит гласная
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,"1"            // мн-иться
.время Н        // настоящее время
  .лицо 3
    '',,"50"            // мн-ится
.время П        // прошедшее время
    ил,,"26"            // мн-ил (-ось)
}

.тип нсв_нп 4b1, св-нсв 4b1
// -------------------------------------------------------------------------
// Пример: шалить
// Перед -ить стоит гласная
// -------------------------------------------------------------------------
{
.инфинитив
    ить                 // шал-ить
.повел
    и,,"11"             // шал-и, шал-и-те
.время Н        // настоящее время
  .лицо 1
    '',,"44"            // шал-ю, шал-им
  .лицо 2
    и,,"13"             // шал-и-шь, шал-и-те
  .лицо 3
    '',,"47"            // шал-ит, шал-ят
  .действ           // действительное причастие
    ящ,,"16"            // шал-ящ -> ий, ая и т. д.
  .деепр
    я                   // шал-я
.время П        // прошедшее время
    ил,,"15"            // шал-ил (-,-а,-о,-и)
  .действ
    ивш,,"16"           // шал-ивш -> (-ий)
  .деепр
    ив                  // шал-ив
    ивши                // шал-ивши
}

.тип нсв_нп 4b1Ф, св-нсв 4b1Ф
// -------------------------------------------------------------------------
// Пример: пылить(ся)
// Перед -ить стоит гласная
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // пыл-ить(ся)
.повел
    и,,"28"             // пыл-и(сь), пыл-и-те(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"45"            // пыл-ю(сь), пыл-им(ся)
  .лицо 2
    и,,"9"              // пыл-и-шь(ся), пыл-и-те(сь)
  .лицо 3
    '',,"48"            // пыл-ит(ся), пыл-ят(ся)
  .действ           // действительное причастие
    ящ,,"5"             // пыл-ящ -> ий(ся), ая и т. д.
  .деепр
    я,,,"2"             // пыл-я(сь)
.время П        // прошедшее время
    ил,,"3"             // пыл-ил (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    ивш,,"5"            // пыл-ивш -> (-ий(ся))
  .деепр
    ив                  // пыл-ив
    ивши,,,"2"          // пыл-ивши(сь)
}

.тип св 4b1, св 4b1$, св 4c//4b1, св 4c//4b1$
// -------------------------------------------------------------------------
// Пример: покалить
// Перед -ить стоит гласная
// -------------------------------------------------------------------------
{
.инфинитив
    ить                 // покал-ить
.повел
    и,,"11"             // покал-и, покал-и-те
.время Б        // будущее время
  .лицо 1
    '',,"44"            // покал-ю, покал-им
  .лицо 2
    и,,"13"             // покал-и-шь, покал-и-те
  .лицо 3
    '',,"47"            // покал-ит, покал-ят
.время П        // прошедшее время
    ил,,"15"            // покал-ил (-,-а,-о,-и)
  .действ
    ивш,,"16"           // покал-ивш -> (-ий)
  .страд
    ен,,"6"
  .деепр
    ив                  // покал-ив
    ивши                // покал-ивши
}

.тип св 4b1Б
// -------------------------------------------------------------------------
// Пример: затошнить
// Перед -ить стоит гласная
// -------------------------------------------------------------------------
{
.инфинитив
    ить                 // затошн-ить
.время Б        // будущее время
  .лицо 3
    '',,"65"            // затошн-ит
.время П        // прошедшее время
    ил,,"23"            // затошн-ил (-о)
}

.тип св 4b1Ф, св 4b1Ф$, св 4c//4b1Ф, св 4c//4b1Ф$
// -------------------------------------------------------------------------
// Пример: потаить(ся)
// Перед -ить стоит гласная
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // пота-ить(ся)
.повел
    и,,"28"             // пота-и(сь), пота-и-те(сь)
.время Б        // будущее время
  .лицо 1
    '',,"45"            // пота-ю(сь), пота-им(ся)
  .лицо 2
    и,,"9"              // пота-и-шь(ся), пота-и-те(сь)
  .лицо 3
    '',,"48"            // пота-ит(ся), пота-ят(ся)
.время П        // прошедшее время
    ил,,"3"             // пота-ил (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    ивш,,"5"            // пота-ивш -> (-ий(ся))
  .страд
    ен,,"6"             // пота-ен-ный
  .деепр
    ив                  // пота-ив
    ивши,,,"2"          // пота-ивши(сь)
}

.тип св 4b1Я, св 4b1Я$
// -------------------------------------------------------------------------
// Пример: притаиться
// Перед -ить стоит гласная
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,"1"            // прита-иться
.повел
    и,,"33"             // прита-ись, прита-и-тесь
.время Б        // будущее время
  .лицо 1
    '',,"46"            // прита-юсь, прита-имся
  .лицо 2
    и,,"19"             // прита-и-шься, прита-и-тесь
  .лицо 3
    '',,"49"            // прита-ится, прита-ятся
.время П        // прошедшее время
    ил,,"22"            // прита-ил (-ся,-ась,-ось,-ись)
  .действ
    ивш,,"21"           // прита-ивш -> (-ий(ся))
  .деепр
    ивши,,"2"           // прита-ившись
}

.тип св_нп 4b1, св_нп 4b1$
// -------------------------------------------------------------------------
// Пример: зашалить
// Перед -ить стоит гласная
// -------------------------------------------------------------------------
{
.инфинитив
    ить                 // зашал-ить
.повел
    и,,"11"             // зашал-и, зашал-и-те
.время Б        // будущее время
  .лицо 1
    '',,"44"            // зашал-ю, зашал-им
  .лицо 2
    и,,"13"             // зашал-и-шь, зашал-и-те
  .лицо 3
    '',,"47"            // зашал-ит, зашал-ят
.время П        // прошедшее время
    ил,,"15"            // зашал-ил (-,-а,-о,-и)
  .действ
    ивш,,"16"           // зашал-ивш -> (-ий)
  .деепр
    ив                  // зашал-ив
    ивши                // зашал-ивши
}

.тип св_нп 4b1Ф, св_нп 4b1Ф$
// -------------------------------------------------------------------------
// Пример: нашалить(ся)
// Перед -ить стоит гласная
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // нашал-ить(ся)
.повел
    и,,"28"             // нашал-и(сь), нашал-и-те(сь)
.время Б        // будущее время
  .лицо 1
    '',,"45"            // нашал-ю(сь), нашал-им(ся)
  .лицо 2
    и,,"9"              // нашал-и-шь(ся), нашал-и-те(сь)
  .лицо 3
    '',,"48"            // нашал-ит(ся), нашал-ят(ся)
.время П        // прошедшее время
    ил,,"3"             // нашал-ил (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    ивш,,"5"            // нашал-ивш -> (-ий(ся))
  .деепр
    ив                  // нашал-ив
    ивши,,,"2"          // нашал-ивши(сь)
}

