.тип нсв 5a2_пв_зтр
//---------------------------------------------------------------------------
// Пример: слышать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // слыш-ать(ся)
.повел
    ь,затрудн,"11"      // слыш-ь, слыш-те
.время Н        // настоящее время
  .лицо 1
    '',,"52"            // слыш-у, слыш-им
  .лицо 2
    и,,"13"             // слыш-и-шь, слыш-и-те
  .лицо 3
    '',,"53"            // слыш-ит(ся), слыш-ат(ся)
  .действ
    ащ,,"5"             // слыш-ащ-ий(ся)
  .страд
    им,,"4"             // слыш-им-ый
  .деепр
    а                   // слыш-а
.время П        // прошедшее время
    ал,,"3"             // слыш-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // слыш-авш-ий(ся)
  .страд
    ан,,"6"             // слыш-ан-ный
  .деепр
    ав                  // слыш-ав
    авши,,,"2"          // слыш-авши(сь)
}

.тип св 5a2
//---------------------------------------------------------------------------
// Пример: услышать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // услыш-ать
.повел
    ь,,"11"             // услыш-ь, услыш-те
.время Б        // будущее время
  .лицо 1
    '',,"52"            // услыш-у, услыш-им
  .лицо 2
    и,,"13"             // услыш-и-шь, услыш-и-те
  .лицо 3
    '',,"57"            // услыш-ит, услыш-ат
.время П        // прошедшее время
    ал,,"15"            // услыш-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // услыш-авш-ий
  .страд
    ан,,"6"             // услыш-ан-ный
  .деепр
    ав                  // услыш-ав
    авши                // услыш-авши
}

.тип св 5a2_пв_зтр
//---------------------------------------------------------------------------
// Пример: недослышать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // недослыш-ать
.повел
    ь,затрудн,"11"      // недослыш-ь, недослыш-те
.время Б        // будущее время
  .лицо 1
    '',,"52"            // недослыш-у, недослыш-им
  .лицо 2
    и,,"13"             // недослыш-и-шь, недослыш-и-те
  .лицо 3
    '',,"57"            // недослыш-ит, недослыш-ат
.время П        // прошедшее время
    ал,,"15"            // недослыш-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // недослыш-авш-ий
  .страд
    ан,,"6"             // недослыш-ан-ный
  .деепр
    ав                  // недослыш-ав
    авши                // недослыш-авши
}

.тип св 5a2Ф_пв_зтр
//---------------------------------------------------------------------------
// Пример: заслышаться
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // заслыш-ать(ся)
.повел
    ь,затрудн,"7"       // заслыш-ь(ся), заслыш-те(сь)
.время Б        // будущее время
  .лицо 1
    '',,"54"            // заслыш-у(сь), заслыш-им(ся)
  .лицо 2
    и,,"9"              // заслыш-и-шь(ся), заслыш-и-те(сь)
  .лицо 3
    '',,"53"            // заслыш-ит(ся), заслыш-ат(ся)
.время П        // прошедшее время
    ал,,"3"             // заслыш-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // заслыш-авш-ий(ся)
  .страд
    ан,,"6"             // заслыш-ан-ный
  .деепр
    ав                  // заслыш-ав
    авши,,,"2"          // заслыш-авши(сь)
}

.тип св 5a2Я_пв_зтр
//---------------------------------------------------------------------------
// Пример: наслышаться
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,"1"            // наслыш-ать(ся)
.повел
    ь,затрудн,"17"      // наслыш-ь-ся, наслыш-те-сь
.время Б        // будущее время
  .лицо 1
    '',,"55"            // наслыш-у-сь, наслыш-им-ся
  .лицо 2
    и,,"19"             // наслыш-и-шь-ся, наслыш-и-те-сь
  .лицо 3
    '',,"56"            // наслыш-ит-ся, наслыш-ат-ся
.время П        // прошедшее время
    ал,,"22"            // наслыш-ал(-ся,-а-сь,-о-сь,-и-сь)
  .действ
    авш,,"21"           // наслыш-авш-ий-ся
  .деепр
    авши,,"2"           // наслыш-авши-сь
}

