// Подтип 5b6 - глаголы на -бежать

.тип нсв_нп 5b6
//---------------------------------------------------------------------------
// Пример: бежать
//---------------------------------------------------------------------------
{
.инфинитив
    жать                // бе-жать
.повел
    ги,,"11"            // бе-ги(те)
.время Н        // настоящее время
  .лицо 1
    '',,"75"            // бе-гу, бе-жим
  .лицо 2
    жи,,"13"            // бе-жи-шь, бе-жи-те
  .лицо 3
    '',,"76"            // бе-жит, бе-гут
  .действ
    гущ,,"16"           // бе-гущ-ий
.время П        // прошедшее время
    жал,,"15"           // бе-жал(-,-а,-о,-и)
  .действ
    жавш,,"16"          // бе-жавш-ий
  .деепр
    жав                 // бе-жав
    жавши               // бе-жавши
}

.тип св 5b6?$
//---------------------------------------------------------------------------
// Пример: обежать
//---------------------------------------------------------------------------
{
.инфинитив
    жать                // обе-жать
.повел
    ги,,"11"            // обе-ги(те)
.время Б        // будущее время
  .лицо 1
    '',,"75"            // обе-гу, обе-жим
  .лицо 2
    жи,,"13"            // обе-жи-шь, обе-жи-те
  .лицо 3
    '',,"76"            // обе-жит, обе-гут
.время П        // прошедшее время
    жал,,"15"           // обе-жал(-,-а,-о,-и)
  .действ
    жавш,,"16"          // обе-жавш-ий
  .деепр
    жав                 // обе-жав
    жавши               // обе-жавши
}

.тип св 5b6Ф$, св 5b6?Ф$
//---------------------------------------------------------------------------
// Пример: сбежать
//---------------------------------------------------------------------------
{
.инфинитив
    жать,,,"1"          // сбе-жать
.повел
    ги,,"28"            // сбе-ги(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"77"            // сбе-гу(сь), сбе-жим(ся)
  .лицо 2
    жи,,"9"             // сбе-жи-шь(ся), сбе-жи-те(сь)
  .лицо 3
    '',,"78"            // сбе-жит(ся), сбе-гут(ся)
.время П        // прошедшее время
    жал,,"3"            // сбе-жал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    жавш,,"5"           // сбе-жавш-ий(ся)
  .деепр
    жав                 // сбе-жав
    жавши,,,"2"         // сбе-жавши(сь)
}

.тип св 5b6Я$
//---------------------------------------------------------------------------
// Пример: разбежаться
//---------------------------------------------------------------------------
{
.инфинитив
    жать,,"1"           // разбе-жать-ся
.повел
    ги,,"33"            // разбе-ги(те)сь
.время Б        // будущее время
  .лицо 1
    '',,"79"            // разбе-гу-сь, разбе-жим-ся
  .лицо 2
    жи,,"19"            // разбе-жи-шь-ся, разбе-жи-те-сь
  .лицо 3
    '',,"80"            // разбе-жит-ся, разбе-гут-ся
.время П        // прошедшее время
    жал,,"22"           // разбе-жал(-ся,-ась,-ось,-ись)
  .действ
    жавш,,"21"          // разбе-жавш-ий-ся
  .деепр
    жавши,,"2"          // разбе-жавши-сь
}

.тип св_нп 5b6$
//---------------------------------------------------------------------------
// Пример: набежать
//---------------------------------------------------------------------------
{
.инфинитив
    жать                // набе-жать
.повел
    ги,,"11"            // набе-ги(те)
.время Б        // будущее время
  .лицо 1
    '',,"75"            // набе-гу, набе-жим
  .лицо 2
    жи,,"13"            // набе-жи-шь, набе-жи-те
  .лицо 3
    '',,"76"            // набе-жит, набе-гут
.время П        // прошедшее время
    жал,,"15"           // набе-жал(-,-а,-о,-и)
  .действ
    жавш,,"16"          // набе-жавш-ий
  .деепр
    жав                 // набе-жав
    жавши               // набе-жавши
}

.тип св_нп 5b6Ф$
//---------------------------------------------------------------------------
// Пример: сбежать
//---------------------------------------------------------------------------
{
.инфинитив
    жать,,,"1"          // сбе-жать
.повел
    ги,,"28"            // сбе-ги(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"77"            // сбе-гу(сь), сбе-жим(ся)
  .лицо 2
    жи,,"9"             // сбе-жи-шь(ся), сбе-жи-те(сь)
  .лицо 3
    '',,"78"            // сбе-жит(ся), сбе-гут(ся)
.время П        // прошедшее время
    жал,,"3"            // сбе-жал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    жавш,,"5"           // сбе-жавш-ий(ся)
  .деепр
    жав                 // сбе-жав
    жавши,,,"2"         // сбе-жавши(сь)
}

