//
// Глаголы на -ать
//

.тип нсв 5cФ, нсв 5c?Ф
//---------------------------------------------------------------------------
// Пример: содержать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // содерж-ать(ся)
.повел
    и,,"28"             // содерж-и(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"54"            // содерж-у(сь), содерж-им(ся)
  .лицо 2
    и,,"9"              // содерж-и-шь(ся), содерж-и-те(сь)
  .лицо 3
    '',,"53"            // содерж-ит(ся), содерж-ат(ся)
  .действ
    ащ,,"5"             // содерж-ащ-ий(ся)
  .деепр
    а,,,"2"             // содерж-а(сь)
.время П        // прошедшее время
    ал,,"3"             // содерж-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // содерж-авш-ий(ся)
  .деепр
    ав                  // содерж-ав
    авши,,,"2"          // содерж-авши(сь)
}

.тип нсв 5cБЯ
//---------------------------------------------------------------------------
// Пример: дышаться
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,"1"            // дыш-ать-ся
.время Н        // настоящее время
  .лицо 3
    '',,"50"            // дыш-ит-ся
.время П        // прошедшее время
    ал,,"26"            // дыш-ал-о-сь
}

.тип нсв_нп 5c"4"
//---------------------------------------------------------------------------
// Пример: дышать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // дыш-ать
.повел
    и,,"11"             // дыш-и(те)
.время Н        // настоящее время
  .лицо 1
    '',,"52"            // дыш-у, дыш-им
  .лицо 2
    и,,"13"             // дыш-и-шь, дыш-и-те
  .лицо 3
    '',,"57"            // дыш-ит, дыш-ат
  .действ
    ащ,, "16"           // дыш-ащ-ий
  .деепр
    а                   // дыш-а
.время П        // прошедшее время
    ал,,"15"            // дыш-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // дыш-авш-ий
  .деепр
    ав                  // дыш-ав
    авши                // дыш-авши
}

.тип св 5c, св 5c$
//---------------------------------------------------------------------------
// Пример: поддержать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // поддерж-ать
.повел
    и,,"11"             // поддерж-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"52"            // поддерж-у, поддерж-им
  .лицо 2
    и,,"13"             // поддерж-и-шь, поддерж-и-те
  .лицо 3
    '',,"57"            // поддерж-ит, поддерж-ат
.время П        // прошедшее время
    ал,,"15"            // поддерж-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // поддерж-авш-ий
  .страд
    ан,,"6"             // поддерж-ан-ный
  .деепр
    ав                  // поддерж-ав
    авши                // поддерж-авши
}

.тип св 5cФ, св 5cФ$
//---------------------------------------------------------------------------
// Пример: подержать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // подерж-ать(ся)
.повел
    и,,"28"             // подерж-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"54"            // подерж-у(сь), подерж-им(ся)
  .лицо 2
    и,,"9"              // подерж-и-шь(ся), подерж-и-те(сь)
  .лицо 3
    '',,"53"            // подерж-ит(ся), подерж-ат(ся)
.время П        // прошедшее время
    ал,,"3"             // подерж-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // подерж-авш-ий(ся)
  .страд
    ан,,"6"             // подерж-ан-ный
  .деепр
    ав                  // подерж-ав
    авши,,,"2"          // подерж-авши(сь)
}

.тип св 5cЯ
//---------------------------------------------------------------------------
// Пример: воздержаться
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,"1"            // воздерж-ать-ся
.повел
    и,,"33"             // воздерж-и(те)сь
.время Б        // будущее время
  .лицо 1
    '',,"55"            // воздерж-у-сь, воздерж-им-ся
  .лицо 2
    и,,"19"             // воздерж-и-шь-ся, воздерж-и-те-сь
  .лицо 3
    '',,"56"            // воздерж-ит-ся, воздерж-ат-ся
.время П        // прошедшее время
    ал,,"22"            // воздерж-ал(-ся,-а-сь,-о-сь,-и-сь)
  .действ
    авш,,"21"           // воздерж-авш-ий-ся
  .деепр
    авши,,"2"           // воздерж-евши-сь
}

.тип св_нп 5c
//---------------------------------------------------------------------------
// Пример: задышать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // задыш-ать
.повел
    и,,"11"             // задыш-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"52"            // задыш-у, задыш-им
  .лицо 2
    и,,"13"             // задыш-и-шь, задыш-и-те
  .лицо 3
    '',,"57"            // задыш-ит, задыш-ат
.время П        // прошедшее время
    ал,,"15"            // задыш-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // задыш-авш-ий
  .деепр
    ав                  // задыш-ав
    авши                // задыш-авши
}

.тип св_нп 5cФ
//---------------------------------------------------------------------------
// Пример: надышать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // надыш-ать(ся)
.повел
    и,,"28"             // надыш-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"54"            // надыш-у(сь), надыш-им(ся)
  .лицо 2
    и,,"9"              // надыш-и-шь(ся), надыш-и-те(сь)
  .лицо 3
    '',,"53"            // надыш-ит(ся), надыш-ат(ся)
.время П        // прошедшее время
    ал,,"3"             // надыш-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // надыш-авш-ий(ся)
  .деепр
    ав                  // надыш-ав
    авши,,,"2"          // надыш-авши(сь)
}

