//
// Глаголы на -гнать
//

.тип нсв 5c/c!Ф
//---------------------------------------------------------------------------
// Пример: гнать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // г-нать(ся)
.повел
    и,,"28"             // г-они(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"45"            // г-он-ю(сь), г-он-им(ся)
  .лицо 2
    и,,"9"              // г-они-шь(ся), г-они-те(сь)
  .лицо 3
    '',,"48"            // г-он-ит(ся), г-он-ят(ся)
  .действ
    ящ,,"5"             // г-онящ-ий(ся)
  .страд
    им,,"4"             // г-оним-ый
.время П        // прошедшее время
    ал,,"3"             // г-нал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // г-навш-ий(ся)
  .деепр
    ав                  // г-нав
    авши,,,"2"          // г-навши(сь)
}

.тип св 5c/c, св 5c/c$, св 5*c/c$
//---------------------------------------------------------------------------
// Пример: нагнать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // нагн-ать
.повел
    и,,"11"             // нагон-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"44"            // нагон-ю, нагон-им
  .лицо 2
    и,,"13"             // нагон-и-шь, нагон-и-те
  .лицо 3
    '',,"47"            // нагон-ит, нагон-ят
.время П        // прошедшее время
    ал,,"15"            // нагн-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // нагн-авш-ий
  .страд
    ан,,"6"             // нагн-ан-ный
  .деепр
    ав                  // нагн-ав
    авши                // нагн-авши
}

.тип св 5c/cФ, св 5c/cФ$, св 5*c/cФ$
//---------------------------------------------------------------------------
// Пример: погнать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // погн-ать(ся)
.повел
    и,,"28"             // погон-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"45"            // погон-ю(сь), погон-им(ся)
  .лицо 2
    и,,"9"              // погон-и-шь(ся), погон-и-те(сь)
  .лицо 3
    '',,"48"            // погон-ит(ся), погон-ят(ся)
.время П        // прошедшее время
    ал,,"3"             // погн-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // погн-авш-ий(ся)
  .страд
    ан,,"6"             // погн-ан-ный
  .деепр
    ав                  // погн-ав
    авши,,,"2"          // погн-авши(сь)
}

