.тип нсв_нп 6b2
//---------------------------------------------------------------------------
// Пример: ржать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // рж-ать
.повел
    и,,"11"             // рж-и(те)
.время Н        // настоящее время
  .лицо 1
    '',,"31"            // рж-у, рж-ем
  .лицо 2
    е,,"13"             // рж-е-шь, рж-е-те
  .лицо 3
    '',,"32"            // рж-ет, рж-ут
  .действ
    ущ,,"16"            // рж-ущ-ий
  .деепр
    а, затрудн          //
.время П        // прошедшее время
    ал,,"15"            // рж-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // рж-авш-ий
  .деепр
    ав                  // рж-ав
    авши                // рж-авши
}

.тип св_нп 6b2
//---------------------------------------------------------------------------
// Пример: поржать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // порж-ать
.повел
    и,,"11"             // порж-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"31"            // порж-у, порж-ем
  .лицо 2
    е,,"13"             // порж-е-шь, порж-е-те
  .лицо 3
    '',,"32"            // порж-ет, порж-ут
.время П        // прошедшее время
    ал,,"15"            // порж-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // порж-авш-ий
  .деепр
    ав                  // порж-ав
    авши                // порж-авши
}

