// Подтип 6°b/c2, глаголы на -брать и -драть

.тип нсв 6°b/c2!Ф
//---------------------------------------------------------------------------
// Пример: брать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // б-рать(ся)
.повел
    и,,"28"             // б-ери(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"29"            // б-ер-у(сь), б-ер-ем(ся)
  .лицо 2
    е,,"9"              // б-ере-шь(ся), б-ере-те(сь)
  .лицо 3
    '',,"30"            // б-ер-ет(ся), б-ер-ут(ся)
  .действ           // действительное причастие
    ущ,,"5"             // б-ерущ-ий(ся)
  .деепр
    я,,,"2"             // б-еря(сь)
.время П        // прошедшее время
    ал,,"3"             // б-рал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // б-равш-ий(ся)
  .деепр
    ав                  // б-рав
    авши,,,"2"          // б-равши(сь)
}

.тип св 6°*b/c2, св 6°b/c2, св 6°*b/c2$, св 6°b/c2$
//---------------------------------------------------------------------------
// Пример: побрать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // поб-рать
.повел
    и,,"11"             // поб-ери(те)
.время Б        // будущее время
  .лицо 1
    '',,"31"            // поб-ер-у, поб-ер-ем
  .лицо 2
    е,,"13"             // поб-ере-шь, поб-ере-те
  .лицо 3
    '',,"32"            // поб-ер-ет, поб-ер-ут
.время П        // прошедшее время
    ал,,"15"            // поб-рал(-,-а,-о,-и)
  .действ
    авш,,"16"           // поб-равш-ий
  .страд
    ан,,"6"             // по-бран-ный
  .деепр
    ав                  // поб-рав
    авши                // поб-равши
}

.тип св 6°*b/c2Ф, св 6°b/c2Ф, св 6°*b/c2Ф$, св 6°b/c2Ф$
//---------------------------------------------------------------------------
// Пример: забрать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // заб-рать(ся)
.повел
    и,,"28"             // заб-ери(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"29"            // заб-ер-у(сь), заб-ер-ем(ся)
  .лицо 2
    е,,"9"              // заб-ере-шь(ся), заб-ере-те(сь)
  .лицо 3
    '',,"30"            // заб-ер-ет(ся), заб-ер-ут(ся)
.время П        // прошедшее время
    ал,,"3"             // заб-рал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // заб-равш-ий(ся)
  .страд
    ан,,"6"             // заб-ран-ный
  .деепр
    ав                  // заб-рав
    авши,,,"2"          // заб-равши(сь)
}

.тип св 6°*b/c2''Я$
//---------------------------------------------------------------------------
// Пример: взобраться
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,"1"            // взоб-рать(ся)
.повел
    и,,"33"             // взб-ери(те)сь
.время Б        // будущее время
  .лицо 1
    '',,"34"            // взб-ер-у-сь, взб-ер-ем-ся
  .лицо 2
    е,,"19"             // взб-ере-шь-ся, взб-ере-те-сь
  .лицо 3
    '',,"39"            // взб-ер-ет-ся, взб-ер-ут-ся
.время П        // прошедшее время
    ал,,"22"            // взоб-рал(-ся,-а-сь,-о-сь,-и-сь)
  .действ
    авш,,"21"           // взоб-равш-ий-ся
  .деепр
    авши,,"2"           // взоб-равши-сь
}

.тип св_нп 6°b/c2$
//---------------------------------------------------------------------------
// Пример: удрать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // уд-рать
.повел
    и,,"11"             // уд-ери(те)
.время Б        // будущее время
  .лицо 1
    '',,"31"            // уд-ер-у, уд-ер-ем
  .лицо 2
    е,,"13"             // уд-ере-шь, уд-ере-те
  .лицо 3
    '',,"32"            // уд-ер-ет, уд-ер-ут
.время П        // прошедшее время
    ал,,"15"            // уд-рал(-,-а,-о,-и)
  .действ
    авш,,"16"           // уд-равш-ий
  .деепр
    ав                  // уд-рав
    авши                // уд-равши
}

