// Подтип 6°b/c1, глаголы на -лгать

.тип нсв_нп 6°b/c1
//---------------------------------------------------------------------------
// Пример: лгать
//---------------------------------------------------------------------------
{
.инфинитив
    гать                // л-гать
.повел
    ги,,"11"            // л-ги(те)
.время Н        // настоящее время
  .лицо 1
    '',,"83"            // л-гу, л-жем
  .лицо 2
    же,,"13"            // л-же-шь, л-же-те
  .лицо 3
    '',,"84"            // л-жет, л-гут
  .действ           // действительное причастие
    гущ,,"16"           // л-гущ-ий
.время П        // прошедшее время
    гал,,"15"           // л-гал(-,-а,-о,-и)
  .действ
    гавш,,"16"          // л-гавш-ий
  .деепр
    гав                 // л-гав
    гавши               // л-гавши
}

.тип св 6°b/c1, св 6°b/c1$
//---------------------------------------------------------------------------
// Пример: налгать
//---------------------------------------------------------------------------
{
.инфинитив
    гать                // нал-гать
.повел
    ги,,"11"            // нал-ги(те)
.время Б        // будущее время
  .лицо 1
    '',,"83"            // нал-гу, нал-жем
  .лицо 2
    же,,"13"            // нал-же-шь, нал-же-те
  .лицо 3
    '',,"84"            // нал-жет, нал-гут
.время П        // прошедшее время
    гал,,"15"           // нал-гал(-,-а,-о,-и)
  .действ
    гавш,,"16"          // нал-гавш-ий
  .страд
    ган,,"6"            // нал-ган-ный
  .деепр
    гав                 // нал-гав
    гавши               // нал-гавши
}

.тип св 6°b/c1''Я
//---------------------------------------------------------------------------
// Пример: залгаться
//---------------------------------------------------------------------------
{
.инфинитив
    гать,,"1"           // зал-гать-ся
.повел
    ги,,"33"            // зал-ги(те)сь
.время Б        // будущее время
  .лицо 1
    '',,"87"            // зал-гу-сь, зал-жем-ся
  .лицо 2
    же,,"19"            // зал-же-шь-ся, зал-же-те-сь
  .лицо 3
    '',,"88"            // зал-жет-ся, зал-гут-ся
.время П        // прошедшее время
    гал,,"22"           // зал-гал(-ся,-ась,-ось,-ись)
  .действ
    гавш,,"21"          // зал-гавш-ий-ся
  .деепр
    гавши,,"2"          // зал-гавши-сь
}

.тип св_нп 6°b/c1
//---------------------------------------------------------------------------
// Пример: солгать
//---------------------------------------------------------------------------
{
.инфинитив
    гать                // сол-гать
.повел
    ги,,"11"            // сол-ги(те)
.время Б        // будущее время
  .лицо 1
    '',,"83"            // сол-гу, сол-жем
  .лицо 2
    же,,"13"            // сол-же-шь, сол-же-те
  .лицо 3
    '',,"84"            // сол-жет, сол-гут
.время П        // прошедшее время
    гал,,"15"           // сол-гал(-,-а,-о,-и)
  .действ
    гавш,,"16"          // сол-гавш-ий
  .деепр
    гав                 // сол-гав
    гавши               // сол-гавши
}

