//
// Глаголы типа 7a4 - на вы-XXXX-сти с пометой (-с-)
//

.тип св 7a4$
//---------------------------------------------------------------------------
// Пример: выпасти
//---------------------------------------------------------------------------
{
.инфинитив
    ти                  // выпас-ти
.повел
    и,,"11"             // выпас-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"31"            // выпас-у, выпас-ем
  .лицо 2
    е,,"13"             // выпас-е-шь, выпас-е-те
  .лицо 3
    '',,"32"            // выпас-ет, выпас-ут
.время П        // прошедшее время
    '',,"36"            // выпас(-,-ла,-ло,-ли)
  .действ
    ш,,"16"             // выпас-ш-ий
  .страд
    ен,,"6"             // выпас-ен-ный
  .деепр
    ши                  // выпас-ши
}

.тип св 7a4Ф$
//---------------------------------------------------------------------------
// Пример: вытрясти
//---------------------------------------------------------------------------
{
.инфинитив
    ти,,,"2"            // вытряс-ти(сь)
.повел
    и,,"28"             // вытряс-и(сь), вытряс-и-те(сь)
.время Б        // будущее время
  .лицо 1
    '',,"29"            // вытряс-у(сь), вытряс-ем(ся)
  .лицо 2
    е,,"9"              // вытряс-е-шь(ся), вытряс-е-те(сь)
  .лицо 3
    '',,"30"            // вытряс-ет(ся), вытряс-ут(ся)
.время П        // прошедшее время
    '',,"38"            // вытряс(-(ся),ла(сь),ло(сь),и(сь))
  .действ
    ш,,"5"              // вытряс-ш-ий-ся
  .страд
    ен,,"6"             // вытряс-ен-ный
  .деепр
    ши,,,"2"            // вытряс-ши(сь)
}

.тип св 7a4Ф$"9"
//---------------------------------------------------------------------------
// Пример: вынести
//---------------------------------------------------------------------------
{
.инфинитив
    ти,,,"2"            // вынес-ти(сь)
.повел
    и,,"28"             // вынес-и(сь), вынес-и-те(сь)
.время Б        // будущее время
  .лицо 1
    '',,"29"            // вынес-у(сь), вынес-ем(ся)
  .лицо 2
    е,,"9"              // вынес-е-шь(ся), вынес-е-те(сь)
  .лицо 3
    '',,"30"            // вынес-ет(ся), вынес-ут(ся)
.время П        // прошедшее время
    '',,"38"            // вынес(-(ся),ла(сь),ло(сь),и(сь))
  .действ
    ш,,"5"              // вынес-ш-ий-ся
  .страд
    ен,,"6"             // вынес-ен-ный
  .деепр
    я                   // вынес-я
    ши,,,"2"            // вынес-ши(сь)
}

