//
// Глаголы типа 7a5 - на вы-XXXX-сти с пометой (-д-)
//

.тип св 7a5"9"
//---------------------------------------------------------------------------
// Пример: повывести
//---------------------------------------------------------------------------
{
.инфинитив
    сти                 // повыве-сти
.повел
    ди,,"11"            // повыве-ди(те)
.время Б        // будущее время
  .лицо 1
    д,,"31"             // повыве-д-у, повыве-д-ем
  .лицо 2
    де,,"13"            // повыве-де-шь, повыве-де-те
  .лицо 3
    д,,"32"             // повыве-д-ет, повыве-д-ут
.время П        // прошедшее время
    л,,"15"             // повыве-л(-,-а,-о,-и)
  .действ
    дш,,"16"            // повыве-дш-ий
  .страд
    ден,,"6"            // повыве-ден-ный
  .деепр
    дя                  // повыве-дя
    дши                 // повыве-дши
}

.тип св 7a5Ф$"9"
//---------------------------------------------------------------------------
// Пример: вывести
//---------------------------------------------------------------------------
{
.инфинитив
    сти,,,"2"           // выве-сти(сь)
.повел
    ди,,"28"            // выве-ди(сь), выве-ди-те(сь)
.время Б        // будущее время
  .лицо 1
    д,,"29"             // выве-д-у(сь), выве-д-ем(ся)
  .лицо 2
    де,,"9"             // выве-де-шь(ся), выве-де-те(сь)
  .лицо 3
    д,,"30"             // выве-д-ет(ся), выве-д-ут(ся)
.время П        // прошедшее время
    л,,"3"              // выве-л(-(ся),а(сь),о(сь),и(сь))
  .действ
    дш,,"5"             // выве-дш-ий-ся
  .страд
    ден,,"6"            // выве-ден-ный
  .деепр
    дя                  // выве-дя
    дши,,,"2"           // выве-дши(сь)
}

.тип св_нп 7a5$"9"
//---------------------------------------------------------------------------
// Пример: выбрести
//---------------------------------------------------------------------------
{
.инфинитив
    сти                 // выбре-сти
.повел
    ди,,"11"            // выбре-ди(те)
.время Б        // будущее время
  .лицо 1
    д,,"31"             // выбре-д-у, выбре-д-ем
  .лицо 2
    де,,"13"            // выбре-де-шь, выбре-де-те
  .лицо 3
    д,,"32"             // выбре-д-ет, выбре-д-ут
.время П        // прошедшее время
    л,,"15"             // выбре-л(-,-а,-о,-и)
  .действ
    дш,,"16"            // выбре-дш-ий
  .деепр
    дя                  // выбре-дя
    дши                 // выбре-дши
}

