//
// Глаголы типа 7a6 - на вы-XXXX-сти с пометой (-т-)
//

.тип св 7a6Ф$"9"
//---------------------------------------------------------------------------
// Пример: выплести
//---------------------------------------------------------------------------
{
.инфинитив
    сти,,,"2"           // выпле-сти(сь)
.повел
    ти,,"28"            // выпле-ти(сь), выпле-ти-те(сь)
.время Б        // будущее время
  .лицо 1
    т,,"29"             // выпле-т-у(сь), выпле-т-ем(ся)
  .лицо 2
    те,,"9"             // выпле-те-шь(ся), выпле-те-те(сь)
  .лицо 3
    т,,"30"             // выпле-т-ет(ся), выпле-т-ут(ся)
.время П        // прошедшее время
    л,,"3"              // выпле-л(-(ся),а(сь),о(сь),и(сь))
  .действ
    тш,,"5"             // выпле-тш-ий-ся
  .страд
    тен,,"6"            // выпле-тен-ный
  .деепр
    тя                  // выпле-тя
    тши,,,"2"           // выпле-тши(сь)
}

.тип св_нп 7a6, св_нп 7a6$
//---------------------------------------------------------------------------
// Пример: выцвести
//---------------------------------------------------------------------------
{
.инфинитив
    сти                 // выцве-сти
.повел
    ти,,"11"            // выцве-ти(те)
.время Б        // будущее время
  .лицо 1
    т,,"31"             // выцве-т-у, выцве-т-ем
  .лицо 2
    те,,"13"            // выцве-те-шь, выцве-те-те
  .лицо 3
    т,,"32"             // выцве-т-ет, выцве-т-ут
.время П        // прошедшее время
    л,,"15"             // выцве-л(-,-а,-о,-и)
  .действ
    тш,,"16"            // выцве-тш-ий
  .деепр
    тши                 // выцве-тши
}

