//
// Глаголы типа 7a7 - на вырасти с пометой (-ст-)
//

.тип св_нп 7a7, св_нп 7a7$
//---------------------------------------------------------------------------
// Пример: вырасти
//---------------------------------------------------------------------------
{
.инфинитив
    асти                // выр-асти
.повел
    асти,,"11"          // выр-асти(те)
.время Б        // будущее время
  .лицо 1
    аст,,"31"           // выр-аст-у, выр-аст-ем
  .лицо 2
    асте,,"13"          // выр-асте-шь, выр-асте-те
  .лицо 3
    аст,,"32"           // выр-аст-ет, выр-аст-ут
.время П        // прошедшее время
    ос,,"36"            // выр-ос(-,-ла,-ло,-ли)
  .действ
    осш,,"16"           // выр-осш-ий
  .деепр
    осши                // выр-осши
}

