//
// Глаголы типа 7a8 - на -зти
//

.тип св 7a8$"9"
//---------------------------------------------------------------------------
// Пример: вывезти
//---------------------------------------------------------------------------
{
.инфинитив
    ти                  // вывез-ти
.повел
    и,,"11"             // вывез-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"31"            // вывез-у, вывез-ем
  .лицо 2
    е,,"13"             // вывез-е-шь, вывез-е-те
  .лицо 3
    '',,"32"            // вывез-ет, вывез-ут
.время П        // прошедшее время
    '',,"36"            // вывез(-,-ла,-ло,-ли)
  .действ
    ш,,"16"             // вывез-ш-ий
  .страд
    ен,,"6"             // вывез-ен-ный
  .деепр
    я                   // вывезя
    ши                  // вывез-ши
}

.тип св 7a8Я$
//---------------------------------------------------------------------------
// Пример: отверзтись
//---------------------------------------------------------------------------
{
.инфинитив
    ти,,"2"             // отверз-ти-сь
.повел
    и,,"33"             // отверз-и(те)сь
.время Б        // будущее время
  .лицо 1
    '',,"34"            // отверз-усь, отверз-емся
  .лицо 2
    е,,"19"             // отверз-е-шься, отверз-е-те-сь
  .лицо 3
    '',,"39"            // отверз-ет-ся, отверз-ут-ся
.время П        // прошедшее время
    '',,"37"            // отверз(-ся,-ла-сь,-ло-сь,-ли-сь)
  .действ
    ш,,"21"             // отверз-ш-ий-ся
  .деепр
    ши,,"2"             // отверз-ши-сь
}

.тип св_нп 7a8$
//---------------------------------------------------------------------------
// Пример: выползти
//---------------------------------------------------------------------------
{
.инфинитив
    ти                  // выполз-ти
.повел
    и,,"11"             // выполз-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"31"            // выполз-у, выполз-ем
  .лицо 2
    е,,"13"             // выполз-е-шь, выполз-е-те
  .лицо 3
    '',,"32"            // выполз-ет, выполз-ут
.время П        // прошедшее время
    '',,"36"            // выполз(-,-ла,-ло,-ли)
  .действ
    ш,,"16"             // выполз-ш-ий
  .деепр
    ши                  // выполз-ши
}

.тип св_нп 7a8$"3"
//---------------------------------------------------------------------------
// Пример: вылезти
//---------------------------------------------------------------------------
{
.инфинитив
    ти                  // вылез-ти
.повел
    '',,"61"            // вылез-и, вылез-ь, вылез-ьте
.время Б        // будущее время
  .лицо 1
    '',,"31"            // вылез-у, вылез-ем
  .лицо 2
    е,,"13"             // вылез-е-шь, вылез-е-те
  .лицо 3
    '',,"32"            // вылез-ет, вылез-ут
.время П        // прошедшее время
    '',,"36"            // вылез(-,-ла,-ло,-ли)
  .действ
    ш,,"16"             // вылез-ш-ий
  .деепр
    ши                  // вылез-ши
}

