//
// Глаголы типа 7a9 - на -сть с пометой (-д-)
//

.тип св 7a9$
//---------------------------------------------------------------------------
// Пример: выпрясть
//---------------------------------------------------------------------------
{
.инфинитив
    сть                 // выпря-сть
.повел
    ди,,"11"            // выпря-ди(те)
.время Б        // будущее время
  .лицо 1
    д,,"31"             // выпря-д-у, выпря-д-ем
  .лицо 2
    де,,"13"            // выпря-де-шь, выпря-де-те
  .лицо 3
    д,,"32"             // выпря-д-ет, выпря-д-ут
.время П        // прошедшее время
    л,,"15"             // выпря-л(-,-а,-о,-и)
  .действ
    вш,,"16"            // выпря-вш-ий
  .страд
    ден,,"6"            // выпря-ден-ный
  .деепр
    в                   // выпря-в
    вши                 // выпря-вши
}

.тип св_нп 7a9, св_нп 7a9$
//---------------------------------------------------------------------------
// Пример: выпасть
//---------------------------------------------------------------------------
{
.инфинитив
    сть                 // выпа-сть
.повел
    ди,,"11"            // выпа-ди(те)
.время Б        // будущее время
  .лицо 1
    д,,"31"             // выпа-д-у, выпа-д-ем
  .лицо 2
    де,,"13"            // выпа-де-шь, выпа-де-те
  .лицо 3
    д,,"32"             // выпа-д-ет, выпа-д-ут
.время П        // прошедшее время
    л,,"15"             // выпа-л(-,-а,-о,-и)
  .действ
    вш,,"16"            // выпа-вш-ий
  .деепр
    в                   // выпа-в
    вши                 // выпа-вши
}

