//
// Глаголы типа 7b на -зть без дополнительных помет
//

.тип нсв 7b1Ф
//---------------------------------------------------------------------------
// Пример: грызть
//---------------------------------------------------------------------------
{
.инфинитив
    ть,,,"1"            // грыз-ть(ся)
.повел
    и,,"28"             // грыз-и(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"29"            // грыз-у(сь), грыз-ем(ся)
  .лицо 2
    е,,"9"              // грыз-е-шь(ся), грыз-е-те(сь)
  .лицо 3
    '',,"30"            // грыз-ет(ся), грыз-ут(ся)
  .действ
    ущ,,"5"             // грыз-ущ-ий(ся)
  .деепр
    я,,,"2"             // грыз-я(сь)
.время П        // прошедшее время
    '',,"38"            // грыз-(-(ся),-ла(сь),-ло(сь),-ли(сь))
  .действ
    ш,,"5"              // грыз-ш-ий(ся)
  .страд
    ен,,"6"             // грыз-ен-ный
  .деепр
    ши,,,"2"            // грыз-ши(сь)
}

.тип св 7b1$
//---------------------------------------------------------------------------
// Пример: загрызть
//---------------------------------------------------------------------------
{
.инфинитив
    ть                  // загрыз-ть
.повел
    и,,"11"             // загрыз-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"31"            // загрыз-у, загрыз-ем
  .лицо 2
    е,,"13"             // загрыз-е-шь, загрыз-е-те
  .лицо 3
    '',,"32"            // загрыз-ет, загрыз-ут
.время П        // прошедшее время
    '',,"36"            // загрыз-(-,-ла,-ло,-ли)
  .действ
    ш,,"16"             // загрыз-ш-ий
  .страд
    ен,,"6"             // загрыз-ен-ный
  .деепр
    ши                  // загрыз-ши
}

.тип св 7b1Ф, св 7b1Ф$
//---------------------------------------------------------------------------
// Пример: погрызть
//---------------------------------------------------------------------------
{
.инфинитив
    ть,,,"1"            // погрыз-ть(ся)
.повел
    и,,"28"             // погрыз-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"29"            // погрыз-у(сь), погрыз-ем(ся)
  .лицо 2
    е,,"9"              // погрыз-е-шь(ся), погрыз-е-те(сь)
  .лицо 3
    '',,"30"            // погрыз-ет(ся), погрыз-ут(ся)
.время П        // прошедшее время
    '',,"38"            // погрыз-(-(ся),-ла(сь),-ло(сь),-ли(сь))
  .действ
    ш,,"5"              // погрыз-ш-ий(ся)
  .страд
    ен,,"6"             // погрыз-ен-ный
  .деепр
    ши,,,"2"            // погрыз-ши(сь)
}

.тип св 7b1Я$
//---------------------------------------------------------------------------
// Пример: вгрызться
//---------------------------------------------------------------------------
{
.инфинитив
    ть,,"1"             // вгрыз-ть-ся
.повел
    и,,"33"             // вгрыз-и(те)сь
.время Б        // будущее время
  .лицо 1
    '',,"34"            // вгрыз-у-сь, вгрыз-ем-ся
  .лицо 2
    е,,"19"             // вгрыз-е-шь-ся, вгрыз-е-те-сь
  .лицо 3
    '',,"39"            // вгрыз-ет-ся, вгрыз-ут-ся
.время П        // прошедшее время
    '',,"37"            // вгрыз-(-ся,-ла-сь,-ло-сь,-ли-сь)
  .действ
    ш,,"21"             // вгрыз-ш-ий-ся
  .деепр
    ши,,"2"             // вгрыз-ши(сь)
}

