// Подтип 7b/b4, глаголы с пометами -с- и Jо

.тип нсв 7b/b4Ф
//---------------------------------------------------------------------------
// Пример: нести
//---------------------------------------------------------------------------
{
.инфинитив
    ти,,,"2"            // нес-ти(сь)
.повел
    и,,"28"             // нес-и(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"29"            // нес-у(сь), нес-ем(ся)
  .лицо 2
    е,,"9"              // нес-е-шь(ся), нес-е-те(сь)
  .лицо 3
    '',,"30"            // нес-ет(ся), нес-ут(ся)
  .действ
    ущ,,"5"             // нес-ущ-ий(ся)
  .страд
    ом,,"4"             // нес-ом-ый
  .деепр
    я,,,"2"             // нес-я(сь)
.время П        // прошедшее время
    '',,"38"            // нес-(-(ся),-ла(сь),-ло(сь),-ли(сь))
  .действ
    ш,,"5"              // нес-ш-ий(ся)
  .страд
    ен,,"6"             // нес-ен-ный
  .деепр
    ши,,,"2"            // нес-ши(сь)
}

.тип св 7b/b4"9", св 7b/b4"9"$
//---------------------------------------------------------------------------
// Пример: нанести
//---------------------------------------------------------------------------
{
.инфинитив
    ти                  // нанес-ти
.повел
    и,,"11"             // нанес-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"31"            // нанес-у, нанес-ем
  .лицо 2
    е,,"13"             // нанес-е-шь, нанес-е-те
  .лицо 3
    '',,"32"            // нанес-ет, нанес-ут
.время П        // прошедшее время
    '',,"36"            // нанес-(-,-ла,-ло,-ли)
  .действ
    ш,,"16"             // нанес-ш-ий
  .страд
    ен,,"6"             // нанес-ен-ный
  .деепр
    я                   // нанес-я
    ши                  // нанес-ши
}

.тип св 7b/b4"9"Ф, св 7b/b4"9"Ф$
//---------------------------------------------------------------------------
// Пример: понести
//---------------------------------------------------------------------------
{
.инфинитив
    ти,,,"2"            // понес-ти(сь)
.повел
    и,,"28"             // понес-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"29"            // понес-у(сь), понес-ем(ся)
  .лицо 2
    е,,"9"              // понес-е-шь(ся), понес-е-те(сь)
  .лицо 3
    '',,"30"            // понес-ет(ся), понес-ут(ся)
.время П        // прошедшее время
    '',,"38"            // понес-(-(ся),-ла(сь),-ло(сь),-ли(сь))
  .действ
    ш,,"5"              // понес-ш-ий(ся)
  .страд
    ен,,"6"             // понес-ен-ный
  .деепр
    я,,,"2"             // понес-я(сь)
    ши,,,"2"            // понес-ши(сь)
}

