// Подтип 7b/bA - глаголы на -сти с пометой -б-

.тип нсв 7b/bA
//---------------------------------------------------------------------------
// Пример: грести
//---------------------------------------------------------------------------
{
.инфинитив
    сти,,,"2"           // гре-сти(сь)
.повел
    би,,"11"            // гре-би(те)
.время Н        // настоящее время
  .лицо 1
    б,,"31"             // гре-б-у, гре-б-ем
  .лицо 2
    бе,,"13"            // гре-бе-шь, гре-бе-те
  .лицо 3
    б,,"30"             // гре-б-ет(ся), гре-б-ут(ся)
  .действ
    бущ,,"5"            // гре-бущ-ий(ся)
  .деепр
    бя                  // гре-бя
.время П        // прошедшее время
    б,,"38"             // гре-б(-(ся),-ла(сь),-ло(сь),-ли(сь))
  .действ
    бш,,"5"             // гре-бш-ий(ся)
  .деепр
    бши                 // гре-бши
}

.тип нсв 7b/bAФ
//---------------------------------------------------------------------------
// Пример: скрести
//---------------------------------------------------------------------------
{
.инфинитив
    сти,,,"2"           // скре-сти(сь)
.повел
    би,,"28"            // скре-би(те)(сь)
.время Н        // настоящее время
  .лицо 1
    б,,"29"             // скре-б-у(сь), скре-б-ем(ся)
  .лицо 2
    бе,,"9"             // скре-бе-шь(ся), скре-бе-те(сь)
  .лицо 3
    б,,"30"             // скре-б-ет(ся), скре-б-ут(ся)
  .действ
    бущ,,"5"            // скре-бущ-ий(ся)
  .деепр
    бя,,,"2"            // скре-бя(сь)
.время П        // прошедшее время
    б,,"38"             // скре-б(-(ся),-ла(сь),-ло(сь),-ли(сь))
  .действ
    бш,,"5"             // скре-бш-ий(ся)
  .деепр
    бши,,,"2"           // скре-бши(сь)
}

.тип св 7b/bA, св 7b/bA$
//---------------------------------------------------------------------------
// Пример: погрести
//---------------------------------------------------------------------------
{
.инфинитив
    сти                 // погре-сти
.повел
    би,,"11"            // погре-би(те)
.время Б        // будущее время
  .лицо 1
    б,,"31"             // погре-б-у, погре-б-ем
  .лицо 2
    бе,,"13"            // погре-бе-шь, погре-бе-те
  .лицо 3
    б,,"32"             // погре-б-ет, погре-б-ут
.время П        // прошедшее время
    б,,"36"             // погре-б(-,-ла,-ло,-ли)
  .действ
    бш,,"16"            // погре-бш-ий
  .страд
    бен,,"6"            // погре-бен-ный
  .деепр
    бши                 // погре-бши
}

.тип св 7b/bAФ, св 7b/bAФ$
//---------------------------------------------------------------------------
// Пример: заскрести
//---------------------------------------------------------------------------
{
.инфинитив
    сти,,,"2"           // заскре-сти(сь)
.повел
    би,,"28"            // заскре-би(те)(сь)
.время Б        // будущее время
  .лицо 1
    б,,"29"             // заскре-б-у(сь), заскре-б-ем(ся)
  .лицо 2
    бе,,"9"             // заскре-бе-шь(ся), заскре-бе-те(сь)
  .лицо 3
    б,,"30"             // заскре-б-ет(ся), заскре-б-ут(ся)
.время П        // прошедшее время
    б,,"38"             // заскре-б(-(ся),-ла(сь),-ло(сь),-ли(сь))
  .действ
    бш,,"5"             // заскре-бш-ий(ся)
  .страд
    бен,,"6"            // заскре-бен-ный
  .деепр
    бши,,,"2"           // заскре-бши(сь)
}

