
.таблица "1"
{
  ся,   вф
}

.таблица "2"
{
  сь,   вф
}

.таблица "3"
{
.число Е
  .род м
    '',,,"1"
  .род ж
    а,,,"2"
  .род с
    о,,,"2"
  .род
.число М
    и,,,"2"
}

.таблица "4"
{
//
// Страдательные причастия настоящего времени и прошедшего времени для
// типа словоизменения 3, например, дела-ем-ый, гнут-ый.
//
  .число Е
  .род м
    ый , И
    ого, Р
    ому, Д
    ый , Вн
    ого, Во
    ым , Т
    ом , П
    '' , кф
  .род ж
    ая , И
    ой , Р
    ой , Д
    ую , В
    ой , Т
    ою , Т
    ой , П
    а  , кф
  .род с
    ое , И
    ого, Р
    ому, Д
    ое , Вн
    ого, Во
    ым , Т
    ом , П
    о  , кф
  .род
  .число М
    ые , И
    ых , Р
    ым , Д
    ые , Вн
    ых , Во
    ыми, Т
    ых , П
    ы  , кф
}

.таблица "5"
{
// Действительные причастия прошедшего времени,
// например, (с)дела-вш-ий
  .число Е
  .род м
    ий , И,,"1"
    его, Р,,"1"
    ему, Д,,"1"
    ий , Вн,,"1"
    его, Во,,"1"
    им , Т,,"1"
    ем , П,,"1"
  .род ж
    ая , И,,"1"
    ей , Р,,"1"
    ей , Д,,"1"
    ую , В,,"1"
    ей , Т,,"1"
    ею , Т,,"1"
    ей , П,,"1"
  .род с
    ее , И,,"1"
    его, Р,,"1"
    ему, Д,,"1"
    ее , Вн,,"1"
    его, Во,,"1"
    им , Т,,"1"
    ем , П,,"1"
  .род
  .число М
    ие , И,,"1"
    их , Р,,"1"
    им , Д,,"1"
    ие , Вн,,"1"
    их , Во,,"1"
    ими, Т,,"1"
    их , П,,"1"
}

.таблица "6"
{
// Страдательные причастия прошедшего времени,
// например, (с)делан-ный
  .число Е
  .род м
    ный , И
    ного, Р
    ному, Д
    ный , Вн
    ного, Во
    ным , Т
    ном , П
    ''  , кф
  .род ж
    ная , И
    ной , Р
    ной , Д
    ную , В
    ной , Т
    ною , Т
    ной , П
    а   , кф
  .род с
    ное , И
    ного, Р
    ному, Д
    ное , Вн
    ного, Во
    ным , Т
    ном , П
    о   , кф
  .род
  .число М
    ные , И
    ных , Р
    ным , Д
    ные , Вн
    ных , Во
    ными, Т
    ных , П
    ы   , кф
}

.таблица "7"
{
  .число Е
    '',,,"1"
  .число М
    те,,,"2"
}

.таблица "8"
{
  .число Е
    ю,,,"2"             // дела-ю(сь), теря-ю(сь)
  .число М
    ем,,,"1"            // дела-ем(ся), теря-ем(ся)
}

.таблица "9"
{
  .число Е
    шь,,,"1"            // дела-е-шь(ся), теря-е-шь(ся)
  .число М
    те,,,"2"            // дела-е-те(сь), теря-е-те(сь)
}

.таблица "10"
{
  .число Е
    ет,,,"1"            // дела-ет(ся), теря-ет(ся)
  .число М
    ют,,,"1"            // дела-ют(ся), теря-ют(ся)
}

.таблица "11"
// ***
// * Повелительное наклонение типа 1a, 2a, 2b, 3b (св и нсв),
// * без возвратных форм
// ***
{
  .число Е
    ''                  // (раз)долба-й-
  .число М
    те                  // (раз)долба-й-те
}

// Личные формы настоящего времени глаголов типа 1a

.таблица "12"
// ***
// * Первое лицо типа словоизменения 1a (св и нсв),
// * не имеющее возвратных форм
// ***
{
  .число Е
    ю                   // (раз)долба-ю
  .число М
    ем                  // (раз)долба-ем
}

.таблица "13"
// ***
// * Второе лицо типа словоизменения 1a (св и нсв),
// * не имеющее возвратных форм
// ***
{
  .число Е
    шь                  // (раз)долба-ешь
  .число М
    те                  // (раз)долба-ете
}

.таблица "14"
// ***
// * Третье лицо типа словоизменения 1a (св и нсв),
// * не имеющее возвратных форм
// ***
{
  .число Е
    ет                  // (раз)долба-ет
  .число М
    ют                  // (раз)долба-ют
}

// Формы прошедшего времени непереходных глаголов

.таблица "15"
// ***
// * Формы прошедшего времени изменения глаголов по родам, не имеющие
// * возвратных форм
// ***
{
.число Е
  .род м
    ''
  .род ж
    а
  .род с
    о
  .род
.число М
    и
}

// Окончания действительных причастий для непереходных глаголов.
// Отличаются тем, что не могут иметь возвратных форм.

.таблица "16"
{
// Действительные причастия прошедшего времени,
// например, (с)дела-вш-ий, но без возможного окончания -ся-
  .число Е
  .род м
    ий , И
    его, Р
    ему, Д
    ий , Вн
    его, Во
    им , Т
    ем , П
  .род ж
    ая , И
    ей , Р
    ей , Д
    ую , В
    ей , Т
    ею , Т
    ей , П
  .род с
    ее , И
    его, Р
    ему, Д
    ее , Вн
    его, Во
    им , Т
    ем , П
  .род
  .число М
    ие , И
    их , Р
    им , Д
    ие , Вн
    их , Во
    ими, Т
    их , П
}

.таблица "17"           // Повелительное наклонение с возвратными формами
{
  .число Е
    '',,"1"             // -ся
  .число М
    те,,"2"             // -тесь
}

.таблица "18"
{
  .число Е
    ю,,"2"              // -юсь
  .число М
    ем,,"1"             // -емся
}

.таблица "19"
{
  .число Е
    шь,,"1"               // -шься
  .число М
    те,,"2"               // -тесь
}

.таблица "20"
{
  .число Е
    ет,,"1"             // -ется
  .число М
    ют,,"1"             // -ются
}

.таблица "21"
{
// Действительные причастия прошедшего времени,
// например, (с)дела-вш-ий
  .число Е
  .род м
    ий , И,"1"
    его, Р,"1"
    ему, Д,"1"
    ий , Вн,"1"
    его, Во,"1"
    им , Т,"1"
    ем , П,"1"
  .род ж
    ая , И,"1"
    ей , Р,"1"
    ей , Д,"1"
    ую , В,"1"
    ей , Т,"1"
    ею , Т,"1"
    ей , П,"1"
  .род с
    ее , И,"1"
    его, Р,"1"
    ему, Д,"1"
    ее , Вн,"1"
    его, Во,"1"
    им , Т,"1"
    ем , П,"1"
  .род
  .число М
    ие , И,"1"
    их , Р,"1"
    им , Д,"1"
    ие , Вн,"1"
    их , Во,"1"
    ими, Т,"1"
    их , П,"1"
}

.таблица "22"
{
.число Е
  .род м
    '',,"1"
  .род ж
    а,,"2"
  .род с
    о,,"2"
  .род
.число М
    и,,"2"
}

.таблица "23"
// Формальная таблица, не отражающая реального положения вещей при изменении
// безличных глаголов, однако необходимая в рамках применяемой модели опи-
// сания словоизменения глаголов (по правилу имени В. Пархоменко).
{
  .род с
    о
}

.таблица "24"
// Формальная таблица, не отражающая реального положения вещей при изменении
// безличных глаголов, однако необходимая в рамках применяемой модели опи-
// сания словоизменения глаголов (по правилу имени В. Пархоменко).
{
  .число Е
  .род с
    о,,,"2"
}

.таблица "25"           // прояснивается
{
  .число Е
    ет,,,"1"            // прояснива-ет(ся)
}

.таблица "26"
{
.число Е
  .род с
    о,,"2"
}

.таблица "27"           // вздумается
{
  .число Е
    ет,,"1"
}

// Таблицы, введенные для типа 3

.таблица "28"
// Окончания повелительного наклонения для глаголов на -нуть, например,
// гни(сь), гните(сь), у которых возможны возвратные формы.
{
  .число Е
    '',,,"2"
  .число М
    те,,,"2"
}

.таблица "29"
// Окончания 1 лица наст. (буд. для с.в.) времени для глаголов типа 3
// (на -нуть), например, (со)гнуть
{
  .число Е
    у,,,"2"             // гн-у(сь)
  .число М
    ем,,,"1"            // гн-ем(ся)
}

.таблица "29_piss"
{
  .число Е
    у,,,"2"             // сс-у(сь)
  .число М
    ым,,,"1"            // сс-ым(ся)
}

.таблица "30"
// Окончания 3 лица наст. (буд. для с.в.) времени для глаголов типа 3
// (на -нуть), например, (со)гнуть
{
  .число Е
    ет,,,"1"            // гн-ет(ся)
  .число М
    ут,,,"1"            // гн-ут(ся)
}

.таблица "30_piss"
{
  .число Е
    ыт,,,"1"            // сс-ыт(ся)
  .число М
    ут,,,"1"            // сс-ут(ся)
}

.таблица "31"
// Окончания 1 лица наст. (буд. для с.в.) времени для глаголов типа 3,
// не имеющие возвратных форм.
// Пример: стегнуть - стегни(те)
{
  .число Е
    у
  .число М
    ем
}

.таблица "31_piss"
{
  .число Е
    у
  .число М
    ым
}

.таблица "32"
// Окончания 3 лица наст. (буд. для с.в.) времени для глаголов типа 3
// (на -нуть), например, (со)гнуть, без возвратных форм.

{
  .число Е
    ет                  // стегн-ет
  .число М
    ут                  // стегн-ут
}

.таблица "32_piss"
{
  .число Е
    ыт                  // сс-ыт
  .число М
    ут                  // сс-ут
}

.таблица "33"
// Окончания повелительного наклонения для глаголов на -нуться, например,
// улыбнись, улыбнитесь
{
  .число Е
    '',,"2"
  .число М
    те,,"2"
}

.таблица "34"
// Окончания 1 лица наст. (буд. для с.в.) времени для глаголов типа 3Я
// (на -нуться), например, встрепенуться
{
  .число Е
    у,,"2"             // встрепен-у(сь)
  .число М
    ем,,"1"            // встрепен-ем(ся)
}

.таблица "35"
// ***
// * Повелительное наклонение типа 3a1"3" (св и нсв),
// * без возвратных форм
// ***
{
  .число Е
    и                   // кашлян-и
  .число М
    ьте                 // кашлян-ьте
}

.таблица "36"
// ***
// * Формы прошедшего времени изменения глаголов типа 3°a, имеющих согласную
// * перед -нуть, по родам, не имеющие возвратных форм
// ***
{
.число Е
  .род м
    ''                  // ослаб-
  .род ж
    ла                  // ослаб-ла
  .род с
    ло                  // ослаб-ло
  .род
.число М
    ли                  // ослаб-ли
}

.таблица "37"
// ***
// * Формы прошедшего времени изменения глаголов типа 3°a, имеющих согласную
// * перед -нуть, по родам, имеющие обязательные возвратные формы
// ***
{
.число Е
  .род м
    '',,"1"             // свык-ся
  .род ж
    ла,,"2"             // свык-ла-сь
  .род с
    ло,,"2"             // свык-ло-сь
  .род
.число М
    ли,,"2"             // свык-ли-сь
}

.таблица "38"
// ***
// * Формы прошедшего времени изменения глаголов типа 3°a, имеющих согласную
// * перед -нуть, по родам, имеющие необязательные возвратные формы
// ***
{
.число Е
  .род м
    '',,,"1"            // подверг-ся
  .род ж
    ла,,,"2"            // подверг-ла-сь
  .род с
    ло,,,"2"            // подверг-ло-сь
  .род
.число М
    ли,,,"2"            // подверг-ли-сь
}

.таблица "39"
// Окончания 3 лица наст. (буд. для с.в.) времени для глаголов типа 3
// (на -нуть), например, (со)гнуть
{
  .число Е
    ет,,"1"             // -ется
  .число М
    ут,,"1"             // -утся
}

.таблица "40"
// ***
// * Формы прошедшего времени изменения глаголов типа 3°a"5""6", имеющих
// * согласную перед -нуть, по родам, без возвратных форм.
// ***
{
.число Е
  .род м
    нул                 // волг-нул
  .род ж
    ла                  // волг-ла
  .род с
    ло                  // волг-ло
  .род
.число М
    ли                  // волг-ли
}

.таблица "41"
// ***
// * Формы прошедшего времени изменения глаголов типа 3°a["5""6"], имеющих
// * согласную перед -нуть, по родам, имеющие обязательные возвратные формы
// ***
{
.число Е
  .род м
    '',,"1"             // вторг-ся
    нул,,"1"            // вторг-нулся
  .род ж
    ла,,"2"             // вторг-ла-сь
  .род с
    ло,,"2"             // вторг-ло-сь
  .род
.число М
    ли,,"2"             // вторг-ли-сь
}

.таблица "42"
// ***
// * Формы прошедшего времени изменения глаголов типа 3°a["5""6"], имеющих
// * согласную перед -нуть, по родам, имеющие необязательные возвратные формы
// ***
{
.число Е
  .род м
    '',,,"1"            // подверг-ся
    нул,,,"1"           // подверг-нул-ся
  .род ж
    ла,,,"2"            // подверг-ла-сь
  .род с
    ло,,,"2"            // подверг-ло-сь
  .род
.число М
    ли,,,"2"            // подверг-ли-сь
}

.таблица "43"
// ***
// * Формы прошедшего времени изменения глаголов типа 3°a["5""6"], имеющих
// * согласную перед -нуть, по родам, не имеющие возвратных форм
// ***
{
.число Е
  .род м
    ''                  // отверг-
    нул                 // отверг-нул
  .род ж
    ла                  // отверг-ла
  .род с
    ло                  // отверг-ло
  .род
.число М
    ли                  // отверг-ли
}

// *** Дополнительные таблицы типа 4 ***

.таблица "44"
{
  .число Е
    ю                   // дра-ю
  .число М
    им                  // дра-им
}

.таблица "45"
{
  .число Е
    ю,,,"2"             // кле-ю(сь)
  .число М
    им,,,"1"            // кле-им(ся)
}

.таблица "46"
{
  .число Е
    ю,,"2"              // бахвал-юсь
  .число М
    им,,"1"             // бахвал-имся
}

.таблица "47"
{
  .число Е
    ит                  // рыбал-ит
  .число М
    ят                  // рыбал-ят
}

.таблица "48"
{
  .число Е
    ит,,,"1"            // дра-ит(ся)
  .число М
    ят,,,"1"            // дра-ят(ся)
}

.таблица "49"
{
  .число Е
    ит,,"1"             // бахвал-ится
  .число М
    ят,,"1"             // бахвал-ятся
}

.таблица "50"
{
  .число Е
    ит,,"1"             // вер-ится
}

.таблица "51"
{
  .число Е
    и,,,"2"             // сахар-и(сь)
  .число М
    ьте,,,"2"           // сахар-ьте(сь)
}

.таблица "52"
{
  .число Е
    у                   // такелаж-у
  .число М
    им                  // такелаж-им
}

.таблица "53"
{
  .число Е
    ит,,,"1"            // такелаж-ит(ся)
  .число М
    ат,,,"1"            // такелаж-ат(ся)
}

.таблица "54"
{
  .число Е
    у,,,"2"             // будораж-у(сь)
  .число М
    им,,,"1"            // будораж-им(ся)
}

.таблица "55"
{
  .число Е
    у,,"2"              // кураж-усь
  .число М
    им,,"1"             // кураж-имся
}

.таблица "56"
{
  .число Е
    ит,,"1"             // кураж-ит(ся)
  .число М
    ат,,"1"             // кураж-ат(ся)
}

.таблица "57"
{
  .число Е
    ит                  // бродяж-ит
  .число М
    ат                  // бродяж-ат
}

.таблица "58"
//
// 1-е лицо подтипа 4a32
//
{
  .число Е
    лю
  .число М
    им
}

.таблица "59"
//
// 1-е лицо подтипа 4a32 с необязательными возвратными формами
//
{
  .число Е
    лю,,,"2"
  .число М
    им,,,"1"
}

.таблица "60"
//
// 1-е лицо подтипа 4a32 с обязательными возвратными формами
//
{
  .число Е
    лю,,"2"
  .число М
    им,,"1"
}

.таблица "61"
//
// Особенности в повелительном наклонении слов 4a["3"]
//
{
  .число Е
    ь
    и
  .число М
    ьте
}

.таблица "62"
//
// Особенности в повелительном наклонении слов 4a["3"]
//
{
  .число Е
    ь,,,"1"
    и,,,"2"
  .число М
    ьте,,,"2"
}

.таблица "63"
//
// Особенности в повелительном наклонении слов 4a["3"]
//
{
  .число Е
    ь,,"1"
    и,,"2"
  .число М
    ьте,,"2"
}

.таблица "64"
// Таблица 1 ед. наст. (буд.) затрудн.
{
  .число Е
    у, затрудн          // пылесош-у
  .число М
    им                  // пылесос-им
}

.таблица "65"
{
  .число Е
    ит                  // лиходад-ит
}

.таблица "66"
{
  .число Е
    ит,,,"1"            // разведр-ит(ся)
}

.таблица "67"
// Таблица 1 ед. наст. (буд.) затрудн.
{
  .число М
    им,,,"1"            // умилосерд-им(ся)
}

.таблица "68"           // недостанет
{
  .число Е
    ет
}

.таблица "69"
// Таблица 1 ед. наст. (буд.) затрудн.
{
  .число М
    им,,"1"             // очут-имся
}

.таблица "70"
// ***
// * Формы прошедшего времени изменения глаголов типа 3°a["5""6"], имеющих
// * согласную перед -нуть, по родам, не имеющие возвратных форм
// ***
{
.число Е
  .род м
    л                   // отверг-
    нул                 // отверг-нул
  .род ж
    ла                  // отверг-ла
  .род с
    ло                  // отверг-ло
  .род
.число М
    ли                  // отверг-ли
}

.таблица "71"
{
  .число Е
    лю
  .число М
    лем
    ем
}

.таблица "72"
{
  .число Е
    лет
    ет
  .число М
    лют
}

.таблица "73"
{
  .число Е
    лю,,,"2"
  .число М
    лем,,,"1"
    ем,,,"1"
}

.таблица "74"
{
  .число Е
    лет,,,"1"
    ет,,,"1"
  .число М
    лют,,,"1"
}

.таблица "75"
{
  .число Е
    гу
  .число М
    жим
}

.таблица "76"
{
  .число Е
    жит
  .число М
    гут
}

.таблица "77"
{
  .число Е
    гу,,,"2"
  .число М
    жим,,,"1"
}

.таблица "78"
{
  .число Е
    жит,,,"1"
  .число М
    гут,,,"1"
}

.таблица "79"
{
  .число Е
    гу,,"2"
  .число М
    жим,,"1"
}

.таблица "80"
{
  .число Е
    жит,,"1"
  .число М
    гут,,"1"
}

.таблица "81"
{
.число Е
  .род м
    ел                  // нач-ел
  .род ж
    ла                  // нач-ла
  .род с
    ло                  // нач-ло
  .род
.число М
    ли                  // нач-ли
}

.таблица "82"
{
.число Е
  .род м
    ел,,,"1"            // зач-ел(ся)
  .род ж
    ла,,,"2"            // зач-ла(сь)
  .род с
    ло,,,"2"            // зач-ло(сь)
  .род
.число М
    ли,,,"2"            // зач-ли(сь)
}

.таблица "83"
{
.число Е
    гу                  // мо-гу
.число М
    жем                 // мо-жем
}

.таблица "84"
{
  .число Е
    жет
  .число М
    гут
}

.таблица "85"
{
.число Е
    гу,,,"2"            // перемо-гу(сь)
.число М
    жем,,,"1"           // перемо-жем(ся)
}

.таблица "86"
{
  .число Е
    жет,,,"1"
  .число М
    гут,,,"1"
}

.таблица "87"
{
.число Е
    гу,,"2"             // разнемо-гу-сь
.число М
    жем,,"1"            // разнемо-жем-ся
}

.таблица "88"
{
  .число Е
    жет,,"1"            // разнемо-жет-ся
  .число М
    гут,,"1"            // разнемо-гут-ся
}

.таблица "89"
{
.число Е
    ку,,,"2"            // воло-ку(сь)
.число М
    чем,,,"1"           // воло-чем(ся)
}

.таблица "90"
{
  .число Е
    чет,,,"1"           // воло-чет(ся)
  .число М
    кут,,,"1"           // воло-кут(ся)
}

.таблица "91"
{
.число Е
    ку                  // те-ку
.число М
    чем                 // те-чем
}

.таблица "92"
{
  .число Е
    чет                 // те-чет
  .число М
    кут                 // те-кут
}

.таблица "93"
{
.число Е
    ку,,"2"             // отре-ку-сь
.число М
    чем,,"1"            // отре-чем-ся
}

.таблица "94"
{
  .число Е
    чет,,"1"            // отре-чет-ся
  .число М
    кут,,"1"            // отре-кут-ся
}

.таблица "95"
{
  .число Е
    м                   // изда-м
  .число М
    дим                 // изда-дим
}

.таблица "96"
{
  .число Е
    шь                  // изда-шь
  .число М
    дите                // изда-дите
}

.таблица "97"
{
  .число Е
    ст                  // изда-ст
  .число М
    дут                 // изда-дут
}

.таблица "98"
{
  .число Е
    м,,,"1"             // зада-м(ся)
  .число М
    дим,,,"1"           // зада-дим(ся)
}

.таблица "99"
{
  .число Е
    шь,,,"1"            // зада-шь(ся)
  .число М
    дите,,,"2"          // зада-дите(сь)
}

.таблица "100"
{
  .число Е
    ст,,,"1"            // зада-ст(ся)
  .число М
    дут,,,"1"           // зада-дут(ся)
}

.таблица "101"
{
  .число Е
    м,,"1"              // вда-м-ся
  .число М
    дим,,"1"            // вда-дим-ся
}

.таблица "102"
{
  .число Е
    шь,,"1"             // вда-шь-ся
  .число М
    дите,,"2"           // вда-дите-сь
}

.таблица "103"
{
  .число Е
    ст,,"1"             // вда-ст-ся
  .число М
    дут,,"1"            // вда-дут-ся
}

.таблица "104"
{
  .число Е
    ст,,"1"             // возда-ст-ся
}

.таблица "105"
{
  .число Е
    ст                  // пое-ст
  .число М
    дят                 // пое-дят
}

.таблица "106"
{
  .число Е
    ст,,,"1"            // е-ст(ся)
  .число М
    дят,,,"1"           // е-дят(ся)
}

.таблица "107"
{
  .число Е
    ст,,"1"             // прие-ст-ся
  .число М
    дят,,"1"            // прие-дят-ся
}

.таблица "108"
{
.число Е
  .род м
    ел,,"1"             // разош-ел-ся)
  .род ж
    ла,,"2"             // разош-ла-сь)
  .род с
    ло,,"2"             // разош-ло-сь)
  .род
.число М
    ли,,"2"             // разош-ли-сь)
}

.таблица "109"
{
  .число Е
    у                   // стон-у
    аю                  // стон-аю
  .число М
    ем                  // стон-ем
}

.таблица "110"
{
  .число Е
    чу                  // хо-чу
  .число М
    тим                 // хо-тим
}

.таблица "111"
{
  .число Е
    чешь                // хо-чешь
  .число М
    тите                // хо-тите
}

.таблица "112"
{
  .число Е
    чет                 // хо-чет
  .число М
    тят                 // хо-тят
}

.таблица "113"
{
  .число Е
    у,затрудн
  .число М
    ем
}

.таблица "114"
{
  .число М
    им                  // сбонд-им
}

.таблица "115"
{
  .число Е
    '',затрудн,,"2"     // простри-сь
  .число М
    те,затрудн,,"2"     // простри-те-сь
}

.таблица "116"
{
  .число Е
    у,затрудн,,"2"      // простр-у-сь
  .число М
    ем,затрудн,,"1"     // простр-ем-ся
}

.таблица "117"
{
  .число Е
    шь,затрудн,,"1"     // простре-шь-ся
  .число М
    те,затрудн,,"2"     // простре-те-сь
}

.таблица "118"
{
  .число Е
    ет,затрудн,,"1"     // простр-ет-ся
  .число М
    ут,затрудн,,"1"     // простр-ут-ся
}

.таблица "pack01"
{
.инфинитив
    ть,,,"1"
.повел
    й,,"11"  
}

