// Изолированные глаголы на -клясть.
// Обозначены, как isol_6.

.тип нсв isol_6b/cФ
//---------------------------------------------------------------------------
// Пример: клясть
//---------------------------------------------------------------------------
{
.инфинитив
    сть,,,"1"           // кля-сть(ся)
.повел
    ни,,"28"            // кля-ни(сь), кля-ни-те(сь)
.время Н        // настоящее время
  .лицо 1
    н,,"29"             // кля-н-у(сь), кля-н-ем(ся)
  .лицо 2
    не,,"9"             // кля-не-шь(ся), кля-не-те(сь)
  .лицо 3
    н,,"30"             // кля-н-ет(ся), кля-н-ут(ся)
  .действ
    нущ,,"5"            // кля-нущ-ий(ся)
  .деепр
    ня,,,"2"            // кля-ня(сь)
.время П        // прошедшее время
    л,,"3"              // кля-л(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    вш,,"5"             // кля-вш-ий(ся)
  .страд
    т,,"4"              // кля-т-ый
  .деепр
    в                   // кля-в
    вши,,,"2"           // кля-вши(сь)
}

.тип св isol_6b/c$
//---------------------------------------------------------------------------
// Пример: проклясть
//---------------------------------------------------------------------------
{
.инфинитив
    сть                 // прокля-сть
.повел
    ни,,"11"            // прокля-ни, прокля-ни-те
.время Б        // будущее время
  .лицо 1
    н,,"31"             // прокля-н-у, прокля-н-ем
  .лицо 2
    не,,"13"            // прокля-не-шь, прокля-не-те
  .лицо 3
    н,,"32"             // прокля-н-ет, прокля-н-ут
.время П        // прошедшее время
    л,,"15"             // прокля-л(-,-а,-о,-и)
  .действ
    вш,,"16"            // прокля-вш-ий
  .страд
    т,,"4"              // прокля-т-ый
  .деепр
    в                   // прокля-в
    вши                 // прокля-вши
}

.тип св isol_6b/cФ$
//---------------------------------------------------------------------------
// Пример: заклясть
//---------------------------------------------------------------------------
{
.инфинитив
    сть,,,"1"           // закля-сть(ся)
.повел
    ни,,"28"            // закля-ни(сь), закля-ни-те(сь)
.время Б        // будущее время
  .лицо 1
    н,,"29"             // закля-н-у(сь), закля-н-ем(ся)
  .лицо 2
    не,,"9"             // закля-не-шь(ся), закля-не-те(сь)
  .лицо 3
    н,,"30"             // закля-н-ет(ся), закля-н-ут(ся)
.время П        // прошедшее время
    л,,"3"              // закля-л(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    вш,,"5"             // закля-вш-ий(ся)
  .страд
    т,,"4"              // закля-т-ый
  .деепр
    в                   // закля-в
    вши,,,"2"           // закля-вши(сь)
}

.тип св isol_6b/c''Я
//---------------------------------------------------------------------------
// Пример: поклясться
//---------------------------------------------------------------------------
{
.инфинитив
    сть,,"1"            // покля-сть-ся
.повел
    ни,,"33"            // покля-ни-сь, покля-ни-те-сь
.время Б        // будущее время
  .лицо 1
    н,,"34"             // покля-н-у-сь, покля-н-ем-ся
  .лицо 2
    не,,"19"            // покля-не-шь-ся, покля-не-те-сь
  .лицо 3
    н,,"39"             // покля-н-ет-ся, покля-н-ут-ся
.время П        // прошедшее время
    л,,"22"             // покля-л(-ся,-а-сь,-о-сь,-ись)
  .действ
    вш,,"21"            // покля-вш-ий-ся
  .деепр
    вши,,"2"            // покля-вши-сь
}

