// Изолированные глаголы на -дать.
// Обозначены, как isol_1.
// Только глаголы совершенного вида.

.тип св isol_1$
//---------------------------------------------------------------------------
// Пример: издать
//---------------------------------------------------------------------------
{
.инфинитив
    ть                  // изда-ть
.повел
    й,,"11"             // изда-й, изда-й-те
.время Б        // будущее время
  .лицо 1
    '',,"95"            // изда-м, изда-дим
  .лицо 2
    '',,"96"            // изда-шь, изда-дите
  .лицо 3
    '',,"97"            // изда-ст, изда-дут
.время П        // прошедшее время
    л,,"15"             // изда-л(-,-а,-о,-и)
  .действ
    вш,,"16"            // изда-вш-ий
  .страд
    н,,"6"              // изда-н-ный
  .деепр
    в                   // изда-в
    вши                 // изда-вши
}

.тип св isol_1Ф$
//---------------------------------------------------------------------------
// Пример: задать
//---------------------------------------------------------------------------
{
.инфинитив
    ть,,,"1"            // зада-ть(ся)
.повел
    й,,"7"              // зада-й(ся), зада-й-те(сь)
.время Б        // будущее время
  .лицо 1
    '',,"98"            // зада-м(ся), зада-дим(ся)
  .лицо 2
    '',,"99"            // зада-шь(ся), зада-дите(сь)
  .лицо 3
    '',,"100"           // зада-ст(ся), зада-дут(ся)
.время П        // прошедшее время
    л,,"3"              // зада-л(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    вш,,"5"             // зада-вш-ий(ся)
  .страд
    н,,"6"              // зада-н-ный
  .деепр
    в                   // зада-в
    вши,,,"2"           // зада-вши(сь)
}

.тип св isol_1_ра/ро_Ф$
//---------------------------------------------------------------------------
// Пример: раздать
//---------------------------------------------------------------------------
{
.инфинитив
    аздать,,,"1"            // р-аздать(ся)
.повел
    аздай,,"7"              // р-азда-й(ся), р-азда-й-те(сь)
.время Б        // будущее время
  .лицо 1
    азда,,"98"              // р-азда-м(ся), р-азда-дим(ся)
  .лицо 2
    азда,,"99"              // р-азда-шь(ся), р-азда-дите(сь)
  .лицо 3
    азда,,"100"             // р-азда-ст(ся), р-азда-дут(ся)
.время П        // прошедшее время
    аздал,,"3"              // р-азда-л(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    аздавш,,"5"             // р-азда-вш-ий(ся)
  .страд
    оздан,,"6"              // р-озда-н-ный
  .деепр
    аздав                   // р-азда-в
    аздавши,,,"2"           // р-азда-вши(сь)
}

.тип св isol_1Я$
//---------------------------------------------------------------------------
// Пример: вдаться
//---------------------------------------------------------------------------
{
.инфинитив
    ть,,"1"             // вда-ть-ся
.повел
    й,,"17"             // вда-й-ся, вда-й-те-сь
.время Б        // будущее время
  .лицо 1
    '',,"101"           // вда-м-ся, вда-дим-ся
  .лицо 2
    '',,"102"           // вда-шь-ся, вда-дите-сь
  .лицо 3
    '',,"103"           // вда-ст-ся, вда-дут-ся
.время П        // прошедшее время
    л,,"22"             // вда-л(-ся,-а-сь,-о-сь,-и-сь)
  .действ
    вш,,"21"            // вда-вш-ий-ся
  .деепр
    вши,,"2"            // вда-вши-сь
}

.тип св isol_1БЯ$
//---------------------------------------------------------------------------
// Пример: воздаться
//---------------------------------------------------------------------------
{
.инфинитив
    ть,,"1"             // возда-ть-ся
.время Б        // будущее время
  .лицо 3
    ,,"104"             // возда-ст-ся
.время П        // прошедшее время
    л,,"26"             // возда-л-о-сь
}

