.тип св_нп isol_10b/b"9"Ф$
//---------------------------------------------------------------------------
// Пример: прийти
//---------------------------------------------------------------------------
{
.инфинитив
    йти,,,"2"           // при-йти(сь)
.повел
    ди,,"28"            // при-ди(сь), при-ди-те(сь)
.время Б        // будущее время
  .лицо 1
    д,,"29"             // при-д-у(сь), при-д-ем(ся)
  .лицо 2
    де,,"9"             // при-де-шь(ся), при-де-те(сь)
  .лицо 3
    д,,"30"             // при-д-ет(ся), при-д-ут(ся)
.время П        // прошедшее время
    ш,,"82"             // при-ш(-ел(ся),-ла(сь),-ло(сь),-ли(сь))
  .действ
    шедш,,"5"           // при-шедш-ий(ся)
  .деепр
    дя,,,"2"            // при-дя(сь)
    шедши,,,"2"         // при-шедши(сь)
}
