// Изолированные глаголы на -есть.
// Обозначены, как isol_3.

.тип нсв isol_3b
//---------------------------------------------------------------------------
// Пример: есть
//---------------------------------------------------------------------------
{
.инфинитив
    сть,,,"1"           // е-сть(ся)
.повел
    шь,,"11"            // е-шь(те)
.время Н        // настоящее время
  .лицо 1
    '',,"95"            // е-м, е-дим
  .лицо 2
    '',,"96"            // е-шь, е-дите
  .лицо 3
    '',,"106"           // е-ст(ся), е-дят(ся)
  .действ
    дящ,,"5"            // е-дящ-ий(ся)
.время П        // прошедшее время
    л,,"3"              // е-л(-(ся),-а(сь),-о(сь),-и)
  .действ
    вш,,"5"             // е-вш-ий(ся)
  .страд
    ден,,"6"            // е-ден-ный
  .деепр
    в                   // е-в
    вши                 // е-вши
}

.тип св isol_3b, св isol_3a$, св isol_3b$
//---------------------------------------------------------------------------
// Пример: поесть
//---------------------------------------------------------------------------
{
.инфинитив
    сть                 // пое-сть
.повел
    шь,,"11"            // пое-шь(те)
.время Б        // будущее время
  .лицо 1
    '',,"95"            // пое-м, пое-дим
  .лицо 2
    '',,"96"            // пое-шь, пое-дите
  .лицо 3
    '',,"105"           // пое-ст, пое-дят
.время П        // прошедшее время
    л,,"15"             // пое-л(-,-а,-о,-и)
  .действ
    вш,,"16"            // пое-вш-ий
  .страд
    ден,,"6"            // пое-ден-ный
  .деепр
    в                   // пое-в
    вши                 // пое-вши
}

.тип св isol_3bФ$
//---------------------------------------------------------------------------
// Пример: заесть
//---------------------------------------------------------------------------
{
.инфинитив
    сть,,,"1"           // зае-сть(ся)
.повел
    шь,,"7"             // зае-шь(ся), за-ешь-те(сь)
.время Б        // будущее время
  .лицо 1
    '',,"98"            // зае-м(ся), зае-дим(ся)
  .лицо 2
    '',,"99"            // зае-шь(ся), зае-дите(сь)
  .лицо 3
    '',,"106"           // зае-ст(ся), зае-дят(ся)
.время П        // прошедшее время
    л,,"3"              // зае-л(-(ся),-а(сь),-о(сь),-и)
  .действ
    вш,,"5"             // зае-вш-ий(ся)
  .страд
    ден,,"6"            // зае-ден-ный
  .деепр
    в                   // зае-в
    вши,,,"2"           // зае-вши(сь)
}

.тип св isol_3bЯ$
//---------------------------------------------------------------------------
// Пример: приесться
//---------------------------------------------------------------------------
{
.инфинитив
    сть,,"1"            // прие-сть-ся
.повел
    шь,,"17"            // прие-шь-ся, при-ешь-те-сь
.время Б        // будущее время
  .лицо 1
    '',,"101"           // прие-м-ся, прие-дим-ся
  .лицо 2
    '',,"102"           // прие-шь-ся, прие-дите-сь
  .лицо 3
    '',,"107"           // прие-ст-ся, прие-дят-ся
.время П        // прошедшее время
    л,,"22"             // прие-л(-ся,-ась,-ось,-ись)
  .действ
    вш,,"21"            // прие-вш-ий-ся
  .деепр
    вши,,"2"            // прие-вши-сь
}

.тип св_нп isol_3b$
//---------------------------------------------------------------------------
// Пример: надоесть
//---------------------------------------------------------------------------
{
.инфинитив
    сть                 // надое-сть
.повел
    шь,,"11"            // надое-шь(те)
.время Б        // будущее время
  .лицо 1
    '',,"95"            // надое-м, надое-дим
  .лицо 2
    '',,"96"            // надое-шь, надое-дите
  .лицо 3
    '',,"105"           // надое-ст, надое-дят
.время П        // прошедшее время
    л,,"15"             // надое-л(-,-а,-о,-и)
  .действ
    вш,,"16"            // надое-вш-ий
  .деепр
    в                   // надое-в
    вши                 // надое-вши
}

