// Тип 10

.тип св 10a$
//***************************************************************************
// Пример: выколоть
//***************************************************************************
{
.инфинитив
    оть                 // выкол-оть
.повел
    и,,"11"             // выкол-и, выкол-и-те
.время Б        // будущее время
  .лицо 1
    '',,"12"            // выкол-ю, выкол-ем
  .лицо 2
    е,,"13"             // выкол-е-шь, выкол-е-те
  .лицо 3
    '',,"14"            // выкол-ет, выкол-ют
.время П        // прошедшее время
    ол,,"15"            // выкол-ол (-,-а,-о,-и)
  .действ
    овш,,"16"           // выкол-овш -> (-ий)
  .страд
    от,,"4"             // выкол-от -> (-ый,-,-а,-о,-ы)
  .деепр
    ов                  // выкол-ов
    овши                // выкол-овши
}

.тип св 10aФ, св 10aФ$
//***************************************************************************
// Пример: выпороть(ся)
//***************************************************************************
{
.инфинитив
    оть,,,"1"           // выпор-оть(ся)
.повел
    и,,"28"             // выпор-и(сь), выпор-и-те(сь)
.время Б        // будущее время
  .лицо 1
    '',,"8"             // выпор-ю(сь), выпор-ем(ся)
  .лицо 2
    е,,"9"              // выпор-е-шь(ся), выпор-е-те(сь)
  .лицо 3
    '',,"10"            // выпор-ет(ся), выпор-ют(ся)
.время П        // прошедшее время
    ол,,"3"             // выпор-ол (-(ся),-а(сь),-о(сь),-и)
  .действ
    овш,,"5"            // выпор-овш -> (-ий(ся))
  .страд
    от,,"4"             // выпор-от -> (-ый,-,-а,-о,-ы)
  .деепр
    ов                  // выпор-ов
    овши,,,"2"          // выпор-овши(сь)
}

.тип св 10a@Ф$
//***************************************************************************
// Пример: вымолоть(ся)
//***************************************************************************
{
.инфинитив
    оть,,,"1"           // вымол-оть(ся)
.повел
    и,,"28"             // вымел-и(сь), вымел-и-те(сь)
.время Б        // будущее время
  .лицо 1
    '',,"8"             // вымел-ю(сь), вымел-ем(ся)
  .лицо 2
    е,,"9"              // вымел-е-шь(ся), вымел-е-те(сь)
  .лицо 3
    '',,"10"            // вымел-ет(ся), вымел-ют(ся)
.время П        // прошедшее время
    ол,,"3"             // вымол-ол (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    овш,,"5"            // вымол-овш -> (-ий(ся))
  .страд
    от,,"4"             // вымол-от -> (-ый,-,-а,-о,-ы)
  .деепр
    ов                  // вымол-ов
    овши,,,"2"          // вымол-овши(сь)
}

