.тип св 1a1$
//---------------------------------------------------------------------------
// Примеры: подровнять
//---------------------------------------------------------------------------
{
.инфинитив
    ять                 // подровн-ять
.повел
    яй,,"11"            // подровн-яй(те)
.время Б        // будущее время
  .лицо 1
    я,,"12"             // подровн-я-ю, подровн-я-ем
  .лицо 2
    яе,,"13"            // подровн-яе-шь, подровн-яе-те
  .лицо 3
    я,,"14"             // подровн-я-ет, подровн-я-ют
.время П        // прошедшее время
    ял,,"15"            // подровн-ял(-,-а,-о,-и)
  .действ
    явш,,"16"           // подровня-явш-ий
  .страд
    ен,,"6"             // подровн-ен-ный
  .деепр
    яв                  // подровн-яв
    явши                // подровн-явши
}

.тип св 1a1Ф$
//---------------------------------------------------------------------------
// Примеры: подравнять
//---------------------------------------------------------------------------
{
.инфинитив
    ять,,,"1"           // подравн-ять(ся)
.повел
    яй,,"7"             // подравн-яй(ся), подравн-яй-те(сь)
.время Б        // будущее время
  .лицо 1
    я,,"8"              // подравн-я-ю(сь), подравн-я-ем(ся)
  .лицо 2
    яе,,"9"             // подравн-яе-шь(ся), подравн-яе-те(сь)
  .лицо 3
    я,,"10"             // подравн-я-ет(ся), подравн-я-ют(ся)
.время П        // прошедшее время
    ял,,"3"             // подравн-ял(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    явш,,"5"            // подравн-явш-ий(ся)
  .страд
    ен,,"6"             // подравн-ен-ный
  .деепр
    яв                  // подравн-яв
    явши,,,"2"          // подравн-явши(сь)
}

