.тип нсв 4c4, нсв 4c4$
// -------------------------------------------------------------------------
// Пример: будить
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // буд-ить(ся)
.повел
    и,,"11"             // буд-и, буд-и-те
.время Н        // настоящее время
  .лицо 1
    '',,"52"            // бу|ж|-у, буд-им
  .лицо 2
    и,,"13"             // буд-и-шь, буд-и-те
  .лицо 3
    '',,"48"            // буд-ит(ся), буд-ят(ся)
  .действ           // действительное причастие
    ящ,,"5"             // буд-ящ-ий(ся), ая и т. д.
  .страд
    им,,"4"             // буд-им-ый
  .деепр
    я                   // буд-я
.время П        // прошедшее время
    ил,,"3"             // буд-ил (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    ивш,,"5"            // буд-ивш-ий(ся)
  .страд
    ен,,"6"             // бу|ж|-ен-ный
  .деепр
    ив                  // буд-ив
    ивши                // буд-ивши
}

.тип нсв 4c4Ф, нсв 4b//4c4Ф
// -------------------------------------------------------------------------
// Пример: цедить(ся), винтить(ся)
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // цед-ить(ся)
.повел
    и,,"28"             // цед-и(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"54"            // це|ж|-у(сь), цед-им(ся)
  .лицо 2
    и,,"9"              // цед-и-шь(ся), цед-и-те(сь)
  .лицо 3
    '',,"48"            // цед-ит(ся), цед-ят(ся)
  .действ           // действительное причастие
    ящ,,"5"             // цед-ящ-ий(ся), ая и т. д.
  .страд
    им,,"4"             // цед-им-ый
  .деепр
    я,,,"2"             // цед-я(сь)
.время П        // прошедшее время
    ил,,"3"             // цед-ил (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    ивш,,"5"            // цед-ивш-ий(ся)
  .страд
    ен,,"6"             // це|ж|-ен-ный
  .деепр
    ив                  // цед-ив
    ивши,,,"2"          // цед-ивши(сь)
}

.тип нсв 4c4Ф$, нсв 4c4!Ф, нсв 4c4?Ф
// -------------------------------------------------------------------------
// Пример: обзаводить(ся)
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // обзавод-ить(ся)
.повел
    и,,"28"             // обзавод-и(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"54"            // обзаво|ж|-у(сь), обзавод-им(ся)
  .лицо 2
    и,,"9"              // обзавод-и-шь(ся), обзавод-и-те(сь)
  .лицо 3
    '',,"48"            // обзавод-ит(ся), обзавод-ят(ся)
  .действ           // действительное причастие
    ящ,,"5"             // обзавод-ящ-ий(ся), ая и т. д.
  .страд
    им,,"4"             // обзавод-им-ый
  .деепр
    я,,,"2"             // обзавод-я(сь)
.время П        // прошедшее время
    ил,,"3"             // обзавод-ил (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    ивш,,"5"            // обзавод-ивш-ий(ся)
  .деепр
    ив                  // обзавод-ив
    ивши,,,"2"          // обзавод-ивши(сь)
}

.тип нсв 4c4Я$
// -------------------------------------------------------------------------
// Пример: расходиться
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,"1"            // расход-иться
.повел
    и,,"33"             // расход-и(те)сь
.время Н        // настоящее время
  .лицо 1
    '',,"55"            // расхо|ж|-усь, расход-имся
  .лицо 2
    и,,"19"             // расход-и-шься, расход-и-тесь
  .лицо 3
    '',,"49"            // расход-ится, расход-ятся
  .действ           // действительное причастие
    ящ,,"21"            // расход-ящ-ийся
  .деепр
    я,,"2"              // расход-ясь
.время П        // прошедшее время
    ил,,"22"            // расход-ил (-ся,-ась,-ось,-ись)
  .действ
    ивш,,"21"           // расход-ивш-ийся
  .деепр
    ивши,,"2"           // расход-ившись
}

.тип нсв 4c4БЯ$
// -------------------------------------------------------------------------
// Пример: приводиться
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,"1"            // привод-иться
.время Н        // настоящее время
  .лицо 3
    '',,"50"            // привод-ится
.время П        // прошедшее время
    ил,,"26"            // привод-ил-ось
}

.тип нсв_нп 4c4, нсв_нп 4c4$
// -------------------------------------------------------------------------
// Пример: ходить
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить                 // ход-ить
.повел
    и,,"11"             // ход-и, ход-и-те
.время Н        // настоящее время
  .лицо 1
    '',,"52"            // хо|ж|-у, ход-им
  .лицо 2
    и,,"13"             // ход-и-шь, ход-и-те
  .лицо 3
    '',,"47"            // ход-ит, ход-ят
  .действ           // действительное причастие
    ящ,,"16"            // ход-ящ-ий, ая и т. д.
  .деепр
    я                   // ход-я
.время П        // прошедшее время
    ил,,"15"            // ход-ил (-,-а,-о,-и)
  .действ
    ивш,,"16"           // ход-ивш-ий
  .деепр
    ив                  // ход-ив
    ивши                // ход-ивши
}

.тип нсв_нп 4c4Ф, нсв_нп 4c4Ф$
// -------------------------------------------------------------------------
// Пример: светить(ся)
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // свет-ить(ся)
.повел
    и,,"28"             // свет-и(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"54"            // све|ч|-у(сь), свет-им(ся)
  .лицо 2
    и,,"9"              // свет-и-шь(ся), свет-и-те(сь)
  .лицо 3
    '',,"48"            // свет-ит(ся), свет-ят(ся)
  .действ           // действительное причастие
    ящ,,"5"             // свет-ящ-ий(ся), ая и т. д.
  .деепр
    я,,,"2"             // свет-я(сь)
.время П        // прошедшее время
    ил,,"3"             // свет-ил (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    ивш,,"5"            // свет-ивш-ий(ся)
  .деепр
    ив                  // свет-ив
    ивши,,,"2"          // свет-ивши(сь)
}

.тип св 4c4, св 4c4$, св 4b//4c4$
// -------------------------------------------------------------------------
// Пример: посадить, промутить
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить                 // посад-ить
.повел
    и,,"11"             // посад-и, посад-и-те
.время Б        // будущее время
  .лицо 1
    '',,"52"            // поса|ж|-у, посад-им
  .лицо 2
    и,,"13"             // посад-и-шь, посад-и-те
  .лицо 3
    '',,"47"            // посад-ит, посад-ят
.время П        // прошедшее время
    ил,,"15"            // посад-ил (-,-а,-о,-и)
  .действ
    ивш,,"16"           // посад-ивш-ий
  .страд
    ен,,"6"             // поса|ж|-ен-ный
  .деепр
    ив                  // посад-ив
    ивши                // посад-ивши
}

.тип св 4b?//4c4?
// -------------------------------------------------------------------------
// Пример: намутить
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить                 // намут-ить
.повел
    и,,"11"             // намут-и, намут-и-те
.время Б        // будущее время
  .лицо 1
    '',,"52"            // наму|ч|-у, намут-им
  .лицо 2
    и,,"13"             // намут-и-шь, намут-и-те
  .лицо 3
    '',,"47"            // намут-ит, намут-ят
.время П        // прошедшее время
    ил,,"15"            // намут-ил (-,-а,-о,-и)
  .действ
    ивш,,"16"           // намут-ивш-ий
  .деепр
    ив                  // намут-ив
    ивши                // намут-ивши
}

.тип св 4c4Ф, св 4c4Ф$, св 4c4!Ф, св 4b//4c4Ф$, св 4b//4c4Ф~
// -------------------------------------------------------------------------
// Пример: рассердить
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // рассерд-ить(ся)
.повел
    и,,"28"             // рассерд-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"54"            // рассер|ж|-у(сь), рассерд-им(ся)
  .лицо 2
    и,,"9"              // рассерд-и-шь(ся), рассерд-и-те(сь)
  .лицо 3
    '',,"48"            // рассерд-ит(ся), рассерд-ят(ся)
.время П        // прошедшее время
    ил,,"3"             // рассерд-ил (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    ивш,,"5"            // рассерд-ивш-ий(ся)
  .страд
    ен,,"6"             // рассер|ж|-ен-ный
  .деепр
    ив                  // рассерд-ив
    ивши,,,"2"          // рассерд-ивши(сь)
}

.тип св 4b?Ф//4c4?Ф
// -------------------------------------------------------------------------
// Пример: перемутить
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // перемут-ить(ся)
.повел
    и,,"28"             // перемут-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"54"            // перему|ч|-у(сь), перемут-им(ся)
  .лицо 2
    и,,"9"              // перемут-и-шь(ся), перемут-и-те(сь)
  .лицо 3
    '',,"48"            // перемут-ит(ся), перемут-ят(ся)
.время П        // прошедшее время
    ил,,"3"             // перемут-ил (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    ивш,,"5"            // перемут-ивш-ий(ся)
  .деепр
    ив                  // перемут-ив
    ивши,,,"2"          // перемут-ивши(сь)
}

.тип св 4c4Я, св 4c4Я$
// -------------------------------------------------------------------------
// Пример: набродиться
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,"1"            // наброд-иться
.повел
    и,,"33"             // наброд-и(те)сь
.время Б        // будущее время
  .лицо 1
    '',,"55"            // набро|ж|-усь, наброд-имся
  .лицо 2
    и,,"19"             // наброд-и-шься, наброд-и-тесь
  .лицо 3
    '',,"49"            // наброд-ится, наброд-ятся
.время П        // прошедшее время
    ил,,"22"            // наброд-ил (-ся,-ась,-ось,-ись)
  .действ
    ивш,,"21"           // наброд-ивш-ийся
  .деепр
    ивши,,"2"           // наброд-ившись
}

.тип св 4c4Я~
// -------------------------------------------------------------------------
// Пример: очутиться
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,"1"            // очут-иться
.повел
    и,,"33"             // очут-и(те)сь
.время Б        // будущее время
  .лицо 1
    '',,"69"            // очут-имся
  .лицо 2
    и,,"19"             // очут-и-шься, очут-и-тесь
  .лицо 3
    '',,"49"            // очут-ится, очут-ятся
.время П        // прошедшее время
    ил,,"22"            // очут-ил (-ся,-ась,-ось,-ись)
  .действ
    ивш,,"21"           // очут-ивш-ийся
  .деепр
    ивши,,"2"           // очут-ившись
}

.тип св_нп 4c4, св_нп 4c4$
// -------------------------------------------------------------------------
// Пример: подзакусить
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить                 // подзакус-ить
.повел
    и,,"11"             // подзакус-и, подзакус-и-те
.время Б        // будущее время
  .лицо 1
    '',,"52"            // подзаку|ш|-у, подзакус-им
  .лицо 2
    и,,"13"             // подзакус-и-шь, подзакус-и-те
  .лицо 3
    '',,"47"            // подзакус-ит, подзакус-ят
.время П        // прошедшее время
    ил,,"15"            // подзакус-ил (-,-а,-о,-и)
  .действ
    ивш,,"16"           // подзакус-ивш-ий
  .деепр
    ив                  // подзакус-ив
    ивши                // подзакус-ивши
}

.тип св_нп 4c4Ф
// -------------------------------------------------------------------------
// Пример: заблудить
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // заблуд-ить(ся)
.повел
    и,,"28"             // заблуд-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"54"            // заблу|ж|-у(сь), заблуд-им(ся)
  .лицо 2
    и,,"9"              // заблуд-и-шь(ся), заблуд-и-те(сь)
  .лицо 3
    '',,"48"            // заблуд-ит(ся), заблуд-ят(ся)
.время П        // прошедшее время
    ил,,"3"             // заблуд-ил (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    ивш,,"5"            // заблуд-ивш-ий(ся)
  .деепр
    ив                  // заблуд-ив
    ивши,,,"2"          // заблуд-ивши(сь)
}

.тип св_нп 4c4БФ$
// -------------------------------------------------------------------------
// Пример: хватить
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // хват-ить(ся)
.время Б        // будущее время
  .лицо 3
    '',,"66"            // хват-ит(ся)
.время П        // прошедшее время
    ил,,"24"            // хват-ил-о(сь)
}

.тип св-нсв 4b/c4Ф$, св-нсв 4c4Ф
// -------------------------------------------------------------------------
// Пример: крестить(ся)
// Перед -ить стоит согласная (с, з, т, д)
// -------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // род-ить(ся)
.повел
    и,,"28"             // род-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"54"            // род|ж|-у(сь), род-им(ся)
  .лицо 2
    и,,"9"              // род-и-шь(ся), род-и-те(сь)
  .лицо 3
    '',,"48"            // род-ит(ся), род-ят(ся)
.время Н        // настоящее время
  .лицо 1
    '',,"54"            // род|ж|-у(сь), род-им(ся)
  .лицо 2
    и,,"9"              // род-и-шь(ся), род-и-те(сь)
  .лицо 3
    '',,"48"            // род-ит(ся), род-ят(ся)
  .действ
    ящ,,"5"
  .деепр
    я,,"2"
.время П        // прошедшее время
    ил,,"3"             // род-ил (-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    ивш,,"5"            // род-ивш-ий(ся)
  .страд
    ен,,"6"             // ро|жд|-ен-ный
  .деепр
    ив                  // род-ив
    ивши,,,"2"          // род-ивши(сь)
}

