.тип нсв 5c'БЯ
//--------------------------------------------------------------------------
// Пример: слово хотеться
//--------------------------------------------------------------------------
{
.инфинитив
    теть,,"1"           // хо-теть-ся
.время Н
  .лицо 3
    ч,,"27"             // хо-ч-ет-ся
.время П
    тел,,"26"           // хо-тел-о-сь
}

.тип нсв_нп 5c'
//--------------------------------------------------------------------------
// Пример: слово хотеть
//--------------------------------------------------------------------------
{
.инфинитив
    теть                // хо-теть
.повел
    ти,,"11"            // хо-ти(те)
.время Н
  .лицо 1
    '',,"110"           // хо-чу, хо-тим
  .лицо 2
    '',,"111"           // хо-чешь, хо-тите
  .лицо 3
    '',,"112"           // хо-чет, хо-тят
  .действ
    тящ,,"16"           // хо-тящ-ий
  .деепр
    тя                  // хо-тя
.время П
    тел,,"15"           // хо-тел-(-,-а,-о,-и)
  .действ
    тевш,,"16"          // хо-тевш-ий
  .деепр
    тев                 // хо-тев
    тевши               // хо-тевши
}

.тип св 5c'БЯ
//--------------------------------------------------------------------------
// Пример: захотеться
//--------------------------------------------------------------------------
{
.инфинитив
    теть,,"1"           // захо-теть-ся
.время Б
  .лицо 3
    ч,,"27"             // захо-ч-ет-ся
.время П
    тел,,"26"           // захо-тел-о-сь
}

.тип св_нп 5c'
//--------------------------------------------------------------------------
// Пример: захотеть
//--------------------------------------------------------------------------
{
.инфинитив
    теть                // захо-теть
.повел
    ти,,"11"            // захо-ти(те)
.время Б
  .лицо 1
    '',,"110"           // захо-чу, захо-тим
  .лицо 2
    '',,"111"           // захо-чешь, захо-тите
  .лицо 3
    '',,"112"           // захо-чет, захо-тят
.время П
    тел,,"15"           // захо-тел-(-,-а,-о,-и)
  .действ
    тевш,,"16"          // захо-тевш-ий
  .деепр
    тев                 // захо-тев
    тевши               // захо-тевши
}

