.тип нсв_нп 6b1@
//---------------------------------------------------------------------------
// Пример: вопиять
//---------------------------------------------------------------------------
{
.инфинитив
    ять                 // вопи-ять
.время Н        // настоящее время
  .лицо 1
    '',,"12"            // вопи-ю, вопи-ем
  .лицо 2
    е,,"13"             // вопи-е-шь, вопи-е-те
  .лицо 3
    '',,"14"            // вопи-ет, вопи-ют
  .действ
    ющ,,"16"            // вопи-ющ-ий
  .деепр
    я                   //
.время П        // прошедшее время
    ял,,"15"            // вопи-ял(-,-а,-о,-и)
  .действ
    явш,,"16"           // вопи-явш-ий
  .деепр
    яв                  // вопи-яв
    явши                // вопи-явши
}

.тип нсв 6b1Я
//---------------------------------------------------------------------------
// Пример: смеяться
//---------------------------------------------------------------------------
{
.инфинитив
    ять,,"1"            // сме-ять-ся
.повел
    й,,"17"             // сме-й-ся, сме-й-те-сь
.время Н        // настоящее время
  .лицо 1
    '',,"18"            // сме-ю-сь, сме-ем-ся
  .лицо 2
    е,,"19"             // сме-е-шь-ся, сме-е-те-сь
  .лицо 3
    '',,"20"            // сме-ется, сме-ют-ся
  .действ
    ющ,,"21"            // сме-ющ-ий-ся
  .деепр
    я,,"2"              // сме-я-сь
.время П        // прошедшее время
    ял,,"22"            // сме-ял(-ся,-а-сь,-о-сь,-и-сь)
  .действ
    явш,,"21"           // сме-явш-ий-ся
  .деепр
    явши,,"2"           // сме-явши-сь
}

.тип св 6b1Я
//---------------------------------------------------------------------------
// Пример: рассмеяться
//---------------------------------------------------------------------------
{
.инфинитив
    ять,,"1"            // рассме-ять-ся
.повел
    й,,"17"             // рассме-й-ся, рассме-й-те-сь
.время Б        // будущее время
  .лицо 1
    '',,"18"            // рассме-ю-сь, рассме-ем-ся
  .лицо 2
    е,,"19"             // рассме-е-шь-ся, рассме-е-те-сь
  .лицо 3
    '',,"20"            // рассме-ется, рассме-ют-ся
.время П        // прошедшее время
    ял,,"22"            // рассме-ял(-ся,-а-сь,-о-сь,-и-сь)
  .действ
    явш,,"21"           // рассме-явш-ий-ся
  .деепр
    явши,,"2"           // рассме-явши-сь
}

.тип св 6b1$
//---------------------------------------------------------------------------
// Пример: осмеять
//---------------------------------------------------------------------------
{
.инфинитив
    ять                 // осме-ять
.повел
    й,,"11"             // осме-й(те)
.время Б        // будущее время
  .лицо 1
    '',,"12"            // осме-ю, осме-ем
  .лицо 2
    е,,"13"             // осме-е-шь, осме-е-те
  .лицо 3
    '',,"14"            // осме-ет, осме-ют
.время П        // прошедшее время
    ял,,"15"            // осме-ял(-,-а,-о,-и)
  .действ
    явш,,"16"           // осме-явш-ий
  .страд
    ян,,"6"             // осме-ян-ный
  .деепр
    яв                  // осме-яв
    явши                // осме-явши
}

.тип св 6b1Ф$
//---------------------------------------------------------------------------
// Пример: засмеять(ся)
//---------------------------------------------------------------------------
{
.инфинитив
    ять,,,"1"           // засме-ять(ся)
.повел
    й,,"7"              // засме-й(ся), засме-й-те(сь)
.время Б        // будущее время
  .лицо 1
    '',,"8"             // засме-ю(сь), засме-ем(ся)
  .лицо 2
    е,,"9"              // засме-е-шь(ся), засме-е-те(сь)
  .лицо 3
    '',,"10"            // засме-ет(ся), засме-ют(ся)
.время П        // прошедшее время
    ял,,"3"             // засме-ял(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    явш,,"5"            // засме-явш-ий(ся)
  .страд
    ян,,"6"             // засме-ян(-ный,-,-а,-о,-ы)
  .деепр
    яв                  // засме-яв
    явши,,,"2"          // засме-явши(сь)
}

