.тип нсв 6b3!Ф
//---------------------------------------------------------------------------
// Пример: слать(ся)
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // сл-ать(ся)
.повел
    и,,"28"             // шл-и(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"8"             // шл-ю(сь), шл-ем(ся)
  .лицо 2
    е,,"9"              // шл-е-шь(ся), шл-е-те(сь)
  .лицо 3
    '',,"10"            // шл-ет(ся), шл-ют(ся)
  .действ
    ющ,,"5"             // шл-ющ-ий(ся)
  .деепр
    я, затрудн          // шл-я
.время П        // прошедшее время
    ал,,"3"             // сл-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // сл-авш-ий(ся)
  .страд
    ан,,"6"             // сл-ан-ный
  .деепр
    ав                  // сл-ав
    авши,,,"2"          // сл-авши(сь)
}

.тип св 6b3$
//---------------------------------------------------------------------------
// Пример: наслать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // насл-ать
.повел
    и,,"11"             // нашл-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"12"            // нашл-ю, нашл-ем
  .лицо 2
    е,,"13"             // нашл-е-шь, нашл-е-те
  .лицо 3
    '',,"14"            // нашл-ет, нашл-ют
.время П        // прошедшее время
    ал,,"15"            // насл-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // насл-авш-ий
  .страд
    ан,,"6"             // насл-ан-ный
  .деепр
    ав                  // насл-ав
    авши                // насл-авши
}

.тип св 6b3Ф$
//---------------------------------------------------------------------------
// Пример: сослать(ся)
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // сосл-ать(ся)
.повел
    и,,"28"             // сошл-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"8"             // сошл-ю(сь), сошл-ем(ся)
  .лицо 2
    е,,"9"              // сошл-е-шь(ся), сошл-е-те(сь)
  .лицо 3
    '',,"10"            // сошл-ет(ся), сошл-ют(ся)
.время П        // прошедшее время
    ал,,"3"             // сосл-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // сосл-авш-ий(ся)
  .страд
    ан,,"6"             // сосл-ан-ный
  .деепр
    ав                  // сосл-ав
    авши,,,"2"          // сосл-авши(сь)
}

