.тип нсв 6c1!Ф
//---------------------------------------------------------------------------
// Пример: стлать(ся)
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // стл-ать(ся)
.повел
    и,,"28"             // стел-и(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"8"             // стел-ю(сь), стел-ем(ся)
  .лицо 2
    е,,"9"              // стел-е-шь(ся), стел-е-те(сь)
  .лицо 3
    '',,"10"            // стел-ет(ся), стел-ют(ся)
  .действ
    ющ,,"5"             // стел-ющ-ий(ся)
.время П        // прошедшее время
    ал,,"3"             // стл-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // стл-авш-ий(ся)
  .страд
    ан,,"6"             // стл-ан(-ный,-,-а,-о,-ы)
  .деепр
    ав                  // стл-ав
    авши,,,"2"          // стл-авши(сь)
}

.тип св 6c1$, св 6*c1$
//---------------------------------------------------------------------------
// Пример: настлать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // настл-ать
.повел
    и,,"11"             // настел-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"12"            // настел-ю, настел-ем
  .лицо 2
    е,,"13"             // настел-е-шь, настел-е-те
  .лицо 3
    '',,"14"            // настел-ет, настел-ют
.время П        // прошедшее время
    ал,,"15"            // настл-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // настл-авш-ий
  .страд
    ан,,"6"             // настл-ан-ный
  .деепр
    ав                  // настл-ав
    авши                // настл-авши
}

.тип св 6c1Ф$, св 6*c1Ф$
//---------------------------------------------------------------------------
// Пример: застлать(ся)
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // застл-ать(ся)
.повел
    и,,"28"             // застел-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"8"             // застел-ю(сь), застел-ем(ся)
  .лицо 2
    е,,"9"              // застел-е-шь(ся), застел-е-те(сь)
  .лицо 3
    '',,"10"            // застел-ет(ся), застел-ют(ся)
.время П        // прошедшее время
    ал,,"3"             // застл-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // застл-авш-ий(ся)
  .страд
    ан,,"6"             // застл-ан(-ный,-,-а,-о,-ы)
  .деепр
    ав                  // застл-ав
    авши,,,"2"          // застл-авши(сь)
}

.тип св 6c1E1
//---------------------------------------------------------------------------
// Пример: заклать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // закл-ать
.время П        // прошедшее время
    ал,,"15"            // закл-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // закл-авш-ий
  .страд
    ан,,"6"             // закл-ан-ный
  .деепр
    ав                  // закл-ав
    авши                // закл-авши
}

