.тип нсв 6c2!
//---------------------------------------------------------------------------
// Пример: клепать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // клеп-ать(ся)
.повел
    ли,,"11"            // клеп-ли(те)
.время Н        // настоящее время
  .лицо 1
    л,,"12"             // клеп-л-ю, клеп-л-ем
  .лицо 2
    ле,,"13"            // клеп-ле-шь, клеп-ле-те
  .лицо 3
    л,,"10"             // клеп-л-ет(ся), клеп-л-ют(ся)
  .действ           // действительное причастие
    лющ,,"5"            // клеп-лющ-ий(ся)
  .деепр
    ля                  // клеп-ля
.время П        // прошедшее время
    ал,,"3"             // клеп-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // клеп-авш-ий(ся)
  .страд
    ан,,"6"             // клеп-ан(-ный,-,-а,-о,-ы)
  .деепр
    ав                  // клеп-ав
    авши                // клеп-авши
}

.тип нсв 6c2Ф
//---------------------------------------------------------------------------
// Пример: трепать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // треп-ать(ся)
.повел
    ли,,"28"            // треп-ли(те)(сь)
.время Н        // настоящее время
  .лицо 1
    л,,"8"              // треп-л-ю(сь), треп-л-ем(ся)
  .лицо 2
    ле,,"9"             // треп-ле-шь(ся), треп-ле-те(сь)
  .лицо 3
    л,,"10"             // треп-л-ет(ся), треп-л-ют(ся)
  .действ           // действительное причастие
    лющ,,"5"            // треп-лющ-ий(ся)
  .деепр
    ля,,,"2"            // треп-ля(сь)
.время П        // прошедшее время
    ал,,"3"             // треп-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // треп-авш-ий(ся)
  .страд
    ан,,"6"             // треп-ан(-ный,-,-а,-о,-ы)
  .деепр
    ав                  // треп-ав
    авши,,,"2"          // треп-авши(сь)
}

.тип нсв 6c2БЯ
//---------------------------------------------------------------------------
// Пример: дрематься
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,"1"            // дрем-ать-ся
.время Н        // настоящее время
  .лицо 3
    л,,"27"             // дрем-л-ет-ся
.время П        // прошедшее время
    ал,,"26"            // дрем-ал-о-сь
}

.тип нсв_нп 6c2
//---------------------------------------------------------------------------
// Пример: дремать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // дрем-ать
.повел
    ли,,"11"            // дрем-ли(те)
.время Н        // настоящее время
  .лицо 1
    л,,"12"             // дрем-л-ю, дрем-л-ем
  .лицо 2
    ле,,"13"            // дрем-ле-шь, дрем-ле-те
  .лицо 3
    л,,"14"             // дрем-л-ет, дрем-л-ют
  .действ           // действительное причастие
    лющ,,"16"           // дрем-лющ-ий
  .деепр
    ля                  // дрем-ля
.время П        // прошедшее время
    ал,,"15"            // дрем-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // дрем-авш-ий
  .деепр
    ав                  // дрем-ав
    авши                // дрем-авши
}

.тип св 6c2, св 6c2$
//---------------------------------------------------------------------------
// Пример: притрепать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // притреп-ать
.повел
    ли,,"11"            // притреп-ли(те)
.время Б        // будущее время
  .лицо 1
    л,,"12"             // притреп-л-ю, притреп-л-ем
  .лицо 2
    ле,,"13"            // притреп-ле-шь, притреп-ле-те
  .лицо 3
    л,,"14"             // притреп-л-ет, притреп-л-ют
.время П        // прошедшее время
    ал,,"15"            // притреп-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // притреп-авш-ий
  .страд
    ан,,"6"             // притреп-ан-ный
  .деепр
    ав                  // притреп-ав
    авши                // притреп-авши
}

.тип св 6c2Ф, св 6c2Ф$
//---------------------------------------------------------------------------
// Пример: пообтрепать(ся)
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // пообтреп-ать(ся)
.повел
    ли,,"28"            // пообтреп-ли(те)(сь)
.время Б        // будущее время
  .лицо 1
    л,,"8"              // пообтреп-л-ю(сь), пообтреп-л-ем(ся)
  .лицо 2
    ле,,"9"             // пообтреп-ле-шь(ся), пообтреп-ле-те(сь)
  .лицо 3
    л,,"10"             // пообтреп-л-ет(ся), пообтреп-л-ют(ся)
.время П        // прошедшее время
    ал,,"3"             // пообтреп-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // пообтреп-авш-ий(ся)
  .страд
    ан,,"6"             // пообтреп-ан(-ный,-,-а,-о,-ы)
  .деепр
    ав                  // пообтреп-ав
    авши,,,"2"          // пообтреп-авши(сь)
}

.тип св_нп 6c2
//---------------------------------------------------------------------------
// Пример: задремать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // задрем-ать
.повел
    ли,,"11"            // задрем-ли(те)
.время Б        // будущее время
  .лицо 1
    л,,"12"             // задрем-л-ю, задрем-л-ем
  .лицо 2
    ле,,"13"            // задрем-ле-шь, задрем-ле-те
  .лицо 3
    л,,"14"             // задрем-л-ет, задрем-л-ют
.время П        // прошедшее время
    ал,,"15"            // задрем-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // задрем-авш-ий
  .деепр
    ав                  // задрем-ав
    авши                // задрем-авши
}

