
.тип нсв 6c3
//---------------------------------------------------------------------------
// Пример: низать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // низ-ать(ся)
.повел
    и,,"11"             // ниж-и(те)
.время Н        // настоящее время
  .лицо 1
    '',,"31"            // ниж-у, ниж-ем
  .лицо 2
    е,,"13"             // ниж-шь, ниж-е-те
  .лицо 3
    '',,"30"            // ниж-ет(ся), ниж-ут(ся)
  .действ           // действительное причастие
    ущ,,"5"             // ниж-ущ-ий(ся)
  .деепр
    а                   // ниж-а
.время П        // прошедшее время
    ал,,"3"             // низ-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // низ-авш-ий(ся)
  .страд
    ан,,"6"             // низ-ан(-ный,-,-а,-о,-ы)
  .деепр
    ав                  // низ-ав
    авши                // низ-авши
}

.тип нсв 6c3!
//---------------------------------------------------------------------------
// Пример: лепетать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // лепет-ать(ся)
.повел
    и,,"11"             // лепеч-и(те)
.время Н        // настоящее время
  .лицо 1
    '',,"31"            // лепеч-у, лепеч-ем
  .лицо 2
    е,,"13"             // лепеч-е-шь, лепеч-е-те
  .лицо 3
    '',,"30"            // лепеч-ет(ся), лепеч-ут(ся)
  .действ           // действительное причастие
    ущ,,"5"             // лепеч-ущ-ий(ся)
  .деепр
    а                   // лепеч-а
.время П        // прошедшее время
    ал,,"3"             // лепет-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // лепет-авш-ий(ся)
  .деепр
    ав                  // лепет-ав
    авши                // лепет-авши
}

.тип нсв 6c3_деепр_зтр
//---------------------------------------------------------------------------
// Пример: тесать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // тес-ать(ся)
.повел
    и,,"11"             // теш-и(те)
.время Н        // настоящее время
  .лицо 1
    '',,"31"            // теш-у, теш-ем
  .лицо 2
    е,,"13"             // теш-шь, теш-е-те
  .лицо 3
    '',,"30"            // теш-ет(ся), теш-ут(ся)
  .действ           // действительное причастие
    ущ,,"5"             // теш-ущ-ий(ся)
  .деепр
    а,затрудн           // теш-а
.время П        // прошедшее время
    ал,,"3"             // тес-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // тес-авш-ий(ся)
  .страд
    ан,,"6"             // тес-ан(-ный,-,-а,-о,-ы)
  .деепр
    ав                  // тес-ав
    авши                // тес-авши
}

.тип нсв 6c3Ф_деепр_зтр
//---------------------------------------------------------------------------
// Пример: чесать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // чес-ать(ся)
.повел
    и,,"28"             // чеш-и(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"29"            // чеш-у(сь), чеш-ем(ся)
  .лицо 2
    е,,"9"              // чеш-е-шь(ся), чеш-е-те(сь)
  .лицо 3
    '',,"30"            // чеш-ет(ся), чеш-ут(ся)
  .действ           // действительное причастие
    ущ,,"5"             // чеш-ущ-ий(ся)
  .деепр
    а,затрудн,,"2"      // чеш-а(сь)
.время П        // прошедшее время
    ал,,"3"             // чес-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // чес-авш-ий(ся)
  .страд
    ан,,"6"             // чес-ан(-ный,-,-а,-о,-ы)
  .деепр
    ав                  // чес-ав
    авши,,,"2"          // чес-авши(сь)
}

.тип нсв 6c3Ф
//---------------------------------------------------------------------------
// Пример: лизать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // лиз-ать(ся)
.повел
    и,,"28"             // лиж-и(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"29"            // лиж-у(сь), лиж-ем(ся)
  .лицо 2
    е,,"9"              // лиж-е-шь(ся), лиж-е-те(сь)
  .лицо 3
    '',,"30"            // лиж-ет(ся), лиж-ут(ся)
  .действ           // действительное причастие
    ущ,,"5"             // лиж-ущ-ий(ся)
  .деепр
    а,,,"2"             // лиж-а(сь)
.время П        // прошедшее время
    ал,,"3"             // лиз-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // лиз-авш-ий(ся)
  .страд
    ан,,"6"             // лиз-ан(-ный,-,-а,-о,-ы)
  .деепр
    ав                  // лиз-ав
    авши,,,"2"          // лиз-авши(сь)
}

.тип нсв 6c3?Ф
//---------------------------------------------------------------------------
// Пример: щекотать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // щекот-ать(ся)
.повел
    и,,"28"             // щекоч-и(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"29"            // щекоч-у(сь), щекоч-ем(ся)
  .лицо 2
    е,,"9"              // щекоч-е-шь(ся), щекоч-е-те(сь)
  .лицо 3
    '',,"30"            // щекоч-ет(ся), щекоч-ут(ся)
  .действ           // действительное причастие
    ущ,,"5"             // щекоч-ущ-ий(ся)
  .деепр
    а,,,"2"             // щекоч-а(сь)
.время П        // прошедшее время
    ал,,"3"             // щекот-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // щекот-авш-ий(ся)
  .страд
    ен,,"6"             // щекоч-ен(-ный,-,-а,-о,-ы)
  .деепр
    ав                  // щекот-ав
    авши,,,"2"          // щекот-авши(сь)
}

.тип нсв_нп 6c3, нсв_нп 6c3E1
//---------------------------------------------------------------------------
// Пример: скакать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // скак-ать
.повел
    и,,"11"             // скач-и(те)
.время Н        // настоящее время
  .лицо 1
    '',,"31"            // скач-у, скач-ем
  .лицо 2
    е,,"13"             // скач-е-шь, скач-е-те
  .лицо 3
    '',,"32"            // скач-ет, скач-ут
  .действ
    ущ,,"16"            // скач-ущ-ий
  .деепр
    а                   // скач-а
.время П        // прошедшее время
    ал,,"15"            // скак-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // скак-авш-ий
  .деепр
    ав                  // скак-ав
    авши                // скак-авши
}

.тип нсв_нп 6c3Ф
//---------------------------------------------------------------------------
// Пример: трепетать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // трепет-ать(ся)
.повел
    и,,"28"             // трепещ-и(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"29"            // трепещ-у(сь), трепещ-ем(ся)
  .лицо 2
    е,,"9"              // трепещ-е-шь(ся), трепещ-е-те(сь)
  .лицо 3
    '',,"30"            // трепещ-ет(ся), трепещ-ут(ся)
  .действ           // действительное причастие
    ущ,,"5"             // трепещ-ущ-ий(ся)
  .деепр
    а,,,"2"             // трепещ-а(сь)
.время П        // прошедшее время
    ал,,"3"             // трепет-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // трепет-авш-ий(ся)
  .деепр
    ав                  // трепет-ав
    авши,,,"2"          // трепет-авши(сь)
}

.тип св 6c3, св 6c3$
//---------------------------------------------------------------------------
// Пример: написать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // напис-ать
.повел
    и,,"11"             // напиш-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"31"            // напиш-у, напиш-ем
  .лицо 2
    е,,"13"             // напиш-е-шь, напиш-е-те
  .лицо 3
    '',,"32"            // напиш-ет, напиш-ут
.время П        // прошедшее время
    ал,,"15"            // напис-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // напис-авш-ий
  .страд
    ан,,"6"             // напис-ан(-ный,-,-а,-о,-ы)
  .деепр
    ав                  // напис-ав
    авши                // напис-авши
}

.тип св 6c3!, св 6c3!$
//---------------------------------------------------------------------------
// Пример: залепетать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // залепет-ать
.повел
    и,,"11"             // залепеч-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"31"            // залепеч-у, залепеч-ем
  .лицо 2
    е,,"13"             // залепеч-е-шь, залепеч-е-те
  .лицо 3
    '',,"32"            // залепеч-ет, залепеч-ут
.время П        // прошедшее время
    ал,,"15"            // залепет-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // залепет-авш-ий
  .деепр
    ав                  // залепет-ав
    авши                // залепет-авши
}

.тип св 6c3?
//---------------------------------------------------------------------------
// Пример: защекотать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // защекот-ать
.повел
    и,,"11"             // защекоч-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"31"            // защекоч-у, защекоч-ем
  .лицо 2
    е,,"13"             // защекоч-е-шь, защекоч-е-те
  .лицо 3
    '',,"32"            // защекоч-ет, защекоч-ут
.время П        // прошедшее время
    ал,,"15"            // защекот-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // защекот-авш-ий
  .страд
    ен,,"6"             // защекоч-ен(-ный,-,-а,-о,-ы)
  .деепр
    ав                  // защекот-ав
    авши                // защекот-авши
}

.тип св 6c3$~
//---------------------------------------------------------------------------
// Пример: снискать
// Повел. и буд. избегаются
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // сниск-ать
.время П        // прошедшее время
    ал,,"15"            // сниск-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // сниск-авш-ий
  .страд
    ан,,"6"             // сниск-ан(-ный,-,-а,-о,-ы)
  .деепр
    ав                  // сниск-ав
    авши                // сниск-авши
}

.тип св 6c3Ф, св 6c3Ф$
//---------------------------------------------------------------------------
// Пример: сказать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // сказ-ать(ся)
.повел
    и,,"28"             // скаж-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"29"            // скаж-у(сь), скаж-ем(ся)
  .лицо 2
    е,,"9"              // скаж-е-шь(ся), скаж-е-те(сь)
  .лицо 3
    '',,"30"            // скаж-ет(ся), скаж-ут(ся)
.время П        // прошедшее время
    ал,,"3"             // сказ-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // сказ-авш-ий(ся)
  .страд
    ан,,"6"             // сказ-ан(-ный,-,-а,-о,-ы)
  .деепр
    ав                  // сказ-ав
    авши,,,"2"          // сказ-авши(сь)
}

.тип св 6c3Я, св 6c3Я$
//---------------------------------------------------------------------------
// Пример: расплясаться
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,"1"            // распляс-ать-ся
.повел
    и,,"33"             // распля-ши(те)сь
.время Б        // будущее время
  .лицо 1
    '',,"34"            // распляш-у-сь, распляш-ем-ся
  .лицо 2
    е,,"19"             // распляш-е-шь-ся, распляш-е-те-сь
  .лицо 3
    '',,"39"            // распляш-ет-ся, распляш-ут-ся
.время П        // прошедшее время
    ал,,"22"            // распляс-ал(-ся,-а-сь,-о-сь,-и-сь)
  .действ
    авш,,"21"           // распляс-авш-ий-ся
  .деепр
    авши,,"2"           // распляс-авши-сь
}

.тип св_нп 6c3, св_нп 6c3$, св_нп 6c3E1
//---------------------------------------------------------------------------
// Пример: поскакать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // поскак-ать
.повел
    и,,"11"             // поскач-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"31"            // поскач-у, поскач-ем
  .лицо 2
    е,,"13"             // поскач-е-шь, поскач-е-те
  .лицо 3
    '',,"32"            // поскач-ет, поскач-ут
.время П        // прошедшее время
    ал,,"15"            // поскак-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // поскак-авш-ий
  .деепр
    ав                  // поскак-ав
    авши                // поскак-авши
}

.тип св_нп 6c3Ф, св_нп 6c3Ф$
//---------------------------------------------------------------------------
// Пример: отказать(ся)
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // отказ-ать(ся)
.повел
    и,,"28"             // откаж-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"29"            // откаж-у(сь), откаж-ем(ся)
  .лицо 2
    е,,"9"              // откаж-е-шь(ся), откаж-е-те(сь)
  .лицо 3
    '',,"30"            // откаж-ет(ся), откаж-ут(ся)
.время П        // прошедшее время
    ал,,"3"             // отказ-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // отказ-авш-ий(ся)
  .деепр
    ав                  // отказ-ав
    авши,,,"2"          // отказ-авши(сь)
}

