// Подтип 6°b/c3, глаголы на -звать

.тип нсв 6°b/c3Ф
//---------------------------------------------------------------------------
// Пример: звать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // зв-ать(ся)
.повел
    и,,"28"             // зов-и(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"29"            // зов-у(сь), зов-ем(ся)
  .лицо 2
    е,,"9"              // зов-е-шь(ся), зов-е-те(сь)
  .лицо 3
    '',,"30"            // зов-ет(ся), зов-ут(ся)
  .действ           // действительное причастие
    ущ,,"5"             // зов-ущ-ий(ся)
  .деепр
    я,,,"2"             // зов-я(сь)
.время П        // прошедшее время
    ал,,"3"             // зв-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // зв-авш-ий(ся)
  .страд
    ан,,"6"             // зв-ан-ный
  .деепр
    ав                  // зв-ав
    авши,,,"2"          // зв-авши(сь)
}

.тип св 6°*b/c3, св 6°b/c3, св 6°*b/c3$, св 6°b/c3$
//---------------------------------------------------------------------------
// Пример: подозвать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // подозв-ать
.повел
    и,,"11"             // подзов-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"31"            // подзов-у, подзов-ем
  .лицо 2
    е,,"13"             // подзов-е-шь, подзов-е-те
  .лицо 3
    '',,"32"            // подзов-ет, подзов-ут
.время П        // прошедшее время
    ал,,"15"            // подозв-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // подозв-авш-ий
  .страд
    ан,,"6"             // подозв-ан-ный
  .деепр
    ав                  // подозв-ав
    авши                // подозв-авши
}

.тип св 6°*b/c3Ф, св 6°b/c3Ф, св 6°*b/c3Ф$, св 6°b/c3Ф$
//---------------------------------------------------------------------------
// Пример: отозвать
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,,"1"           // отозв-ать(ся)
.повел
    и,,"28"             // отзов-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"29"            // отзов-у(сь), отзов-ем(ся)
  .лицо 2
    е,,"9"              // отзов-е-шь(ся), отзов-е-те(сь)
  .лицо 3
    '',,"30"            // отзов-ет(ся), отзов-ут(ся)
.время П        // прошедшее время
    ал,,"3"             // отозв-ал(-(ся),-а(сь),-о(сь),-и(сь))
  .действ
    авш,,"5"            // отозв-авш-ий(ся)
  .страд
    ан,,"6"             // отозв-ан-ный
  .деепр
    ав                  // отозв-ав
    авши,,,"2"          // отозв-авши(сь)
}

.тип св 6°b/c3''Я
//---------------------------------------------------------------------------
// Пример: дозваться
//---------------------------------------------------------------------------
{
.инфинитив
    ать,,"1"            // дозв-ать(ся)
.повел
    и,,"33"             // дозов-и(те)сь
.время Б        // будущее время
  .лицо 1
    '',,"34"            // дозов-у-сь, дозов-ем-ся
  .лицо 2
    е,,"19"             // дозов-е-шь-ся, дозов-е-те-сь
  .лицо 3
    '',,"39"            // дозов-ет-ся, дозов-ут-ся
.время П        // прошедшее время
    ал,,"22"            // дозв-ал(-ся,-а-сь,-о-сь,-и-сь)
  .действ
    авш,,"21"           // дозв-авш-ий-ся
  .деепр
    авши,,"2"           // дозв-авши-сь
}

