.тип нсв_нп 6°c
//---------------------------------------------------------------------------
// Пример: стонать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // стон-ать
.повел
    и,,"11"             // стон-и(те)
.время Н        // настоящее время
  .лицо 1
    '',,"109"           // стон-у/аю, стон-ем
  .лицо 2
    е,,"13"             // стон-е-шь, стон-е-те
  .лицо 3
    '',,"32"            // стон-ет, стон-ут
  .действ           // действительное причастие
    ущ,,"16"            // стон-ущ-ий
  .деепр
    ая                  // стон-ая
.время П        // прошедшее время
    ал,,"15"            // стон-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // стон-авш-ий
  .деепр
    ав                  // стон-ав
    авши                // стон-авши
}

.тип св_нп 6°c
//---------------------------------------------------------------------------
// Пример: застонать
//---------------------------------------------------------------------------
{
.инфинитив
    ать                 // застон-ать
.повел
    и,,"11"             // застон-и(те)
.время Н        // настоящее время
  .лицо 1
    '',,"109"           // застон-у/аю, застон-ем
  .лицо 2
    е,,"13"             // застон-е-шь, застон-е-те
  .лицо 3
    '',,"32"            // застон-ет, застон-ут
.время П        // прошедшее время
    ал,,"15"            // застон-ал(-,-а,-о,-и)
  .действ
    авш,,"16"           // застон-авш-ий
  .деепр
    ав                  // застон-ав
    авши                // застон-авши
}

