//
// Глаголы типа 7a - на -сесть
//

.тип св 7a2Я$
//---------------------------------------------------------------------------
// Пример: ссесться
//---------------------------------------------------------------------------
{
.инфинитив
    есть,,"1"           // сс-есть-ся
.повел
    ядь,,"17"           // сс-ядь-ся, сс-ядь-те-сь
.время Б        // будущее время
  .лицо 1
    яд,,"34"            // сс-яд-у-сь, сс-яд-ем-ся
  .лицо 2
    яде,,"19"           // сс-яде-шь-ся, сс-яде-те-сь
  .лицо 3
    яд,,"39"            // сс-яд-ет-ся, сс-яд-ут-ся
.время П        // прошедшее время
    ел,,"22"            // сс-ел(-ся,-а-сь,-о-сь,-и-сь)
  .действ
    евш,,"21"           // сс-евш-ий-ся
  .деепр
    евши,,"2"           // сс-евши-сь
}

.тип св_нп 7a2$, св 7a2?$
//---------------------------------------------------------------------------
// Пример: сесть
//---------------------------------------------------------------------------
{
.инфинитив
    есть                // с-есть
.повел
    ядь,,"11"           // с-ядь(те)
.время Б        // будущее время
  .лицо 1
    яд,,"31"            // с-яд-у, с-яд-ем
  .лицо 2
    яде,,"13"           // с-яде-шь, с-яде-те
  .лицо 3
    яд,,"32"            // с-яд-ет, с-яд-ут
.время П        // прошедшее время
    ел,,"15"            // с-ел(-,-а,-о,-и)
  .действ
    евш,,"16"           // с-евш-ий
  .деепр
    евши                // с-евши
}

