//
// Глаголы типа 7a3 - на вы-XXXX-сти с пометой (-б-)
//

.тип св 7a3
//---------------------------------------------------------------------------
// Пример: выскрести
//---------------------------------------------------------------------------
{
.инфинитив
    сти                 // выскре-сти
.повел
    би,,"11"            // выскре-би(те)
.время Б        // будущее время
  .лицо 1
    б,,"31"             // выскре-б-у, выскре-б-ем
  .лицо 2
    бе,,"13"            // выскре-бе-шь, выскре-бе-те
  .лицо 3
    б,,"32"             // выскре-б-ет, выскре-б-ут
.время П        // прошедшее время
    б,,"36"             // выскре-б(-,-ла,-ло,-ли)
  .действ
    бш,,"16"            // выскре-бш-ий
  .страд
    бен,,"6"            // выскре-бен-ный
  .деепр
    бши                 // выскре-бши
}

.тип св 7a3Ф$
//---------------------------------------------------------------------------
// Пример: выгрести
//---------------------------------------------------------------------------
{
.инфинитив
    сти,,,"2"           // выгре-сти(сь)
.повел
    би,,"28"            // выгре-би(сь), выгре-би-те(сь)
.время Б        // будущее время
  .лицо 1
    б,,"29"             // выгре-б-у(сь), выгре-б-ем(ся)
  .лицо 2
    бе,,"9"             // выгре-бе-шь(ся), выгре-бе-те(сь)
  .лицо 3
    б,,"30"             // выгре-б-ет(ся), выгре-б-ут(ся)
.время П        // прошедшее время
    б,,"38"             // выгре-б(-(ся),ла(сь),ло(сь),и(сь))
  .действ
    бш,,"5"             // выгре-бш-ий-ся
  .страд
    бен,,"6"            // выгре-бен-ный
  .деепр
    бши,,,"2"           // выгре-бши(сь)
}

