// Подтип 7b/b3, глаголы с пометой -с-

.тип нсв 7b/b3Ф
//---------------------------------------------------------------------------
// Пример: трясти
//---------------------------------------------------------------------------
{
.инфинитив
    ти,,,"2"            // тряс-ти(сь)
.повел
    и,,"28"             // тряс-и(те)(сь)
.время Н        // настоящее время
  .лицо 1
    '',,"29"            // тряс-у(сь), тряс-ем(ся)
  .лицо 2
    е,,"9"              // тряс-е-шь(ся), тряс-е-те(сь)
  .лицо 3
    '',,"30"            // тряс-ет(ся), тряс-ут(ся)
  .действ
    ущ,,"5"             // тряс-ущ-ий(ся)
  .деепр
    я,,,"2"             // тряс-я(сь)
.время П        // прошедшее время
    '',,"38"            // тряс-(-(ся),-ла(сь),-ло(сь),-ли(сь))
  .действ
    ш,,"5"              // тряс-ш-ий(ся)
  .страд
    ен,,"6"             // тряс-ен-ный
  .деепр
    ши,,,"2"            // тряс-ши(сь)
}

.тип св 7b/b3, св 7b/b3$
//---------------------------------------------------------------------------
// Пример: допасти
//---------------------------------------------------------------------------
{
.инфинитив
    ти                  // допас-ти
.повел
    и,,"11"             // допас-и(те)
.время Б        // будущее время
  .лицо 1
    '',,"31"            // допас-у, допас-ем
  .лицо 2
    е,,"13"             // допас-е-шь, допас-е-те
  .лицо 3
    '',,"32"            // допас-ет, допас-ут
.время П        // прошедшее время
    '',,"36"            // допас-(-,-ла,-ло,-ли)
  .действ
    ш,,"16"             // допас-ш-ий
  .страд
    ен,,"6"             // допас-ен-ный
  .деепр
    ши                  // допас-ши
}

.тип св 7b/b3Ф, св 7b/b3Ф$
//---------------------------------------------------------------------------
// Пример: попасти
//---------------------------------------------------------------------------
{
.инфинитив
    ти,,,"2"            // попас-ти(сь)
.повел
    и,,"28"             // попас-и(те)(сь)
.время Б        // будущее время
  .лицо 1
    '',,"29"            // попас-у(сь), попас-ем(ся)
  .лицо 2
    е,,"9"              // попас-е-шь(ся), попас-е-те(сь)
  .лицо 3
    '',,"30"            // попас-ет(ся), попас-ут(ся)
.время П        // прошедшее время
    '',,"38"            // попас-(-(ся),-ла(сь),-ло(сь),-ли(сь))
  .действ
    ш,,"5"              // попас-ш-ий(ся)
  .страд
    ен,,"6"             // попас-ен-ный
  .деепр
    ши,,,"2"            // попас-ши(сь)
}

