.тип св 8a/bФ$
//**************************************************************************
// Пример: облечь
//**************************************************************************
{
.инфинитив
    ечь,,,"1"           // обл-ечь(ся)
.повел
    яг,,"7"             // обл-яг(ся), обл-яг-те(сь)
.время Б        // будущее время
  .лицо 1
    я,,"85"             // обл-я-гу(сь), обл-я-жем(ся)
  .лицо 2
    яже,,"9"            // обл-яже-шь(ся), обл-яже-те(сь)
  .лицо 3
    я,,"86"             // обл-я-жет(ся), обл-я-гут(ся)
.время П
    ег,,"38"            // обл-ег(-(ся),-ла(сь),-ло(сь),-ли(сь))
  .действ
    егш,,"5"            // обл-егш-ий(ся)
  .деепр
    егши,,,"2"          // обл-егши
}

.тип св 8a/bЯ, св 8a/bЯ$
//**************************************************************************
// Пример: улечься
//**************************************************************************
{
.инфинитив
    ечь,,"1"            // ул-ечь-ся
.повел
    яг,,"17"            // ул-яг-ся, ул-яг-те-сь
.время Б        // будущее время
  .лицо 1
    я,,"87"             // ул-я-гу-сь, ул-я-жем-ся
  .лицо 2
    яже,,"19"           // ул-яже-шь-ся, ул-яже-те-сь
  .лицо 3
    о,,"88"             // ул-я-жет-ся, ул-я-гут-ся
.время П
    ег,,"37"            // ул-ег(-ся,-ла-сь,-ло-сь,-ли-сь)
  .действ
    егш,,"21"           // ул-егш-ий-ся
  .деепр
    егши,,"2"           // ул-егши-сь
}

.тип св_нп 8a/b$
//**************************************************************************
// Пример: лечь
//**************************************************************************
{
.инфинитив
    ечь                 // л-ечь
.повел
    яг,,"11"            // л-яг(те)
.время Б        // будущее время
  .лицо 1
    я,,"83"             // л-я-гу, л-я-жем
  .лицо 2
    яже,,"13"           // л-яже-шь, л-яже-те
  .лицо 3
    я,,"84"             // л-я-жет, л-я-гут
.время П
    ег,,"36"            // л-ег(-,-ла,-ло,-ли)
  .действ
    егш,,"16"           // л-егш-ий
  .деепр
    егши                // л-егши
}

