// Изолированные глаголы на -реветь.
// Обозначены, как isol_5.

.тип нсв_нп isol_5b
//---------------------------------------------------------------------------
// Пример: реветь
//---------------------------------------------------------------------------
{
.инфинитив
    еть                 // рев-еть
.повел
    и,,"11"             // рев-и, рев-и-те
.время Н        // настоящее время
  .лицо 1
    '',,"31"            // рев-у, рев-ем
  .лицо 2
    е,,"13"             // рев-е-шь, рев-е-те
  .лицо 3
    '',,"32"            // рев-ет, рев-ут
  .действ
    ущ,,"16"            // рев-ущ-ий
  .деепр
    я                   // рев-я
.время П        // прошедшее время
    ел,,"15"            // рев-ел(-,-а,-о,-и)
  .действ
    евш,,"16"           // рев-евш-ий
  .деепр
    ев                  // рев-ев
    евши                // рев-евши
}

.тип св isol_5b?, св_нп isol_5b
//---------------------------------------------------------------------------
// Пример: прореветь
//---------------------------------------------------------------------------
{
.инфинитив
    еть                 // прорев-еть
.повел
    и,,"11"             // прорев-и, прорев-и-те
.время Б        // будущее время
  .лицо 1
    '',,"31"            // прорев-у, прорев-ем
  .лицо 2
    е,,"13"             // прорев-е-шь, прорев-е-те
  .лицо 3
    '',,"32"            // прорев-ет, прорев-ут
.время П        // прошедшее время
    ел,,"15"            // прорев-ел(-,-а,-о,-и)
  .действ
    евш,,"16"           // прорев-евш-ий
  .деепр
    ев                  // прорев-ев
    евши                // прорев-евши
}

.тип св isol_5Я
//---------------------------------------------------------------------------
// Пример: разреветься
//---------------------------------------------------------------------------
{
.инфинитив
    еть,,"1"            // разрев-еть-ся
.повел
    и,,"33"             // разрев-и-сь, разрев-и-те-сь
.время Б        // будущее время
  .лицо 1
    '',,"34"            // разрев-у-сь, разрев-ем-ся
  .лицо 2
    е,,"19"             // разрев-е-шь-ся, разрев-е-те-сь
  .лицо 3
    '',,"39"            // разрев-ет-ся, разрев-ут-ся
.время П        // прошедшее время
    ел,,"22"            // разрев-ел(-ся,-ась,-ось,-ись)
  .действ
    евш,,"21"           // разрев-евш-ий-ся
  .деепр
    евши,,"2"           // разрев-евши-сь
}

