// Глагол зиждиться

.тип нсв isol_aЯ
//---------------------------------------------------------------------------
// Пример: зиждиться
//---------------------------------------------------------------------------
{
.инфинитив
    ить,,"1"            // зижд-ить-ся
.повел
    и,,"33"             // зижд-и-сь, зижд-и-те-сь
.время Н        // настоящее время
  .лицо 1
    '',,"34"            // зижд-у-сь, зижд-ем-ся
  .лицо 2
    е,,"19"             // зижд-е-шь-ся, зижд-е-те-сь
  .лицо 3
    '',,"49"            // зижд-ет-ся, зижд-ят-ся
  .действ
    ящ,,"21"            // зижд-ящ-ий-ся
  .деепр
    я,,"2"              // зижд-я-сь
.время П        // прошедшее время
    ил,,"22"            // вда-л(-ся,-а-сь,-о-сь,-и-сь)
  .действ
    ивш,,"21"           // вда-вш-ий-ся
  .деепр
    ивши,,"2"           // вда-вши-сь
}
