// Изолированные глаголы на -шибить.
// Обозначены, как isol_4.
// Только глаголы совершенного вида.

.тип св isol_4a$, св isol_4b$
//---------------------------------------------------------------------------
// Пример: прошибить
//---------------------------------------------------------------------------
{
.инфинитив
    ить                 // прошиб-ить
.повел
    и,,"11"             // прошиб-и, прошиб-и-те
.время Б        // будущее время
  .лицо 1
    '',,"31"            // прошиб-у, прошиб-ем
  .лицо 2
    е,,"13"             // прошиб-е-шь, прошиб-е-те
  .лицо 3
    '',,"32"            // прошиб-ет, прошиб-ут
.время П        // прошедшее время
    '',,"36"            // прошиб-(-,-ла,-ло,-ли)
  .действ
    ивш,,"16"           // прошиб-ивш-ий
  .страд
    лен,,"6"            // прошиб-лен-ный
  .деепр
    ив                  // прошиб-ив
    ивши                // прошиб-ивши
}

.тип св isol_4bФ$
//---------------------------------------------------------------------------
// Пример: зашибить
//---------------------------------------------------------------------------
{
.инфинитив
    ить,,,"1"           // зашиб-ить(ся)
.повел
    и,,"28"             // зашиб-и(сь), зашиб-и-те(сь)
.время Б        // будущее время
  .лицо 1
    '',,"29"            // зашиб-у(сь), зашиб-ем(ся)
  .лицо 2
    е,,"9"              // зашиб-е-шь(ся), зашиб-е-те(сь)
  .лицо 3
    '',,"30"            // зашиб-ет(ся), зашиб-ут(ся)
.время П        // прошедшее время
    '',,"38"            // зашиб-(-(ся),-ла(сь),-ло(сь),-ли(сь))
  .действ
    ивш,,"5"            // зашиб-ивш-ий(ся)
  .страд
    лен,,"6"            // зашиб-лен-ный
  .деепр
    ив                  // зашиб-ив
    ивши,,,"2"          // зашиб-ивши(сь)
}

.тип св isol_4bЯ$
//---------------------------------------------------------------------------
// Пример: ошибиться
//---------------------------------------------------------------------------
{
.инфинитив
    ить,,"1"            // ошиб-ить-ся
.повел
    и,,"33"             // ошиб-и(те)сь
.время Б        // будущее время
  .лицо 1
    '',,"34"            // ошиб-у-сь, ошиб-ем-ся
  .лицо 2
    е,,"19"             // ошиб-е-шь-ся, ошиб-е-те-сь
  .лицо 3
    '',,"39"            // ошиб-ет-ся, ошиб-ут-ся
.время П        // прошедшее время
    '',,"37"            // ошиб-(-ся,-ла-сь,-ло-сь,-ли-сь)
  .действ
    ивш,,"21"           // ошиб-ивш-ий-ся
  .деепр
    ивши,,"2"           // ошиб-ивши-сь
}

