// Тип 6*

.тип м 6*a, м 6*b
//---------------------------------------------------------------------------
// Пример: улей
//---------------------------------------------------------------------------
{
  .число Е
    ей, И               // ул-ей
    ья, Р               // ул-ья
    ью, Д               // ул-ью
    ей, В               // ул-ей
    ьем, Т              // ул-ьем
    ье, П               // ул-ье
  .число М
    ьи, И               // ул-ьи
    ьев, Р              // ул-ьев
    ьям, Д              // ул-ьям
    ьи, В               // ул-ьи
    ьями, Т             // ул-ьями
    ьях, П              // ул-ьях
}

.тип мо 6*b
//---------------------------------------------------------------------------
// Пример: муравей
//---------------------------------------------------------------------------
{
  .число Е
    ей, И               // мурав-ей
    ья, Р               // мурав-ья
    ью, Д               // мурав-ью
    ья, В               // мурав-ья
    ьем, Т              // мурав-ьем
    ье, П               // мурав-ье
  .число М
    ьи, И               // мурав-ьи
    ьев, Р              // мурав-ьев
    ьям, Д              // мурав-ьям
    ьев, В              // мурав-ьев
    ьями, Т             // мурав-ьями
    ьях, П              // мурав-ьях
}

