
.тип гж 1a, гжп 1a, гж 1b, гжп 1b
//--------------------------------------------------------------------------
// Пример: Эльба, Ява
//--------------------------------------------------------------------------
{
  .число Е
    а, И                // Эльб-а
    ы, Р                // Эльб-ы
    е, Д                // Эльб-е
    у, В                // Эльб-у
    ой, Т               // Эльб-ой
    ою, Т               // Эльб-ою
    е, П                // Эльб-е
}

.тип мн._от_гж 1a
//--------------------------------------------------------------------------
// Пример: Сейшелы, Багамы
//--------------------------------------------------------------------------
{
  .число М
    ы, И                // Багам-ы
    '', Р               // Багам
    ам, Д               // Багам-ам
    ы, В                // Багам-ы
    ами, Т              // Багам-ами
    ах, П               // Багам-ах
}

.тип гж 2a, гж 2b
//--------------------------------------------------------------------------
// Пример: Гдыня, Чечня
//--------------------------------------------------------------------------
{
  .число Е
    я, И                // Гдын-я
    и, Р                // Гдын-и
    е, Д                // Гдын-е
    ю, В                // Гдын-ю
    ей, Т               // Гдын-ей
    ею, Т               // Гдын-ею
    е, П                // о Гдын-е
}

.тип гж 3a, гжп 3a, гж 3*a, гжп 3*a
//--------------------------------------------------------------------------
// Пример: Волга
//--------------------------------------------------------------------------
{
  .число Е
    а, И                // Волг-а
    и, Р                // Волг-и
    е, Д                // Волг-е
    у, В                // Волг-у
    ой, Т               // Волг-ой
    ою, Т               // Волг-ою
    е, П                // Волг-е
}

.тип гж 4a, гжп 4a, гж 4b, гжп 4b
//--------------------------------------------------------------------------
// Пример: Польша
//--------------------------------------------------------------------------
{
  .число Е
    а, И                // Польш-а
    и, Р                // Польш-и
    е, Д                // Польш-е
    у, В                // Польш-у
    ей, Т               // Польш-ей
    ею, Т               // Польш-ею
    е, П                // Польш-е
}

.тип гж 5a, гжп 5a
//--------------------------------------------------------------------------
// Пример: Винница
//--------------------------------------------------------------------------
{
  .число Е
    а, И                // Винниц-а
    ы, Р                // Винниц-ы
    е, Д                // Винниц-е
    у, В                // Винниц-у
    ей, Т               // Винниц-ей
    ею, Т               // Винниц-ею
    е, П                // Винниц-е
}

.тип гж 6*a, гжп 6*a
//--------------------------------------------------------------------------
// Пример: Севилья
//--------------------------------------------------------------------------
{
  .число Е
    я, И                // Коре-я
    и, Р                // Коре-и
    е, Д                // Коре-е
    ю, В                // Коре-ю
    ей, Т               // Коре-ей
    ею, Т               // Коре-ею
    е, П                // Коре-е
}

.тип гж 6a, гжп 6a
//--------------------------------------------------------------------------
// Пример: Корея
//--------------------------------------------------------------------------
{
  .число Е
    я, И                // Коре-я
    и, Р                // Коре-и
    е, Д                // Коре-е
    ю, В                // Коре-ю
    ей, Т               // Коре-ей
    ею, Т               // Коре-ею
    е, П                // Коре-е
}

.тип мн._от_гж 6a
//--------------------------------------------------------------------------
// Пример: Помпеи
//--------------------------------------------------------------------------
{
  .число М
    и, И                // Помпе-и
    й, Р                // Помпе-й
    ям, Д               // Помпе-ям
    и, В                // Помпе-и
    ями, Т              // Помпе-ями
    ях, П               // о Помпе-ях
}

.тип гж 6*b, гжп 6*b
//--------------------------------------------------------------------------
// Пример: Сырдарья
//--------------------------------------------------------------------------
{
  .число Е
    ья, И               // Сырдар-ья
    ьи, Р               // Сырдар-ьи
    ье, Д               // Сырдар-ье
    ью, В               // Сырдар-ью
    ьей, Т              // Сырдар-ьей
    ьею, Т              // Сырдар-ьею
    ье, П               // Сырдар-ье
}

.тип гж 7a, гжп 7a
//--------------------------------------------------------------------------
// Пример: Азия
//--------------------------------------------------------------------------
{
  .число Е
    я, И                // Ази-я
    и, Р                // Ази-и
    и, Д                // Ази-и
    ю, В                // Ази-ю
    ей, Т               // Ази-ей
    ею, Т               // Ази-ею
    и, П                // Ази-и
}

.тип гж 8a1, гжп 8a1, гж 8a
//--------------------------------------------------------------------------
// Пример: Бретань
//--------------------------------------------------------------------------
{
  .число Е
    ь, И                // Бретан-ь
    и, Р                // Бретан-и
    и, Д                // Бретан-и
    ь, В                // Бретан-ь
    ью, Т               // Бретан-ью
    и, П                // Бретан-и
}

.тип гж 8a2, гжп 8a2
//--------------------------------------------------------------------------
// Пример: Керчь
//--------------------------------------------------------------------------
{
  .число Е
    ь, И                // Керч-ь
    и, Р                // Керч-и
    и, Д                // Керч-и
    ь, В                // Керч-ь
    ью, Т               // Керч-ью
    и, П                // Керч-и
}
