// Тип 1

.тип ж 1a, ж 1b, ж 1d, ж 1d', ж 1d//1d', ж 1d'//1d, ж 1d//1b, ж 1b//1d, ж 1e, ж 1f, ж 1f', ж 1f'//1d', ж 1f'//1f, ж 1f//1f', ж 1f//1d, ж 1*a, ж 1*b, ж 1*d, ж 1*a//1*e, ж 1*f//1*d, м//ж 1a, мн._от_ж 1a
//---------------------------------------------------------------------------
// Пример: дружба, похвала, труба
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // дружб-а
    ы, Р                // дружб-ы
    е, Д                // дружб-е
    у, В                // дружб-у
    ой, Т               // дружб-ой
    ою, Т               // дружб-ою
    е, П                // дружб-е
  .число М
    ы, И                // дружб-ы
    '', Р               // дружб
    ам, Д               // дружб-ам
    ы, В                // дружб-ы
    ами, Т              // дружб-ами
    ах, П               // дружб-ах
}

.тип ж 1b?, ж 1*b?
//---------------------------------------------------------------------------
// Пример: тетива
// Затруднена форма р. мн.
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // тетив-а
    ы, Р                // тетив-ы
    е, Д                // тетив-е
    у, В                // тетив-у
    ой, Т               // тетив-ой
    ою, Т               // тетив-ою
    е, П                // тетив-е
  .число М
    ы, И                // тетив-ы
    '', Р|затрудн       // тетив
    ам, Д               // тетив-ам
    ы, В                // тетив-ы
    ами, Т              // тетив-ами
    ах, П               // о тетив-ах
}

.тип ж 1b!
//---------------------------------------------------------------------------
// Пример: мзда
// Отсутствует форма р. мн.
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // мзд-а
    ы, Р                // мзд-ы
    е, Д                // мзд-е
    у, В                // мзд-у
    ой, Т               // мзд-ой
    ою, Т               // мзд-ою
    е, П                // о мзд-е
  .число М
    ы, И                // мзд-ы
    ам, Д               // мзд-ам
    ы, В                // мзд-ы
    ами, Т              // мзд-ами
    ах, П               // мзд-ах
}

.тип ж 1a-, ж 1b-, ж 1d-, ж 1*d-
//---------------------------------------------------------------------------
// Пример: мочевина
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // мочевин-а
    ы, Р                // мочевин-ы
    е, Д                // мочевин-е
    у, В                // мочевин-у
    ой, Т               // мочевин-ой
    ою, Т               // мочевин-ою
    е, П                // о мочевин-е
}

.тип жо 1a, жо 1b, жо 1d, мо-жо 1a, мо-жо 1b, мо-жо 1d, мо-жо 1f, мо-жо 1*d, жо 1*a, жо 1*b, жо 1*d, мо//жо 1a
//---------------------------------------------------------------------------
// Пример: амеба, гюрза, вдова
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // амеб-а
    ы, Р                // амеб-ы
    е, Д                // амеб-е
    у, В                // амеб-у
    ой, Т               // амеб-ой
    ою, Т               // амеб-ою
    е, П                // об амеб-е
  .число М
    ы, И                // амеб-ы
    '', Р               // амеб
    ам, Д               // амеб-ам
    '', В               // амеб
    ами, Т              // амеб-ами
    ах, П               // амеб-ах
}

.тип ж//жо 1a, жо//ж 1a, жо//ж 1*a
//---------------------------------------------------------------------------
// Пример: бацилла
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // бацилл-а
    ы, Р                // бацилл-ы
    е, Д                // бацилл-е
    у, В                // бацилл-у
    ой, Т               // бацилл-ой
    ою, Т               // бацилл-ою
    е, П                // о бацилл-е
  .число М
    ы, И                // бацилл-ы
    '', Р               // бацилл
    ам, Д               // бацилл-ам
    ы, Вн               // бацилл-ы
    '', Во              // бацилл
    ами, Т              // бацилл-ами
    ах, П               // бацилл-ах
}

.тип жо 1b?, мо-жо 1b?
//---------------------------------------------------------------------------
// Пример: кума, егоза
// Затруднена форма р. мн.
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // кум-а
    ы, Р                // кум-ы
    е, Д                // кум-е
    у, В                // кум-у
    ой, Т               // кум-ой
    ою, Т               // кум-ою
    е, П                // о кум-е
  .число М
    ы, И                // кум-ы
    '', Р|затрудн       // кум
    ам, Д               // кум-ам
    '', В|затрудн       // кум
    ами, Т              // кум-ами
    ах, П               // о кум-ах
}

.тип жо 1a-, жо 1b-, мо-жо 1a-, мо-жо 1b-
//---------------------------------------------------------------------------
// Пример: скотина, плотва
//---------------------------------------------------------------------------
{
  .число Е
    а, И                // скотин-а
    ы, Р                // скотин-ы
    е, Д                // скотин-е
    у, В                // скотин-у
    ой, Т               // скотин-ой
    ою, Т               // скотин-ою
    е, П                // о скотин-е
}

// Слова, употребляющиеся лишь в устойчивых словосочетаниях, и имеющие поэтому
// не все формы

.тип ж 1a:f4
//---------------------------------------------------------------------------
// Пример: лета, угода (кануть в лету, сделать в угоду)
//---------------------------------------------------------------------------
{
  .число Е
    у, В                // лет-у
}

.тип ж 1a:f5, ж 1b:f5
//---------------------------------------------------------------------------
// Пример: лихва ( с лихвой )
//---------------------------------------------------------------------------
{
  .число Е
    ой, Т               // лихв-ой
}

.тип ж 1a:f46
//---------------------------------------------------------------------------
// Пример: стрема
//---------------------------------------------------------------------------
{
  .число Е
    у, В                // на стрем-у
    е, П                // на стрем-е
}

.тип ж 1a:p4
//---------------------------------------------------------------------------
// Пример: лясы (точить)
//---------------------------------------------------------------------------
{
  .число М
    ы, В                // ляс-ы
}

.тип ж 1a:p5
//---------------------------------------------------------------------------
// Пример: фибры (всеми фибрами души)
//---------------------------------------------------------------------------
{
  .число М
    ами, Т              // фибр-ами
}

