// Тип 8

.таблица "femcompr_1"
{
  .число Е
    ь, И                // проруб-ь
    и, Р                // проруб-и
    и, Д                // проруб-и
    ь, В                // проруб-ь
    ью, Т               // проруб-ью
    и, П                // о проруб-и
  .число М
    и, И                // проруб-и
    ей, Р               // проруб-ей
    ям, Д               // проруб-ям
    ями, Т              // проруб-ями
    ях, П               // о проруб-ях
}

.тип ж 8a1, ж 8e1, ж 8e1//8a1, ж 8a1//8e1, мн._от_ж 8e1, ж 8f''1, ж 8e1//8f''
//---------------------------------------------------------------------------
// Пример: прорубь, площадь
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // проруб-ь
    и, Р                // проруб-и
    и, Д                // проруб-и
    ь, В                // проруб-ь
    ью, Т               // проруб-ью
    и, П                // о проруб-и
  .число М
    и, И                // проруб-и
    ей, Р               // проруб-ей
    ям, Д               // проруб-ям
    и, В                // проруб-и
    ями, Т              // проруб-ями
    ях, П               // о проруб-ях
}

.тип ж 8e1E1
//---------------------------------------------------------------------------
// Пример: кость
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // кост-ь
    и, Р                // кост-и
    и, Д                // кост-и
    ь, В                // кост-ь
    ью, Т               // кост-ью
    и, П                // кост-и
  .число М
    и, И                // кост-и
    ей, Р               // кост-ей
    ям, Д               // кост-ям
    и, В                // кост-и
    ями, Т              // кост-ями
    ьми, Т              // кост-ьми
    ях, П               // о кост-ях
}

.тип ж 8a1-, ж 8e1-, ж 8f''2-
//---------------------------------------------------------------------------
// Пример: медь
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // мед-ь
    и, Р                // мед-и
    и, Д                // мед-и
    ь, В                // мед-ь
    ью, Т               // мед-ью
    и, П                // о мед-и
}

.тип ж 8a2, ж 8e2
//---------------------------------------------------------------------------
// Пример: блажь
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // блаж-ь
    и, Р                // блаж-и
    и, Д                // блаж-и
    ь, В                // блаж-ь
    ью, Т               // блаж-ью
    и, П                // о блаж-и
  .число М
    и, И                // блаж-и
    ей, Р               // блаж-ей
    ам, Д               // блаж-ам
    и, В                // блаж-и
    ами, Т              // блаж-ами
    ах, П               // о блаж-ах
}

.тип ж 8a2-
//---------------------------------------------------------------------------
// Пример: ветошь
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // ветош-ь
    и, Р                // ветош-и
    и, Д                // ветош-и
    ь, В                // ветош-ь
    ью, Т               // ветош-ью
    и, П                // о ветош-и
}

.тип жо 8a1, жо 8e1
//---------------------------------------------------------------------------
// Пример: свекровь
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // свекров-ь
    и, Р                // свекров-и
    и, Д                // свекров-и
    ь, В                // свекров-ь
    ью, Т               // свекров-ью
    и, П                // о свекров-и
  .число М
    и, И                // свекров-и
    ей, Р               // свекров-ей
    ям, Д               // свекров-ям
    ей, В               // свекров-ей
    ями, Т              // свекров-ями
    ях, П               // о свекров-ях
}

.тип жо 8a1-
//---------------------------------------------------------------------------
// Пример: шваль
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // швал-ь
    и, Р                // швал-и
    и, Д                // швал-и
    ь, В                // швал-ь
    ью, Т               // швал-ью
    и, П                // о швал-и
}

.тип ж//жо 8a1, ж//жо 8a1//8e1, жо//ж 8e1
//---------------------------------------------------------------------------
// Пример: тень
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // тен-ь
    и, Р                // тен-и
    и, Д                // тен-и
    ь, В                // тен-ь
    ью, Т               // тен-ью
    и, П                // о тен-и
  .число М
    и, И                // тен-и
    ей, Р               // тен-ей
    ям, Д               // тен-ям
    и, Вн               // тен-и
    ей, Во              // тен-ей
    ями, Т              // тен-ями
    ях, П               // о тен-ях
}

.тип жо 8a2, жо 8e2
//---------------------------------------------------------------------------
// Пример: бестолочь
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // бестолоч-ь
    и, Р                // бестолоч-и
    и, Д                // бестолоч-и
    ь, В                // бестолоч-ь
    ью, Т               // бестолоч-ью
    и, П                // о бестолоч-и
  .число М
    и, И                // бестолоч-и
    ей, Р               // бестолоч-ей
    ам, Д               // бестолоч-ам
    ей, В               // бестолоч-ей
    ами, Т              // бестолоч-ами
    ах, П               // о бестолоч-ах
}

.тип ж 8a1E1
//---------------------------------------------------------------------------
// Пример: пядень, сажень
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // пяден-ь
    и, Р                // пяден-и
    и, Д                // пяден-и
    ь, В                // пяден-ь
    ью, Т               // пяден-ью
    и, П                // о пяден-и
  .число М
    и, И                // пяден-и
    ь, Р                // пяден-ь
    ей, Р               // пяден-ей
    ям, Д               // пяден-ям
    и, В                // пяден-и
    ями, Т              // пяден-ями
    ях, П               // о пяден-ях
}

.тип ж 8a1E2
//---------------------------------------------------------------------------
// Пример: гроздь
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // грозд-ь
    и, Р                // грозд-и
    и, Д                // грозд-и
    ь, В                // грозд-ь
    ью, Т               // грозд-ью
    и, П                // о грозд-и
  .число М
    ья, И               // грозд-ья
    ьев, Р              // грозд-ьев
    ьям, Д              // грозд-ьям
    ья, В               // грозд-ья
    ьями, Т             // грозд-ьями
    ьях, П              // о грозд-ьях
}

.тип ж 8a2E1
//---------------------------------------------------------------------------
// Пример: полночь
//---------------------------------------------------------------------------
{
  .число Е
    ночь, И             // пол-ночь
    уночи, Р            // пол-уночи
    уночи, Д            // пол-уночи
    ночь, В             // пол-ночь
    уночью, Т           // пол-уночью
    уночи, П            // о пол-уночи
  .число М
    уночи, И            // пол-уночи
    уночей, Р           // пол-уночей
    уночам, Д           // пол-уночам
    уночи, В            // пол-уночи
    уночами, Т          // пол-уночами
    уночах, П           // о пол-уночах
}

.тип ж 8*b'E1
//---------------------------------------------------------------------------
// Пример: любовь, нелюбовь
//---------------------------------------------------------------------------
{
  .число Е
    овь, И              // люб-овь
    ви, Р               // люб-ви
    ви, Д               // люб-ви
    овь, В              // люб-овь
    овью, Т             // люб-овью
    ви, П               // о люб-ви
  .число М
    ви, И               // люб-ви
    вей, Р              // люб-вей
    вям, Д              // люб-вям
    ви, В               // люб-ви
    вями, Т             // люб-вями
    вях, П              // о люб-вях
}

.тип ж 8*b'E2
//---------------------------------------------------------------------------
// Пример: ложь, рожь
//---------------------------------------------------------------------------
{
  .число Е
    ожь, И              // л-ожь
    жи, Р               // л-жи
    жи, Д               // л-жи
    ожь, В              // л-ожь
    ожью, Т             // л-ожью
    жи, П               // о л-жи
  .число М
    жи, И|затрудн       // л-жи
    жей, Р|затрудн      // л-жей
    жам, Д|затрудн      // л-жам
    жи, В|затрудн       // л-жи
    жами, Т|затрудн     // л-жами
    жах, П|затрудн      // о л-жах
}

.тип ж 8*eE1
//---------------------------------------------------------------------------
// Пример: церковь
//---------------------------------------------------------------------------
{
  .число Е
    овь, И              // церк-овь
    ви, Р               // церк-ви
    ви, Д               // церк-ви
    овь, В              // церк-овь
    овью, Т             // церк-овью
    ви, П               // о церк-ви
  .число М
    ви, И               // церк-ви
    вей, Р              // церк-вей
    вям, Д              // церк-вям
    вам, Д              // церк-вам
    ви, В               // церк-ви
    вями, Т             // церк-вями
    вами, Т             // церк-вами
    вях, П              // церк-вях
    вах, П              // о церк-вах
}

.тип жо 8*b'E2
//---------------------------------------------------------------------------
// Пример: вошь
//---------------------------------------------------------------------------
{
  .число Е
    ошь, И              // в-ошь
    ши, Р               // в-ши
    ши, Д               // в-ши
    ошь, В              // в-ошь
    ошью, Т             // в-ошью
    ши, П               // о в-ши
  .число М
    ши, И               // в-ши
    шей, Р              // в-шей
    шам, Д              // в-шам
    ши, В               // в-ши
    шами, Т             // в-шами
    шах, П              // о в-шах
}

.тип жо 8eE3
//---------------------------------------------------------------------------
// Пример: мать
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // мат-ь
    ери, Р              // мат-ери
    ери, Д              // мат-ери
    ь, В                // мат-ь
    ерью, Т             // мат-ерью
    ери, П              // о мат-ери
  .число М
    ери, И              // мат-ери
    ерей, Р             // мат-ерей
    ерям, Д             // мат-ерям
    ерей, В             // мат-ерей
    ерями, Т            // мат-ерями
    ерях, П             // о мат-ерях
}

.тип жо 8eE4
//---------------------------------------------------------------------------
// Пример: дочь
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // доч-ь
    ери, Р              // доч-ери
    ери, Д              // доч-ери
    ь, В                // доч-ь
    ерью, Т             // доч-ерью
    ери, П              // о доч-ери
  .число М
    ери, И              // доч-ери
    ерей, Р             // доч-ерей
    ерям, Д             // доч-ерям
    ерей, В             // доч-ерей
    ерьми, Т            // доч-ерьми
    ерями, Т            // доч-ерями
    ерях, П             // о доч-ерях
}

.тип ж 8e1E5
//---------------------------------------------------------------------------
// Пример: дверь
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // двер-ь
    и, Р                // двер-и
    и, Д                // двер-и
    ь, В                // двер-ь
    ью, Т               // двер-ью
    и, П                // о двер-и
  .число М
    и, И                // двер-и
    ей, Р               // двер-ей
    ям, Д               // двер-ям
    и, В                // двер-и
    ьми, Т              // двер-ьми
    ями, Т              // двер-ями
    ях, П               // о двер-ях
}

.тип жо 8e1E5
//---------------------------------------------------------------------------
// Пример: лошадь
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // лошад-ь
    и, Р                // лошад-и
    и, Д                // лошад-и
    ь, В                // лошад-ь
    ью, Т               // лошад-ью
    и, П                // о лошад-и
  .число М
    и, И                // лошад-и
    ей, Р               // лошад-ей
    ям, Д               // лошад-ям
    ей, В               // лошад-ей
    ьми, Т              // лошад-ьми
    ями, Т              // лошад-ями
    ях, П               // о лошад-ях
}

// Слова типа 8, употребляющиеся лишь в устойчивых сочетаниях в какой-либо
// форме

.тип ж 8a1:f1
//---------------------------------------------------------------------------
// Пример: сарынь (на кичку)
//---------------------------------------------------------------------------
{
  .число Е
    ь, И
}

.тип ж 8a1:f2
//---------------------------------------------------------------------------
// Пример: полусмерть
//---------------------------------------------------------------------------
{
  .число Е
    и, Р
}

.тип ж 8a1:f45
//---------------------------------------------------------------------------
// Пример: ощупь
//---------------------------------------------------------------------------
{
  .число Е
    ь, В
    ью, Т
}

