.type п <00002>
{
  .sing
  .msc
    ий, И
    ого, Р
    ому, Д
    ий, Вн
    ого, Во
    им, Т
    ім, П
    ому, П
  .plur
    і, И
    их, Р
    им, Д
    і, Вн
    их, Во
    ими, Т
    их, П
}

.type п <00003>
{
  .sing
  .fem
    а, И
    ої, Р
    ій, Д
    у, В
    ою, Т
    ій, П
  .plur
    і, И
    их, Р
    им, Д
    і, Вн
    их, Во
    ими, Т
    их, П
}

.type п <00005>
{
  .sing
  .msc
    ів, И
    ового, Р
    овому, Д
    ів, Вн
    ового, Во
    овим, Т
    овім, П
    овому, П
  .fem
    ова, И
    ової, Р
    овій, Д
    ову, В
    овою, Т
    овій, П
  .nwt
    ове, И
    ового, Р
    овому, Д
    овим, Т
    овім, П
    овому, П
  .plur
    ові, И
    ових, Р
    овим, Д
    ові, Вн
    ових, Во
    овими, Т
    ових, П
}

.type п <00006>
{
  .plur
    і, И
    их, Р
    им, Д
    і, В
    их, В
    ими, Т
    их, П
}

.type п <00008>
{
  .sing
  .nwt
    е, И
    ого, Р
    ому, Д
    е, В
    им, Т
    ім, П
    ому, П
  .plur
    і, И
    их, Р
    им, Д
    і, Вн
    их, Во
    ими, Т
    их, П
}

.type п <00009>
{
  .sing
  .msc
    ий, И
    ього, Р
    ьому, Д
    ий, Вн
    ього, Во
    им, Т
    ьому, П
    ім, П
  .fem
    я, И
    ьої, Р
    ій, Д
    ю, В
    ьою, Т
    ій, П
  .nwt
    е, И
    ього, Р
    ьому, Д
    им, Т
    ьому, П
    ім, П
  .plur
    і, И
    их, Р
    им, Д
    і, Вн
    их, Во
    ими, Т
    их, П
}

.type п <00010>
{
  .sing
  .msc
    ів, И
    евого, Р
    евому, Д
    ів, Вн
    евого, Во
    евим, Т
    евім, П
    евому, П
  .fem
    ева, И
    евої, Р
    евій, Д
    еву, В
    евою, Т
    евій, П
  .nwt
    еве, И
    евого, Р
    евому, Д
    евим, Т
    евім, П
    евому, П
  .plur
    еві, И
    евих, Р
    евим, Д
    еві, Вн
    евих, Во
    евими, Т
    евих, П
}

.type п <00011>
{
  .sing
  .msc
    їй, И
    його, Р
    йому, Д
    їй, Вн
    ого, Во
    їм, Т
    їм, П
    йому, П
  .fem
    я, И
    йої, Р
    їй, Д
    ю, В
    йою, Т
    їй, П
  .nwt
    є, И
    його, Р
    йому, Д
    їм, Т
    йому, П
    їм, П
  .plur
    ї, И
    їх, Р
    їм, Д
    ї, Вн
    їх, Во
    їми, Т
    їх, П
}

.type п <00012>
{
  .sing
  .msc
    '', И
    ного, Р
    ному, Д
    н, Вн
    ного, Во
    ним, Т
    нім, П
    ному, П
  .fem
    на, И
    ної, Р
    ній, Д
    ну, В
    ною, Т
    ній, П
  .nwt
    не, И
    ного, Р
    ному, Д
    ним, Т
    ному, П
    нім, П
  .plur
    ні, И
    них, Р
    ним, Д
    них, Вн
    ні, Во
    ними, Т
    них, П
}

.type п <00013>
{
  .sing
  .fem
    а, И
    ої, Р
    ій, Д
    у, В
    ою, Т
    ій, П
  .plur
    і, И
    их, Р
    им, Д
    их, Во
    ими, Т
    их, П
}

.type п <00014>
{
  .sing
  .fem
    я, И
    ьої, Р
    ій, Д
    ю, В
    ьою, Т
    ій, П
}

.type п <00015>
{
  .sing
  .msc
    '', И
    ого, Р
    ому, Д
    ого, В
    им, Т
    ому, П
    ім, П
  .fem
    а, И
    ої, Р
    ій, Д
    у, В
    ою, Т
    ій, П
  .nwt
    е, И
    ого, Р
    ому, Д
    им, Т
    ім, П
    ому, П
  .plur
    і, И
    их, Р
    им, Д
    их, Вн
    і, Во
    ими, Т
    их, П
}

.type п <00016>
{
  .sing
  .msc
    ів, И
    ового, Р
    овому, Д
    ів, Вн
    ового, Во
    овим, Т
    овім, П
    овому, П
  .plur
    ові, И
    ових, Р
    овим, Д
    ові, Вн
    ових, Во
    овими, Т
    ових, П
}

.type п <00017>
{
  .sing
  .msc
    ен, И
    ного, Р
    ному, Д
    ен, Вн
    ного, Во
    ним, Т
    нім, П
    ному, П
  .fem
    на, И
    ної, Р
    ній, Д
    ну, В
    ною, Т
    ній, П
  .nwt
    не, И
    ного, Р
    ному, Д
    ним, Т
    ному, П
    нім, П
  .plur
    ні, И
    них, Р
    ним, Д
    них, Вн
    ні, Во
    ними, Т
    них, П
}

.type п <00018>
{
  .sing
  .msc
    їв, И
    євого, Р
    євому, Д
    їв, Вн
    євого, Во
    євим, Т
    євому, П
    євім, П
}

.type п <00019>
{
  .sing
  .msc
    '', И
    ого, Р
    ому, Д
    '', Вн
    ого, Во
    им, Т
    ому, П
    ім, П
}

.type п <00020>
{
  .sing
  .msc
    ів, И
    ьового, Р
    ьовому, Д
    ів, Вн
    ьового, Во
    ьовим, Т
    ьовім, П
    ьовому, П
  .fem
    ьова, И
    ьової, Р
    ьовій, Д
    ьову, В
    ьовою, Т
    ьовій, П
  .nwt
    ьове, И
    ьового, Р
    ьовому, Д
    ьовим, Т
    ьовім, П
    ьовому, П
  .plur
    ьові, И
    ьових, Р
    ьовим, Д
    ьові, Вн
    ьових, Во
    ьовими, Т
    ьових, П
}

.type п <00021>
{
  .sing
  .fem
    я, И
    ьої, Р
    ій, Д
    ю, В
    ьою, Т
    ій, П
  .plur
    і, И
    іх, Р
    ім, Д
    іх, Во
    іми, Т
    іх, П
}

.type п <00022>
{
  .sing
  .msc
    їв, И
    євого, Р
    євому, Д
    їв, Вн
    євого, Во
    євим, Т
    євому, П
    євім, П
  .fem
    єва, И
    євої, Р
    євій, Д
    єву, В
    євою, Т
    євій, П
  .nwt
    єве, И
    євого, Р
    євому, Д
    євим, Т
    євім, П
    євому, П
  .plur
    єві, И
    євих, Р
    євим, Д
    єві, Вн
    євих, Во
    євими, Т
    євих, П
}
