.type числ <00001>
{
  .sing
    о, И
    ьох, Р
    ьом, Д
    о, В
    ьох, В
    ьма, Т
    ьох, П
}

.type числ <00002>
{
  .sing
    '', И
    ьох, Р
    и, Р
    и, Д
    ьом, Д
    '', В
    ьох, В
    ьома, Т
    ьма, Т
    и, П
    ьох, П
}

.type числ <00003>
{
  .sing
    еро, И
    ьох, Р
    ьом, Д
    еро, В
    ьох, В
    ьома, Т
    ьма, Т
    ьох, П
}

.type числ <00004>
{
  .sing
    а, И
    ох, Р
    ом, Д
    ох, В
    а, В
    ома, Т
    ох, П
}

.type числ <00005>
{
  .sing
    ь, И
    и, Р
    ьох, Р
    и, Д
    ьом, Д
    ь, В
    ьох, В
    ьома, Т
    ьма, Т
    и, П
    ьох, П
}

.type числ <00006>
{
  .sing
    сот, И
    исот, Р
    истам, Д
    сот, В
    ьмастами, Т
    ьомастами, Т
    истах, П
}

.type числ <00007>
{
  .sing
    о, И
    а, Р
    а, Д
    о, В
    а, Т
    а, П
}

.type числ <00008>
{
  .sing
    оє, И
    ох, Р
    ом, Д
    ох, В
    ома, Т
    ох, П
}

.type числ <00009>
{
  .sing
    істі, И
    охсот, Р
    омстам, Д
    істі, В
    омастами, Т
    охстах, П
}

.type числ <00010>
{
  .sing
    '', И
    '', Р
    '', Д
    '', В
    '', Т
    '', П
}

.type числ <00011>
{
  .sing
    '', И
    а, Р
    а, Д
    '', В
    а, Т
    а, П
}

.type числ <00012>
{
  .sing
    и, И
    ох, Р
    ом, Д
    ох, В
    и, В
    ома, Т
    ох, П
}

.type числ <00013>
{
  .sing
    оє, И
    ьох, Р
    ьом, Д
    ьох, В
    ьома, Т
    ьох, П
}

.type числ <00014>
{
  .sing
    иста, И
    ьохсот, Р
    ьомстам, Д
    иста, В
    ьомастами, Т
    ьохстах, П
}

.type числ <00015>
{
  .sing
    и, И
    ьох, Р
    ьом, Д
    и, В
    ьох, В
    ьома, Т
    ьох, П
}

.type числ <00016>
{
  .sing
    етверо, И
    отирьох, Р
    чотирьом, Д
    етверо, В
    отирьох, В
    отирма, Т
    отирьох, П
}

.type числ <00017>
{
  .sing
    ість, И
    істьох, Р
    ести, Р
    істьом, Д
    ести, Д
    ість, В
    істьох, В
    істьма, Т
    істьома, Т
    ести, П
    істьох, П
}

.type числ <00018>
{
  .sing
    естеро, И
    істьох, Р
    істьом, Д
    естеро, В
    істьох, В
    істьма, Т
    істьох, П
}

.type числ <00019>
{
  .sing
    и, И
    ьох, Р
    ьом, Д
    и, В
    ьох, В
    ма, Т
    ьох, П
}

.type числ <00020>
{
  .sing
    иста, И
    ьохсот, Р
    ьомстам, Д
    иста, В
    мастами, Т
    ьохстах, П
}

.type числ_2 <00001>
{
  .sing
  .msc
    а, И
    ох, Р
    ом, Д
    а, Вн
    ох, Во
    ома, Т
    ох, П
  .fem
    і, И
    ох, Р
    ом, Д
    і, Вн
    ох, Во
    ома, Т
    ох, П
  .nwt
    а, И
    ох, Р
    ом, Д
    а, Вн
    ох, Во
    ома, Т
    ох, П
}

.type числ_2 <00002>
{
  .sing
  .msc
    ин, И
    ного, Р
    ному, Д
    ин, Вн
    ного, Во
    ним, Т
    нім, П
    ному, П
  .fem
    на, И
    нієї, Р
    ної, Р
    ній, Д
    ну, В
    ною, Т
    нією, Т
    ній, П
  .nwt
    но, И
    не, И
    ного, Р
    ному, Д
    ним, Т
    нім, П
    ному, П
  .plur
    ні, И
    них, Р
    ним, Д
    них, Вн
    ні, Во
    ними, Т
    них, П
}

