.тип гс 1a, гсп 1a
//--------------------------------------------------------------------------
// Пример: Сараево
//--------------------------------------------------------------------------
{
  .число Е
    о, И               // Сараев-о
    а, Р               // Сараев-а
    у, Д               // Сараев-у
    о, В               // Сараев-о
    ым, Т              // Сараев-ым
    е, П               // Сараев-е
}

.тип гс 6*a, гсп 6*a
//--------------------------------------------------------------------------
// Пример: Приднестровье
//--------------------------------------------------------------------------
{
  .число Е
    ье, И               // Приднестров-ье
    ья, Р               // Приднестров-ья
    ью, Д               // Приднестров-ью
    ье, В               // Приднестров-ье
    ьем, Т              // Приднестров-ьем
    ье, П               // Приднестров-ье
}

