//***************************************************************************
//*                  "Географические" прилагательные.                       *
//* Все они не имеют ни кратких форм, ни сравнительных степеней, ни наречий *
//***************************************************************************

.тип г-п 1
//---------------------------------------------------------------------------
// Пример: беловежский
//---------------------------------------------------------------------------
{
  .число Е
  .род м
    ий, И               // беловежск-ий
    ого, Р              // беловежск-ого
    ому, Д              // беловежск-ому
    ий, Вн              // беловежск-ий
    ого, Во             // беловежск-ого
    им, Т               // беловежск-им
    ом, П               // беловежск-ом
  .род ж
    ая, И               // беловежск-ая
    ой, Р               // беловежск-ой
    ой, Д               // беловежск-ой
    ую, В               // беловежск-ую
    ой, Т               // беловежск-ой
    ою, Т               // беловежск-ою
    ой, П               // беловежск-ой
  .род с
    ое, И               // беловежск-ое
    ого, Р              // беловежск-ого
    ому, Д              // беловежск-ому
    ое, Вн              // беловежск-ое
    ого, Во             // беловежск-ого
    им, Т               // беловежск-им
    ом, П               // беловежск-ом
  .число М
  .род
    ие, И               // беловежск-ие
    их, Р               // беловежск-их
    им, Д               // беловежск-им
    ие, Вн              // беловежск-ие
    их, Во              // беловежск-их
    ими, Т              // беловежск-ими
    их, П               // беловежск-их
}

.тип г-п 2
//---------------------------------------------------------------------------
// Пример: чудской
//---------------------------------------------------------------------------
{
  .число Е
  .род м
    ой, И               // чудск-ий
    ого, Р              // чудск-ого
    ому, Д              // чудск-ому
    ой, Вн              // чудск-ий
    ого, Во             // чудск-ого
    им, Т               // чудск-им
    ом, П               // чудск-ом
  .род ж
    ая, И               // чудск-ая
    ой, Р               // чудск-ой
    ой, Д               // чудск-ой
    ую, В               // чудск-ую
    ой, Т               // чудск-ой
    ою, Т               // чудск-ою
    ой, П               // чудск-ой
  .род с
    ое, И               // чудск-ое
    ого, Р              // чудск-ого
    ому, Д              // чудск-ому
    ое, Вн              // чудск-ое
    ого, Во             // чудск-ого
    им, Т               // чудск-им
    ом, П               // чудск-ом
  .число М
  .род
    ие, И               // чудск-ие
    их, Р               // чудск-их
    им, Д               // чудск-им
    ие, Вн              // чудск-ие
    их, Во              // чудск-их
    ими, Т              // чудск-ими
    их, П               // чудск-их
}

