//***************************************************************************
//*                   Географические названия мужского рода                 *
//*                   Все они не имеют множественного числа                 *
//***************************************************************************

.тип гм 1*a
//---------------------------------------------------------------------------
// Пример: слово Египет
//---------------------------------------------------------------------------
{
  .число Е
    ет, И               // Егип-ет
    та, Р               // Егип-та
    ту, Д               // Егип-ту
    ет, В               // Египе-т
    том, Т              // Егип-том
    те, П               // Егип-те
}

.тип гм 1*b
//---------------------------------------------------------------------------
// Пример: слово Орел
//---------------------------------------------------------------------------
{
  .число Е
    ел, И               // Ор-ел
    ла, Р               // Ор-ла
    лу, Д               // Ор-лу
    ел, В               // Ор-ел
    лом, Т              // Ор-лом
    ле, П               // Ор-ле
}

.тип гм 1a, гмп 1a, гм 1b
//---------------------------------------------------------------------------
// Пример: Мэн, Киев
//---------------------------------------------------------------------------
{
  .число Е
    '', И               // Киев
    а, Р                // Киев-а
    у, Д                // Киев-у
    '', В               // Киев
    ом, Т               // Киев-ом
    е, П                // Киев-е
}

.тип мн._от_гм 1a
//---------------------------------------------------------------------------
// Пример: Нидерланды
//---------------------------------------------------------------------------
{
  .число М
    ы, И                // Нидерланд-ы
    ов, Р               // Нидерланд-ов
    ам, Д               // Нидерланд-ам
    ы, В                // Нидерланд-ы
    ами, Т              // Нидерланд-ами
    ах, П               // о Нидерланд-ах
}

.тип гм 2a, гмп 2a
//---------------------------------------------------------------------------
// Пример: Чернобыль
//---------------------------------------------------------------------------
{
  .число Е
    ь, И                // Чернобыл-ь
    я, Р                // Чернобыл-я
    ю, Д                // Чернобыл-ю
    ь, В                // Чернобыл-ь
    ем, Т               // Чернобыл-ем
    е, П                // о Чернобыл-е
}

.тип мн._от_гм 2a
//---------------------------------------------------------------------------
// Пример: Жигули
//---------------------------------------------------------------------------
{
  .число М
    и, И                // Жигул-и
    ей, Р               // Жигул-ей
    ям, Д               // Жигул-ям
    и, В                // Жигул-и
    ями, Т              // Жигул-ями
    ях, П               // о Жигул-ях
}

.тип гм 3a, гмп 3a, гм 3b, гмп 3b
//---------------------------------------------------------------------------
// Пример: Гамбург
//---------------------------------------------------------------------------
{
  .число Е
    '', И               // Гамбург
    а, Р                // Гамбург-а
    у, Д                // Гамбург-у
    '', В               // Гамбург
    ом, Т               // Гамбург-ом
    е, П                // Гамбург-е
}

.тип мн._от_гм 3a
//---------------------------------------------------------------------------
// Пример: Сокольники
//---------------------------------------------------------------------------
{
  .число М
    и, И                // Сокольник-и
    ов, Р               // Сокольник-ов
    ам, Д               // Сокольник-ам
    и, В                // Сокольник-и
    ами, Т              // Сокольник-ами
    ах, П               // о Сокольник-ах
}

.тип мн._от_гм 4a
//---------------------------------------------------------------------------
// Пример: Аппалачи
//---------------------------------------------------------------------------
{
  .число М
    и, И                // Аппалач-и
    ей, Р               // Аппалач-ей
    ам, Д               // Аппалач-ам
    и, В                // Аппалач-и
    ами, Т              // Аппалач-ами
    ах, П               // об Аппалач-ах
}

.тип гм 4a, гмп 4a
//---------------------------------------------------------------------------
// Пример: Кембридж, Ламанш
//---------------------------------------------------------------------------
{
  .число Е
    '', И               // Ламанш
    а, Р                // Ламанш-а
    у, Д                // Ламанш-у
    '', В               // Ламанш
    ем, Т               // Ламанш-ем
    е, П                // о Ламанш-е
}

.тип гм 4b, гмп 4b
//---------------------------------------------------------------------------
// Пример: Иртыш
//---------------------------------------------------------------------------
{
  .число Е
    '', И               // Иртыш
    а, Р                // Иртыш-а
    у, Д                // Иртыш-у
    '', В               // Иртыш
    ом, Т               // Иртыш-ом
    е, П                // об Иртыш-е
}

.тип гм 5*b, гмп 5*b
//---------------------------------------------------------------------------
// Пример: Елец, Петродворец
//---------------------------------------------------------------------------
{
  .число Е
    ец, И               // Петродвор-ец
    ца, Р               // Петродвор-ца
    цу, Д               // Петродвор-цу
    ец, В               // Петродвор-ец
    цом, Т              // Петродвор-цом
    це, П               // о Петродвор-це
}

.тип гм 5a, гмп 5a
//---------------------------------------------------------------------------
// Пример: Суэц
//---------------------------------------------------------------------------
{
  .число Е
    '', И               // Суэц
    а, Р                // Суэц-а
    у, Д                // Суэц-у
    '', В               // Суэц
    ем, Т               // Суэц-ем
    е, П                // о Суэц-е
}

.тип мн._от_гм 5b
//---------------------------------------------------------------------------
// Пример: Черновцы
//---------------------------------------------------------------------------
{
  .число М
    ы, И                // Черновц-ы
    ов, Р               // Черновц-ов
    ам, Д               // Черновц-ам
    ы, В                // Черновц-ы
    ами, Т              // Черновц-ами
    ах, П               // о Черновц-ах
}

.тип гм 6a, гмп 6a
//---------------------------------------------------------------------------
// Пример: Парагвай
//---------------------------------------------------------------------------
{
  .число Е
    й, И                // Парагва-й
    я, Р                // Парагва-я
    ю, Д                // Парагва-ю
    й, В                // Парагва-й
    ем, Т               // Парагва-ем
    е, П                // о Парагва-е
}

.тип мн._от_гм 6a
//---------------------------------------------------------------------------
// Пример: Гималаи
//---------------------------------------------------------------------------
{
  .число М
    и, И                // Гимала-и
    ев, Р               // Гимала-ев
    ям, Д               // Гимала-ям
    и, В                // Гимала-и
    ями, Т              // Гимала-ями
    ях, П               // о Гимала-ях
}

.тип гм 7a, гмп 7a
//---------------------------------------------------------------------------
// Пример: Маврикий
//---------------------------------------------------------------------------
{
  .число Е
    й, И                // Маврики-й
    я, Р                // Маврики-я
    ю, Д                // Маврики-ю
    й, В                // Маврики-й
    ем, Т               // Маврики-ем
    и, П                // о Маврики-е
}
