//************************ Тип словоизменения 4 ****************************

//------------------ Неодушевленные существительные ------------------------

.тип с 4a
//--------------------------------------------------------------------------
// Пример: жилище
//--------------------------------------------------------------------------
{
  .число Е
    е, И                // жилищ-е
    а, Р                // жилищ-а
    у, Д                // жилищ-у
    е, В                // жилищ-е
    ем, Т               // жилищ-ем
    е, П                // о жилищ-е
  .число М
    а, И                // жилищ-а
    '', Р               // жилищ
    ам, Д               // жилищ-ам
    а, В                // жилищ-а
    ами, Т              // жилищ-ами
    ах, П               // о жилищ-ах
}

.тип с 4a"1"
//--------------------------------------------------------------------------
// Пример: лбище
// Нестандартное окончание И. мн. -и
//--------------------------------------------------------------------------
{
  .число Е
    е, И                // лбищ-е
    а, Р                // лбищ-а
    у, Д                // лбищ-у
    е, В                // лбищ-е
    ем, Т               // лбищ-ем
    е, П                // о лбищ-е
  .число М
    и, И                // лбищ-и
    '', Р               // лбищ
    ам, Д               // лбищ-ам
    а, В                // лбищ-а
    ами, Т              // лбищ-ами
    ах, П               // о лбищ-ах
}

.тип с 4a["1"]
//--------------------------------------------------------------------------
// Пример: сугробище
// Нестандартное окончание И. мн. -и, однако возможно и стандартоное
//--------------------------------------------------------------------------
{
  .число Е
    е, И                // сугробищ-е
    а, Р                // сугробищ-а
    у, Д                // сугробищ-у
    е, В                // сугробищ-е
    ем, Т               // сугробищ-ем
    е, П                // о сугробищ-е
  .число М
    и, И                // сугробищ-и
    а, И                // сугробищ-а
    '', Р               // сугробищ
    ам, Д               // сугробищ-ам
    а, В                // сугробищ-а
    ами, Т              // сугробищ-ами
    ах, П               // о сугробищ-ах
}

.тип с 4aE1
//--------------------------------------------------------------------------
// Пример: вече
//--------------------------------------------------------------------------
{
  .число Е
    е, И                // веч-е
    а, Р                // веч-а
    у, Д                // веч-у
    е, В                // веч-е
    ем, Т               // веч-ем
    е, П                // о веч-е
  .число М
    а, И                // веч-а
    '', Р               // веч
    ей, Р               // веч-ей
    ам, Д               // веч-ам
    а, В                // веч-а
    ами, Т              // веч-ами
    ах, П               // о веч-ах
}

.тип с 4f"1"
//--------------------------------------------------------------------------
// Пример: плечо
// Нестандартное окончание И. мн. и В. мн.
//--------------------------------------------------------------------------
{
  .число Е
    о, И                // плеч-о
    а, Р                // плеч-а
    у, Д                // плеч-у
    о, В                // плеч-о
    ом, Т               // плеч-ом
    е, П                // о плеч-е
  .число М
    и, И                // плеч-и
    '', Р               // плеч
    ам, Д               // плеч-ам
    и, В                // плеч-и
    ами, Т              // плеч-ами
    ах, П               // о плеч-ах
}

//------------------- Одушевленные существительные -------------------------

.тип со 4a
//--------------------------------------------------------------------------
// Пример: чудовище
//--------------------------------------------------------------------------
{
  .число Е
    е, И                // чудовищ-е
    а, Р                // чудовищ-а
    у, Д                // чудовищ-у
    е, В                // чудовищ-е
    ем, Т               // чудовищ-ем
    е, П                // о чудовищ-е
  .число М
    а, И                // чудовищ-а
    '', Р               // чудовищ
    ам, Д               // чудовищ-ам
    '', В               // чудовищ
    ами, Т              // чудовищ-ами
    ах, П               // о чудовищ-ах
}

.тип со 4a"1"#4
//--------------------------------------------------------------------------
// Пример: козлище
//--------------------------------------------------------------------------
{
  .число Е
    е, И                // козлищ-е
    а, Р                // козлищ-а
    и, Р|затрудн        // козлищ-и
    у, Д                // козлищ-у
    е, Д|затрудн        // козлищ-е
    а, В                // козлищ-а
    у, В|затрудн        // козлищ-у
    ем, Т               // козлищ-ем
    ей, Т|затрудн       // козлищ-ей
    е, П                // о козлищ-е
  .число М
    и, И                // козлищ-и
    '', Р               // козлищ
    ам, Д               // козлищ-ам
    '', В               // козлищ
    ами, Т              // козлищ-ами
    ах, П               // о козлищ-ах
}

