//************************ Тип словоизменения 7 ****************************

//------------------ Неодушевленные существительные ------------------------

.тип с 7a
//--------------------------------------------------------------------------
// Пример: здание
//--------------------------------------------------------------------------
{
  .число Е
    ие, И                // здани-е
    ье, И
    ия, Р                // здани-я
    ья, Р
    ию, Д                // здани-ю
    ью, Д
    ие, В                // здани-е
    ье, В
    ием, Т               // здани-ем
    ьем, Т
    ии, П                // о здани-и
    ьи, П
  .число М
    ия, И                // здани-я
    ья, И
    ий, Р                // здани-й
    иям, Д               // здани-ям
    ьям, Д
    ия, В                // здани-я
    ья, В
    иями, Т              // здани-ями
    ьями, Т
    иях, П               // о здани-ях
    ьях, П
}

.тип с 7a-, с 7b-
//--------------------------------------------------------------------------
// Пример: дооборудование, бытие
// Отсутствуют формы множественного числа
//--------------------------------------------------------------------------
{
  .число Е
    ие, И                // дооборудовани-е
    ье, И
    ия, Р                // дооборудовани-я
    ья, Р
    ию, Д                // дооборудовани-ю
    ью, Д
    ие, В                // дооборудовани-е
    ье, В
    ием, Т               // дооборудовани-ем
    ьем, Т
    ии, П                // о дооборудовани-и
    ьи, П
}

.тип с 7b
//--------------------------------------------------------------------------
// Пример: здание
//--------------------------------------------------------------------------
{
  .число Е
    ие, И                // здани-е
    ье, И
    ия, Р                // здани-я
    ья, Р
    ию, Д                // здани-ю
    ью, Д
    ие, В                // здани-е
    ье, В
    ием, Т               // здани-ем
    ьем, Т
    ии, П                // о здани-и
    ьи, П
  .число М
    ия, И                // здани-я
    ья, И
    ий, Р                // здани-й
    иям, Д               // здани-ям
    ьям, Д
    ия, В                // здани-я
    ья, В
    иями, Т              // здани-ями
    ьями, Т
    иях, П               // о здани-ях
    ьях, П
}

.тип с 7b"2"
//--------------------------------------------------------------------------
// Пример: острие
// Нестандартна форма Р. мн. -ев
//--------------------------------------------------------------------------
{
  .число Е
    ие, И                // остри-е
    ия, Р                // остри-я
    ию, Д                // остри-ю
    ие, В                // остри-е
    ием, Т               // остри-ем
    ии, П                // оо остри-и
  .число М
    ия, И                // остри-я
    иев, Р               // остри-ев
    иям, Д               // остри-ям
    ия, В                // остри-я
    иями, Т              // остри-ями
    иях, П               // об остри-ях
}

//---- Слова, употребляющиеся лишь в составе устойчивых словосочетаний -----

.тип с 7a:n2
//--------------------------------------------------------------------------
// Пример: зазрение (без зазрения совести)
//--------------------------------------------------------------------------
{
  .число Е
    я, Р                // зазрени-я
}

.тип с 7a:n26
//--------------------------------------------------------------------------
// Пример: востребование
//--------------------------------------------------------------------------
{
  .число Е
    я, Р                // востребовани-я
    и, П                // востребовани-и
}

.тип с 7a:n3
//--------------------------------------------------------------------------
// Пример: уполномочие (по уполномочию)
//--------------------------------------------------------------------------
{
  .число Е
    ю, Д                // уполномочи-ю
}

.тип с 7a:n35
//--------------------------------------------------------------------------
// Пример: мание (по манию, манием)
//--------------------------------------------------------------------------
{
  .число Е
    ю, Д                // мани-ю
    ем, Т               // мани-ем
}

.тип с 7a:n4
//--------------------------------------------------------------------------
// Пример: всеуслышание (во всеуслышание)
//--------------------------------------------------------------------------
{
  .число Е
    е, В                // всеуслышани-е
}

.тип с 7a:n6
//--------------------------------------------------------------------------
// Пример: прошествие (по прошествии)
//--------------------------------------------------------------------------
{
  .число Е
    и, П                // прошестви-и
}

//------------------- Одушевленные существительные -------------------------

.тип со//с 7a, с//со 7a
//--------------------------------------------------------------------------
// Пример: создание
//--------------------------------------------------------------------------
{
  .число Е
    ие, И                // создани-е
    ье, И
    ия, Р                // создани-я
    ья, Р
    ию, Д                // создани-ю
    ью, Д
    ие, В                // создани-е
    ье, В
    ием, Т               // создани-ем
    ьем, Т
    ии, П                // о создани-и
    ьи, П
  .число М
    ия, И                // создани-я
    ья, И
    ий, Р                // создани-й
    иям, Д               // создани-ям
    ьям, Д
    ия, Вн               // создани-я
    ья, Вн
    ий, Во               // создани-й
    иями, Т              // создани-ями
    ьями, Т
    иях, П               // о создани-ях
    ьях, П
}

