//************************ Тип словоизменения 8 ****************************

//------------------ Неодушевленные существительные ------------------------

.тип с 8°a, с 8°c2
//--------------------------------------------------------------------------
// Пример: знамя, имя
//--------------------------------------------------------------------------
{
  .число Е
    я, И                // знам-я
    ени, Р              // знам-ени
    ени, Д              // знам-ени
    я, В                // знам-я
    енем, Т             // знам-енем
    ени, П              // о знам-ени
  .число М
    ена, И              // знам-ена
    ен, Р               // знам-ен
    енам, Д             // знам-енам
    ена, В              // знам-ена
    енами, Т            // знам-енами
    енах, П             // о знам-енах
}

.тип с 8°c1
//--------------------------------------------------------------------------
// Пример: семя
//--------------------------------------------------------------------------
{
  .число Е
    я, И                // сем-я
    ени, Р              // сем-ени
    ени, Д              // сем-ени
    я, В                // сем-я
    енем, Т             // сем-енем
    ени, П              // о сем-ени
  .число М
    ена, И              // сем-ена
    ян, Р               // сем-ян
    енам, Д             // сем-енам
    ена, В              // сем-ена
    енами, Т            // сем-енами
    енах, П             // о сем-енах
}

.тип с 8°c!
//--------------------------------------------------------------------------
// Пример: беремя
// Отсутствует форма Р. мн.
//--------------------------------------------------------------------------
{
  .число Е
    я, И                // берем-я
    ени, Р              // берем-ени
    ени, Д              // берем-ени
    я, В                // берем-я
    енем, Т             // берем-енем
    ени, П              // о берем-ени
  .число М
    ена, И              // берем-ена
    енам, Д             // берем-енам
    ена, В              // берем-ена
    енами, Т            // берем-енами
    енах, П             // о берем-енах
}

.тип с 8°c-
//--------------------------------------------------------------------------
// Пример: темя
//--------------------------------------------------------------------------
{
  .число Е
    я, И                // тем-я
    ени, Р              // тем-ени
    ени, Д              // тем-ени
    я, В                // тем-я
    енем, Т             // тем-енем
    ени, П              // о тем-ени
}

.тип с 8°c?-
//--------------------------------------------------------------------------
// Пример: вымя
// Затруднено все множественное число
//--------------------------------------------------------------------------
{
  .число Е
    я, И                // вым-я
    ени, Р              // вым-ени
    ени, Д              // вым-ени
    я, В                // вым-я
    енем, Т             // вым-енем
    ени, П              // о вым-ени
  .число М
    ена, И|затрудн      // вым-ена
    ен, Р|затрудн       // вым-ен
    енам, Д|затрудн     // вым-енам
    ена, В|затрудн      // вым-ена
    енами, Т|затрудн    // вым-енами
    енах, П|затрудн     // о вым-енах
}

.тип с 8a:n145
//--------------------------------------------------------------------------
// Пример: слово полымя
//--------------------------------------------------------------------------
{
  .число Е
    я, И                // полым-я
    я, В                // полым-я
    ем, Т               // полым-ем
}

.тип со 8b:n14
//--------------------------------------------------------------------------
// Пример: слова теля и порося
//--------------------------------------------------------------------------
{
  .число Е
    я, И                // порося-я
    я, В                // порося-я
}
