.тип числ. 39:p4
//--------------------------------------------------------------------------
// Числительное тридевять
//--------------------------------------------------------------------------
{
.число Е
    ь, В
}

.тип числ. some
//--------------------------------------------------------------------------
// Числительные сколько, несколько, столько
//--------------------------------------------------------------------------
{
.число Е
    о, И                // скольк-о
    их, Р               // скольк-их
    им, Д               // скольк-им
    о, Вн               // скольк-о
    их, Во              // скольк-их
    ими, Т              // скольк-ими
    их, П               // о скольк-их
}

.тип числ._2 2
//--------------------------------------------------------------------------
// Числительное два
//--------------------------------------------------------------------------
{
.число Е
  .род м
    а, И
    ух, Р
    ум, Д
    а, Вн
    ух, Во
    умя, Т
    ух, П
  .род с
    а, И
    ух, Р
    ум, Д
    а, Вн
    ух, Во
    умя, Т
    ух, П
  .род ж
    е, И
    ух, Р
    ум, Д
    е, Вн
    ух, Во
    умя, Т
    ух, П
}

.тип числ._2 both
//--------------------------------------------------------------------------
// Числительное оба
//--------------------------------------------------------------------------
{
.число Е
  .род м
    а, И
    оих, Р
    оим, Д
    а, Вн
    оих, Во
    оими, Т
    оих, П
  .род с
    а, И
    оих, Р
    оим, Д
    а, Вн
    оих, Во
    оими, Т
    оих, П
  .род ж
    е, И
    еих, Р
    еим, Д
    е, Вн
    еих, Во
    еими, Т
    еих, П
}

.тип числ._2 3/2
//--------------------------------------------------------------------------
// Числительное полтора
//--------------------------------------------------------------------------
{
.число Е
  .род м
    тора, И
    утора, Р
    утора, Д
    тора, В
    утора, Т
    утора, П
  .род с
    тора, И
    утора, Р
    утора, Д
    тора, В
    утора, Т
    утора, П
  .род ж
    торы, И
    утора, Р
    утора, Д
    торы, Вн
    утора, Т
    утора, П
}

.тип числ. 3
//--------------------------------------------------------------------------
// Числительное три
//--------------------------------------------------------------------------
{
.число Е
    и, И
    ех, Р
    ем, Д
    и, Вн
    ех, Во
    емя, Т
    ех, П
}

.тип числ. 4
//--------------------------------------------------------------------------
// Числительное четыре
//--------------------------------------------------------------------------
{
.число Е
    е, И
    ех, Р
    ем, Д
    е, Вн
    ех, Во
    ьмя, Т
    ех, П
}

.тип числ. 5
//--------------------------------------------------------------------------
// Числительные пять, шесть, семь, девять ... двадцать, тридцать
//--------------------------------------------------------------------------
{
.число Е
    ь, И
    и, Р
    и, Д
    ь, В
    ью, Т
    и, П
}

.тип числ. 8
//--------------------------------------------------------------------------
// Числительное восемь
//--------------------------------------------------------------------------
{
.число Е
    емь, И
    ьми, Р
    ьми, Д
    емь, В
    емью, Т
    ьмью, Т
    ьми, П
}

.тип числ. 40
//--------------------------------------------------------------------------
// Числительное сорок
//--------------------------------------------------------------------------
{
.число Е
    '', И
    а, Р
    а, Д
    '', В
    а, Т
    а, П
}

.тип числ. 50
//--------------------------------------------------------------------------
// Числительное пятьдесят, шестьдесят, семьдесят
//--------------------------------------------------------------------------
{
.число Е
    ьдесят, И
    идесяти, Р
    идесяти, Д
    ьдесят, В
    ьюдесятью, Т
    идесяти, П
}

.тип числ. 80
//--------------------------------------------------------------------------
// Числительное весемьдесят
//--------------------------------------------------------------------------
{
.число Е
    емьдесят, И
    ьмидесяти, Р
    ьмидесяти, Д
    емьдесят, В
    емьюдесятью, Т
    ьмьюдесятью, Т
    ьмидесяти, П
}

.тип числ. 90
//--------------------------------------------------------------------------
// Числительное девяносто
//--------------------------------------------------------------------------
{
.число Е
    о, И
    а, Р
    а, Д
    о, В
    а, Т
    а, П
}

.тип числ. 150
//--------------------------------------------------------------------------
// Числительное полтораста
//--------------------------------------------------------------------------
{
.число Е
    тораста, И
    утораста, Р
    утораста, Д
    тораста, В
    утораста, Т
    утораста, П
}

.тип числ. 200
//--------------------------------------------------------------------------
// Числительное двести
//--------------------------------------------------------------------------
{
.число Е
    ести, И
    ухсот, Р
    умстам, Д
    ести, В
    умястами, Т
    ухстах, П
}

.тип числ. 300
//--------------------------------------------------------------------------
// Числительное триста
//--------------------------------------------------------------------------
{
.число Е
    иста, И
    ехсот, Р
    емстам, Д
    иста, В
    емястами, Т
    ехстах, П
}

.тип числ. 400
//--------------------------------------------------------------------------
// Числительное четыреста
//--------------------------------------------------------------------------
{
.число Е
    еста, И
    ехсот, Р
    емстам, Д
    еста, В
    ьмястами, Т
    ехстах, П
}

.тип числ. 500
//--------------------------------------------------------------------------
// Числительное пятьсот
//--------------------------------------------------------------------------
{
.число Е
    ьсот, И
    исот, Р
    истам, Д
    ьсот, В
    ьюстами, Т
    истах, П
}

.тип числ. 800
//--------------------------------------------------------------------------
// Числительное восемьсот
//--------------------------------------------------------------------------
{
.число Е
    емьсот, И
    ьмисот, Р
    ьмистам, Д
    емьсот, В
    емьюстами, Т
    ьмьюстами, Т
    ьмистах, П
}

.тип числ._с 2-3
//--------------------------------------------------------------------------
// Числительное двое, трое
//--------------------------------------------------------------------------
{
.число Е
    е, И                // дво-е
    их, Р               // дво-их
    им, Д               // дво-им
    е, Вн               // дво-е
    их, Во              // дво-их
    ими, Т              // дво-ими
    их, П               // дво-их
}

.тип числ._с 4-10
//--------------------------------------------------------------------------
// Числительное четверо - десятеро
//--------------------------------------------------------------------------
{
.число Е
    о, И                // четвер-е
    ых, Р               // четвер-ых
    ым, Д               // четвер-ым
    о, Вн               // четвер-о
    ых, Во              // четвер-ых
    ыми, Т              // четвер-ыми
    ых, П               // четвер-ых
}

.таблица "numcmpr_1"
{
.число Е
    ехсот, Р
    емстам, Д
    ехстах, П
}
